{
    "e2e7cwj": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2e7cwj",
            "Author": "paperraincoat",
            "Date Created": "07-14-2018 16:59:47",
            "Upvotes": 19,
            "Text": "For those just tuning in, here's a brief update. \n\n\nHumans did a pretty solid job of tracking who owed who what for thousands of years, until Roosevelt in [June of 1933](https://www.history.com/this-day-in-history/fdr-takes-united-states-off-gold-standard), decided the US was so big and powerful, its money didn't actually have to be backed by gold anymore. People would just trust  everything was working totally fine, and various people that didn't, were imprisoned, droned or freedom-bombed until their desert countries were a sheet of highly compliant glass.\n\n\nA central bank was entrusted with the job of ~~fucking with~~ 'regulating' markets by both 1) adjusting interest rates, under the auspices of 'stimulating' or 'cooling off' the economy, and 2) printing more money, with no ability to audit how much is printed or why, a plan just as utterly insane as it sounds. \n\n\nTo nobody's surprise whatsoever, the money printers and their friends and colleagues became fabulously wealthy, the economy always seemed to need 'stimulus', rates slowly creeped down to zero and stayed there, and with only one tool in the box and a looming [financial crisis](https://en.wikipedia.org/wiki/Financial_crisis_of_2007%E2%80%932008), central banks turned the money printers up to 11, roughly [$90 billion a month](https://www.investopedia.com/terms/q/quantitative-easing.asp) because YOLO, the next generation can sort this mess out, I'm going to play golf. \n\n\nJapan, the UK, EU and other countries were intrigued by this new 'print metric shit tons of money cause YOLO' technology, and created money printers of their own because well, who *wouldn't* want an ATM in their living room shitting out $34,722 a second in perpetuity. \n\n\nI'll refer to this scenario as 'The Trap', where the day-to-day effects for 98% of the population involve this strange, nagging doubt that no matter how hard you work, how far you advance in your career, or how much you save, it's like trying to blow up an inflatable mattress with several large holes in it. For the 2% that are making absurd amounts of money, their 'job' now is chiefly convincing the other 98% that everything is totally fine, unemployment is great, that [tsunami of debt](http://www.usdebtclock.org) shouldn't be a problem, [debt-to-GDP ratios](https://tradingeconomics.com/united-states/government-debt-to-gdp) can safely be ignored, Keynesian economics is 'on fleek' and inflation is only robbing you if you're a complete idiot and keep your money in cash instead of stocks, real estate, businesses and the like, and no, it's not their problem that [63% of people can't write a check for a $500 emergency](https://www.forbes.com/sites/maggiemcgrath/2016/01/06/63-of-americans-dont-have-enough-savings-to-cover-a-500-emergency/) maybe you should get a job you bum. \n\n\nEscaping The Trap is a nightmare that only a malevolent, vengeful God could have ideated and executed on. \n\n\nThe easiest solution is to be born one of the 2%. Boom, problem solved, your life is now on easy mode, like an endless series of birthday parties that everyone knows you don't deserve.\n\n\nBarring that, you can also get educated, learn about economics, game theory, foster a healthy skepticism for governments and corporations who want to 'help make things easier for you', fall into a well-paying job, save money, don't get sick and somehow, due to that nerd-friend taking about it until you just want him to shut the hell up, invest in a highly volatile, experimental, risky, brand-new asset class while ignoring all your clueless coworkers, friends and family telling you 'wait, isn't that illegal?', 'the Feds will just outlaw it' and 'you're throwing your money away on that ponzi thing', and invest a bit. \n\n\n*you are here*",
            "Edited?": "07-14-2018 20:44:43",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dgmz4": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dgmz4",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 09:02:32",
            "Upvotes": 7,
            "Text": "Pierce the heavens.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dx4l5": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dx4l5",
            "Author": "UpwardCharterhouse",
            "Date Created": "07-14-2018 14:00:11",
            "Upvotes": 4,
            "Text": "Hey guys, any ideas on how to buy BTC with an Amazon Gift Card? I got one for my birthday and am trying to buy some bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dj4c4": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dj4c4",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 09:57:33",
            "Upvotes": 10,
            "Text": "9 comments in 4 hours wow bitcoin is actually dead",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2da4ur": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2da4ur",
            "Author": "kingjones502",
            "Date Created": "07-14-2018 05:30:06",
            "Upvotes": 3,
            "Text": "Am I the only one that has a problem tethering? I'm always scared I'll miss the moon so I end up riding the downwave. Any suggestions on getting my trading emotions in check?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dgd22": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dgd22",
            "Author": "againstmethod",
            "Date Created": "07-14-2018 08:55:35",
            "Upvotes": 3,
            "Text": "Quieter and quieter in this daily thread. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmjfk": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dmjfk",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 11:01:44",
            "Upvotes": 9,
            "Text": "\nLiar, liar, pants on 🔥:\n\n—-\nu/Venom-- - 1d\n\n\n1 bitcoin will fall to $6042 by tomorrow morning 0800 GMT. It will fall to $5870 by Saturday 0700 GMT before it can move back up.  Put your money into USDT then buy the dip. Make $$$ on the bounce.\n\n—-\n\nhttps://www.reddit.com/r/Bitcoin/comments/8y82xq/comment/e2a54hx\n\n\nI hope nobody here still actually believes the fudsters. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ekotq": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2ekotq",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 21:03:22",
            "Upvotes": 4,
            "Text": "🌈  Hopium Time 🚀 🌝  - S02E02\n\n\n\n\nLooks like the action is likely to begin in late August or in the fall:\n\n\n\n—-\n\nHowever, the most important date in the upcoming three months for the entire crypto space is pegged for the SEC hearing on Bitcoin ETFs scheduled for mid-August.\n\nThe CBOE applied to allow ETFs entrance into purchasing BTC directly (this is vastly different than future contracts). When the CBOE received approval to begin trading futures contracts of BTC last year BTC ended its bear market and rallied from under $2,000 to $20,000.\n\nThe SEC has denied prior ETF applicants due to their lack of insurance and lack of infrastructure, the CBOE has met both these requirements. If the SEC were to approve a party to begin ETF purchasing of crypto, whom better than the CBOE? The bear market should begin to rebound due to ETFs entering the crypto market, along with hundreds of billions of dollars in institutional money.\n\nAs more and more cryptos prove to be secure, transparent and successful, there will likely be a rally in the next few months. Experts predict that this rally will not happen until the fourth quarter of 2018 unless the SEC does approve ETF entrance into the crypto space (which if I were a betting man, I’d say the CBOE meets the stringent SEC requirements).\n\n—-\n\nhttps://bitcoinist.com/bitcoin-bear-trend-end-soon/",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2djo5m": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2djo5m",
            "Author": "fallenkeith1990",
            "Date Created": "07-14-2018 10:08:46",
            "Upvotes": 2,
            "Text": "we're mooning guys!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e3bll": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2e3bll",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 15:48:56",
            "Upvotes": 4,
            "Text": "Has anyone heard anything from McAfee?  He said $15k by the end of July, apparently he's never been wrong before or lost a bet ever! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2efg9y": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2efg9y",
            "Author": "relgueta",
            "Date Created": "07-14-2018 19:23:52",
            "Upvotes": 3,
            "Text": "I'm so happy that next halving is almost 2 years away. \n\nJust give 2 years of Bitcoin at 6k.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dkxs0": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dkxs0",
            "Author": "DJWhizzy",
            "Date Created": "07-14-2018 10:33:08",
            "Upvotes": 2,
            "Text": "This may be a naive question, but can anyone explain how the Bitcoin blockchain will continue to operate after all of the coins have been mined?\n\nI know that it will take a while for all of the coins to be mined, but if the blockchain is in operation because of the miners that operate each node, how will the blockchain operate once all of the coins have been mined and miners have no further incentive to mine?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e2by7": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2e2by7",
            "Author": "OliveTBeagle",
            "Date Created": "07-14-2018 15:31:23",
            "Upvotes": 2,
            "Text": "Use of bitcoin to launder money in the Russian indictment released yesterday:  \n\nCOUNT TEN (Conspiracy to Launder Money)\n\n56. Paragraphs 1 through 19, 21 through 49, and 55 are re-alleged and incorporated by reference as if fully set forth herein.\n\n57. To facilitate the purchase of infrastructure used in their hacking activity—including hacking into the computers of U.S. persons and entities involved in the 2016 U.S. presidential election and releasing the stolen documents—the Defendants conspired to launder the equivalent of more than $95,000 through a web of transactions structured to capitalize on the perceived anonymity of cryptocurrencies such as bitcoin.\n\n58. Although the Conspirators caused transactions to be conducted in a variety of currencies, including U.S. dollars, they principally used bitcoin when purchasing servers, registering domains, and otherwise making payments in furtherance of hacking activity. Many of these payments were companies located in the United States that provided payment processing services to hosting companies, domain registrars, and other vendors both international and domestic. The use of bitcoin allowed the Conspirators to avoid direct relationships with traditional financial institutions, allowing them to evade greater scrutiny of their identities and sources of funds.\n\n59. All bitcoin transactions are added to a public ledger called the Blockchain, but the Blockchain identifies the parties to each transaction only by alpha-numeric identifiers known as bitcoin addresses. To further avoid creating a centralized paper trail of all of their purchases, the Conspirators purchased infrastructure using hundreds of different email accounts, in some cases using a new account for each purchase. The Conspirators used fictitious names and addresses in order to obscure their identities and their links to Russia and the Russian government. For example, the dcleaks.com domain was registered and paid for using the fictitious name “Carrie Feehan” and an address in New York. In some cases, as part of the payment process, the Conspirators provided vendors with nonsensical addresses such as “usa Denver AZ,” “gfhgh ghfhgfh fdgfdg WA,” and “1 2 dwd District of Columbia.”\n\n60. The Conspirators used several dedicated email accounts to track basic bitcoin transaction information and to facilitate bitcoin payments to vendors. One of these dedicated accounts, registered with the username “gfadel47,” received hundreds of bitcoin payment requests from approximately 100 different email accounts. For example, on or about February 1, 2016, the gfadel47 account received the instruction to “[p]lease send exactly 0.026043 bitcoin to” a certain thirty-four character bitcoin address. Shortly thereafter, a transaction matching those exact instructions was added to the Blockchain.\n\n61. On occasion, the Conspirators facilitated bitcoin payments using the same computers that they used to conduct their hacking activity, including to create and send test spearphishing emails.\n\nAdditionally, one of these dedicated accounts was used by the Conspirators in or around 2015 to renew the registration of a domain (linuxkrnl.net) encoded in certain X-Agent malware installed on the DNC network.\n\n62. The Conspirators funded the purchase of computer infrastructure for their hacking activity in part by “mining” bitcoin. Individuals and entities can mine bitcoin by allowing their computing power to be used to verify and record payments on the bitcoin public ledger, a service for which they are rewarded with freshly-minted bitcoin. The pool of bitcoin generated from the GRU’s mining activity was used, for example, to pay a Romanian company to register the domain dcleaks.com through a payment processing company located in the United States.\n\n63. In addition to mining bitcoin, the Conspirators acquired bitcoin through a variety of means designed to obscure the origin of the funds. This included purchasing bitcoin through peer-to-peer exchanges, moving funds through other digital currencies, and using pre-paid cards. They also enlisted the assistance of one or more third-party exchangers who facilitated layered transactions through digital currency exchange platforms providing heightened anonymity.\n64. The Conspirators used the same funding structure—and in some cases, the very same pool of funds—to purchase key accounts, servers, and domains used in their election-related hacking activity.\n\na. The bitcoin mining operation that funded the registration payment for dcleaks.com also sent newly-minted bitcoin to a bitcoin address controlled by “Daniel Farell,” the persona that was used to renew the domain linuxkrnl.net. The bitcoin mining operation also funded, through the same bitcoin address, the purchase of servers and domains used in the GRU’s spearphishing operations, including accounts- qooqle.com and account-gooogle.com.\n\nb. On or about March 14, 2016, using funds in a bitcoin address, the Conspirators purchased a VPN account, which they later used to log into the @Guccifer_2 Twitter account. The remaining funds from that bitcoin address were then used on or about April 28, 2016, to lease a Malaysian server that hosted the dcleaks.com website.\n\nc. The Conspirators used a different set of fictitious names (including “Ward DeClaur” and “Mike Long”) to send bitcoin to a U.S. company in order to lease a server used to administer X-Tunnel malware implanted on the DCCC and DNC networks, and to lease two servers used to hack the DNC’s cloud network.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqzrb": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dqzrb",
            "Author": "Wolfen32",
            "Date Created": "07-14-2018 12:17:01",
            "Upvotes": 1,
            "Text": "I had a BIP question. For generating keys offline...  \nIs there a way to manually turn a BIP passphrase into your xpriv?  \nOr an algorithm for generating an xpriv AND addresses without exposing it? Whether it's on paper, or through calculations on a secure drive. Because even hardware wallets have had vulnerabilities in the past. Being able to generate something without it ever touching the internet will be ideal. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eri0s": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2eri0s",
            "Author": "Therippleaffect",
            "Date Created": "07-14-2018 23:17:08",
            "Upvotes": 1,
            "Text": "The feds have taken control of Bitcoin through the cftc and have siphoned most of BTC mc through futures. They are probably pissed they sold all that BTC they got from silk road too early...scumbags.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ew5jm": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2ew5jm",
            "Author": "inforcrypto",
            "Date Created": "07-15-2018 00:57:28",
            "Upvotes": 1,
            "Text": "Serious question: What are the chances of ETF getting approved this time around ? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f3jzf": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2f3jzf",
            "Author": "itsameaitsamario",
            "Date Created": "07-15-2018 04:39:47",
            "Upvotes": 1,
            "Text": "Every now and then I read that Bitcoin isn’t anonymous , I don’t get how? So yes I had to register to purchase some btc, then I moved that out of exchange to some wallet (that doesn’t require ID) then to hardware wallet.. etc. I understand that these addresses can even be used once only (meaning you can’t even trace in-out knowing it’s the same wallet considering that the address is generated every time)\nWhat am I missing? How this can be linked to people or even knowing who is who?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dn1ki": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dn1ki",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:10:36",
            "Upvotes": -2,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dso0g": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dso0g",
            "Author": "LouisGrip",
            "Date Created": "07-14-2018 12:45:15",
            "Upvotes": 0,
            "Text": "If I told you there was going to be one last hoorah which will take us above ATH before Bitcoin becomes stable would you believe me?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ezool": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2ezool",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:32:00",
            "Upvotes": 0,
            "Text": "TROLL TRACE is coming for you trolls.  Watch out!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dspc5": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2dspc5",
            "Author": "_I_O_T_A_",
            "Date Created": "07-14-2018 12:45:52",
            "Upvotes": -2,
            "Text": "[Coinbase exploring to add 5 more coins to their platform:]\n(https://www.marketwatch.com/story/coinbase-says-its-exploring-adding-5-news-coins-to-its-platform-as-bitcoin-slips-2018-07-13)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ed25k": [
        {
            "Parent ID": "t3_8ys014",
            "Comment ID": "e2ed25k",
            "Author": "Juankestein",
            "Date Created": "07-14-2018 18:40:42",
            "Upvotes": -2,
            "Text": "Prices on the floor right now, what the actual hell - also, opinions on ICOs? I'm looking at Unboxed and seems solid to me",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eusa7": [
        {
            "Parent ID": "t1_e2e7cwj",
            "Comment ID": "e2eusa7",
            "Author": "Kristaps1",
            "Date Created": "07-15-2018 00:26:18",
            "Upvotes": 3,
            "Text": "Great stuff! \n\nBut i will write my view on this situation. \n\nFirst i dont know where you all guys and girls live but that is insignificant. Here is situation as i see it, and it is not personal for you  \n\n[paperraincoat](https://www.reddit.com/user/paperraincoat)  but i liked your comment . \n\nThe situation is pretty simple but it is hard to formulate so that majority understands. The thing is majority of people who are in age group 18-30 years live with their parents because income rate for young professionals of any industry is at the minimum level (depends from country) average 1000 EUR a month (salary) for some it is a lot and for some it is pocket money. If you look for data about people able to work form 16-pension that number varies but in most countries it drops like stone, meaning that less people should earn more money to support their communities via taxes. This creates a problem of  insufficiency of money  funds to pay for services by government. These institutions then borrow money from bank, fund, or sells government bonds to fund their responsibilities. The problem is that all the money is already digital and endless. People think that it is covered by gold, silver or land , but it is so only in 10 \\% of all the cases. In most cases EU, USA, CHINA, JAPAN just print money and release it in market.  Banks use fractional reserve banking system and basically loans you numbers in their systems but you have to earn that money and pay interest. There is nothing bad  but this situation makes inflation and every thing gets more expensive, gas, electricity, food prices are going up about 2-8\\% a year but it is by little so you get used to it. When inflation kicks in your salary  stays the same for about a year and your boss says to you: We cant rise your salary because our sales dropped and we just cant sorry. So you work for your salary but prices go up by inflation. \n\nMost of young people cant afford to buy their place so they take mortgage and buy house but because of the fact that governments are printing money your salaries stay low but interest rates go up by a lot to out run inflation and interest on borrowed money ([https://markets.on.nytimes.com/research/markets/overview/overview.asp](https://markets.on.nytimes.com/research/markets/overview/overview.asp)) you can find out how much precisely. This creates a loop of infinite interest payments and endless road of poverty. Money is worthless but it is fixed to gold RIGHT when inflation rises they rise the price of gold and that is the way they fight it but in reality they just change numbers on their screen and simple people live worse. Now comes bitcoin, best thing ever from every perspective. Opinions differ but some say that it has no covered value, my view is that it is a server with multiple functions, you have money function that IS cheaper than using international bank transfers. You have a world wide server infrastructure already in operational state (miners) and it is a finite 17 million is mined and rest 4 million coins will be mined trough to year 2140 so it is a lot of years. If you know there is a blockchain word involved in bitcoin conversations, what is this chain of blocks? It is a operational server that at the moment does only ledger functions but can be used as a server that earns money by storing your information, i like example of web page, how many domains you can name and how much does it cost to maintain it? About 15 USD a month. How many domains there are? A lot and there will be more. Old  BTC transactions are kept on ledger and when you make your mining node you download all of it but is there any use of it ? NO but you could replace it with service of storing zipped information on these blocks and get commission from it so it becomes an income source. In a time when energy is a painful and expensive thing there is a thought that it is not economically viable to mine BTC it is rubbish 70 TWh per year it  is 1/20 of Germany electricity needs a year. It is done to make it sound bad so that people sell, all the negative news, are done out of the same reason. Because banking is so good business that no one will let some BTC take their profits away it is 50 trillion industry [https://www.youtube.com/watch?v=w2tKg3E53DM](https://www.youtube.com/watch?v=w2tKg3E53DM) . And they are making laws in a lot of countries to tax it like a security or commodity and it is coming all over earth. Because banks, funds and people will buy it and pump the price even more than last year. So it is a trend that is very attractive to people that live in poor or countries with high inflation. Because your BTC price is last exchange deal price \\* circulating supply= market cap and you can pump it and when it crashes it redistributes it self naturally and the next wave will be higher than previous one. Some will have more and some will have less as always. And if you read you can find out that about 4 million bitcoins are lost (no one can access their account what ever reason) and all the mining is done for last 4 million coins and you have 120 years to do it so it is useless to mine because computers evolve with amazing speed and that increases difficulty of mining and the competition level of who will make more powerful miner. The trap as you say is living by the old rules and working by the rules. All this invention (BTC) has done is revolutionize the idea that you can gather funds trough Internet , make company that offers some service or product and sell it in open market, the thing is that these new companies dont need office space, that much employees because every thing is getting automated and more accessible thanks to the internet and it is the future of business and banking. Buy BTC or any other good coin and you will be rewarded.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e7rrf": [
        {
            "Parent ID": "t1_e2e7cwj",
            "Comment ID": "e2e7rrf",
            "Author": "theFoot58",
            "Date Created": "07-14-2018 17:07:13",
            "Upvotes": 4,
            "Text": "come in,  have a seat,  The Reverend Jim will be here shortly,  sip of Koolaid?  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e85os": [
        {
            "Parent ID": "t1_e2e7cwj",
            "Comment ID": "e2e85os",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 17:14:08",
            "Upvotes": 0,
            "Text": "Uh, it was Nixon that finally took the U.S. off the gold standard, not Roosevelt.\n\nSome of that 2&#37; worked their way there, like me. On a much larger scale, none of Warren Buffet, Bill Gates, or Jeff Bezos inherited that much.\n\n(Tell you a secret: They didn't sit around thinking they'd get rich off the latest get-rich-quick scheme.)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eivid": [
        {
            "Parent ID": "t1_e2e7cwj",
            "Comment ID": "e2eivid",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:28:37",
            "Upvotes": -4,
            "Text": "I find all these conspiracy theories ironical.\n\nAmericans enjoy one of the highest standard of living in the world.  The average American earn more than most of their peers around the world doing the same job and yet, most are in debt.\n\nThe problem is not the system.  It's just this simple thing about spending more than they can afford and having little savings.  \n\nBut when it comes to blame assignment, it's always some external reason.\n\nMan up ..... You are what you make of your life.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e8ach": [
        {
            "Parent ID": "t1_e2dx4l5",
            "Comment ID": "e2e8ach",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 17:16:23",
            "Upvotes": 4,
            "Text": "Oh, sure. Just buy something with the gift card, then take it down to a pawn store and pawn it off, and then do what you want with the money. Caution: High aggregate transaction costs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e2o80": [
        {
            "Parent ID": "t1_e2dx4l5",
            "Comment ID": "e2e2o80",
            "Author": "xtal_00",
            "Date Created": "07-14-2018 15:37:23",
            "Upvotes": 2,
            "Text": "Paxful",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e0w0y": [
        {
            "Parent ID": "t1_e2dx4l5",
            "Comment ID": "e2e0w0y",
            "Author": "senisende",
            "Date Created": "07-14-2018 15:05:54",
            "Upvotes": 1,
            "Text": "You can sell it on paxfull or localbitcoin",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2esoh9": [
        {
            "Parent ID": "t1_e2dx4l5",
            "Comment ID": "e2esoh9",
            "Author": "Anatomy_of_the_State",
            "Date Created": "07-14-2018 23:41:11",
            "Upvotes": 1,
            "Text": "purse.io",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dku0v": [
        {
            "Parent ID": "t1_e2dj4c4",
            "Comment ID": "e2dku0v",
            "Author": "LemosineRidin",
            "Date Created": "07-14-2018 10:31:09",
            "Upvotes": 4,
            "Text": "Well, No. In fact I’ve bathed my children, ran 3 miles, and cleaned up my house.  Sorry I didn’t have time to fulfill your day yet. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmign": [
        {
            "Parent ID": "t1_e2dj4c4",
            "Comment ID": "e2dmign",
            "Author": "czarnick123",
            "Date Created": "07-14-2018 11:01:17",
            "Upvotes": 3,
            "Text": "Yea. The hypes gone.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2domls": [
        {
            "Parent ID": "t1_e2dj4c4",
            "Comment ID": "e2domls",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:38:10",
            "Upvotes": 2,
            "Text": "Nah, the folks are still here (over 9,500).  \n\nBut I guess most are not in the mood to contribute at the moment.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dk052": [
        {
            "Parent ID": "t1_e2dj4c4",
            "Comment ID": "e2dk052",
            "Author": "minReddit",
            "Date Created": "07-14-2018 10:15:25",
            "Upvotes": -2,
            "Text": "Only left with bag holders. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmzag": [
        {
            "Parent ID": "t1_e2dj4c4",
            "Comment ID": "e2dmzag",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:09:29",
            "Upvotes": 0,
            "Text": "Because this memey place didnt get enough comments in 4 hours? Fucking lol",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ddqvq": [
        {
            "Parent ID": "t1_e2da4ur",
            "Comment ID": "e2ddqvq",
            "Author": "JW4974",
            "Date Created": "07-14-2018 07:41:26",
            "Upvotes": 7,
            "Text": "Watch a movie, have sex.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dbakw": [
        {
            "Parent ID": "t1_e2da4ur",
            "Comment ID": "e2dbakw",
            "Author": "stellarfan",
            "Date Created": "07-14-2018 06:15:26",
            "Upvotes": 3,
            "Text": "Don't look at the price?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2da7nv": [
        {
            "Parent ID": "t1_e2da4ur",
            "Comment ID": "e2da7nv",
            "Author": "gnarfler",
            "Date Created": "07-14-2018 05:33:14",
            "Upvotes": 2,
            "Text": "Tether your expectations.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dc5jh": [
        {
            "Parent ID": "t1_e2da4ur",
            "Comment ID": "e2dc5jh",
            "Author": "minReddit",
            "Date Created": "07-14-2018 06:47:20",
            "Upvotes": 2,
            "Text": "Tether the shit when bart appears",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dayvx": [
        {
            "Parent ID": "t1_e2da4ur",
            "Comment ID": "e2dayvx",
            "Author": "wBergerR",
            "Date Created": "07-14-2018 06:02:38",
            "Upvotes": 0,
            "Text": "Don't worry about moon, bigger chance it will go down next week. Tether your money and put a stoploss on it in case you were wrong.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmgua": [
        {
            "Parent ID": "t1_e2dgd22",
            "Comment ID": "e2dmgua",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:00:29",
            "Upvotes": 1,
            "Text": "We're just thoughtful.  \n\n*The empty vessel makes the greatest sound.*\n\nWS",
            "Edited?": "07-14-2018 11:03:54",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dn54l": [
        {
            "Parent ID": "t1_e2dmjfk",
            "Comment ID": "e2dn54l",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 11:12:23",
            "Upvotes": 6,
            "Text": "Anybody who thinks they can predict hour-to-hour what will happen in an 24/7 worldwide market is, of course, an idiot (or, maybe here, idoit).\n\nOn the other hand, there is the irony:\n\nNews Positive to BTC = Undisputed Truth from God's Lips, Lambos for everybody by the end of the year as BTC moons and becomes the only currency in the whole world.\n\nNews Negative to BTC = FUD, fake news, not credible, totally ignore, doesn't matter if it comes from God's Lips because He is lying and has supported fiat currencies for thousands of years.\n\nAs always, *the truth is found somewhere in the middle*.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmqgz": [
        {
            "Parent ID": "t1_e2dmjfk",
            "Comment ID": "e2dmqgz",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:05:09",
            "Upvotes": 4,
            "Text": "It is actually going to rise quite substantially in the next 24 hours according to my algos.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e02uz": [
        {
            "Parent ID": "t1_e2dmjfk",
            "Comment ID": "e2e02uz",
            "Author": "Venom--",
            "Date Created": "07-14-2018 14:51:43",
            "Upvotes": 0,
            "Text": "TA analysts’ calculated predictions are just that, predictions. They are subject to market conditions. \n\nAs it happened this particular TA didn’t go as low as the person predicted, but I’ve learnt my lesson to not take someone’s TA as an exact prediction of the future.\nRather the best thing to do is consider a handful of TAs from trusted persons and they can give an indicator of market conditions and whether the price will move up or down. In this instance bitcoin fell from $6370 to $6040 briefly. Shortly after that was posted! But that price must have been so tempting to buyers, it shot up.   You have to play it by ear! 👍🏼 \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eluij": [
        {
            "Parent ID": "t1_e2ekotq",
            "Comment ID": "e2eluij",
            "Author": "reakshow",
            "Date Created": "07-14-2018 21:25:40",
            "Upvotes": 4,
            "Text": "> ETFs entering the crypto market, along with hundreds of billions of dollars in institutional money.\n\nDo you honestly see pension funds and state backed investment vehicles plowing billions into an asset with Bitcoin's level of volatility? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ekto6": [
        {
            "Parent ID": "t1_e2ekotq",
            "Comment ID": "e2ekto6",
            "Author": "JW4974",
            "Date Created": "07-14-2018 21:05:59",
            "Upvotes": 1,
            "Text": "Hang on ..... but I thought everyone was blaming the futures for BTC's price decline?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dlzmz": [
        {
            "Parent ID": "t1_e2djo5m",
            "Comment ID": "e2dlzmz",
            "Author": "Juhateme",
            "Date Created": "07-14-2018 10:52:05",
            "Upvotes": 2,
            "Text": "I’m excited. Lets go",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dz8oi": [
        {
            "Parent ID": "t1_e2djo5m",
            "Comment ID": "e2dz8oi",
            "Author": "flyingjules",
            "Date Created": "07-14-2018 14:37:01",
            "Upvotes": 2,
            "Text": "I see",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e86zu": [
        {
            "Parent ID": "t1_e2e3bll",
            "Comment ID": "e2e86zu",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 17:14:46",
            "Upvotes": 2,
            "Text": "Craaazy, crazy for your love . . . . .",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e3kks": [
        {
            "Parent ID": "t1_e2e3bll",
            "Comment ID": "e2e3kks",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 15:53:21",
            "Upvotes": 2,
            "Text": "F him... attention whore. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ekh6z": [
        {
            "Parent ID": "t1_e2e3bll",
            "Comment ID": "e2ekh6z",
            "Author": "AnotherRedditSpammer",
            "Date Created": "07-14-2018 20:59:17",
            "Upvotes": 1,
            "Text": "Nah its gonna be $20k, (Also have never been wrong either.... and have not evidence to back it up)/",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2etyim": [
        {
            "Parent ID": "t1_e2efg9y",
            "Comment ID": "e2etyim",
            "Author": "tofuspider",
            "Date Created": "07-15-2018 00:08:20",
            "Upvotes": 1,
            "Text": "2 years can go past really fast. I still remember the summer 2016 halving and how everyone was excited about it despite the threats from the big blockers and here we are two years later already.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ei9h2": [
        {
            "Parent ID": "t1_e2efg9y",
            "Comment ID": "e2ei9h2",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 20:16:51",
            "Upvotes": -1,
            "Text": "Gives us latecomers a second chance to get on board before it’s too late. \n\nEdit.  May not have to wait two years though for the halvening.   One etf or a few institutional investors could catapult bitcoin into the stratosphere. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dl9ax": [
        {
            "Parent ID": "t1_e2dkxs0",
            "Comment ID": "e2dl9ax",
            "Author": "robotsdev",
            "Date Created": "07-14-2018 10:38:56",
            "Upvotes": 5,
            "Text": "Miners receive the fees from the transactions too.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dn2wg": [
        {
            "Parent ID": "t1_e2dkxs0",
            "Comment ID": "e2dn2wg",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:11:16",
            "Upvotes": 4,
            "Text": "No question is naive DJ. In fact it's refreshing and admirable when people like yourself ask questions. You would not believe the comments that get posted on here from people trying to pretend they understand things like Bitcoin ETFs, 51% attacks etc, and they are clearly clueless but afraid to admit it.\n\nSo yes, miners continue to get paid transaction fees once all coins are mined. This is a very long ways in the future though, and evolving mining technology will likely address any discrepancy between cost of operation and earnings.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ei0ci": [
        {
            "Parent ID": "t1_e2e2by7",
            "Comment ID": "e2ei0ci",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:11:58",
            "Upvotes": 2,
            "Text": "This fucking BS.\n\nYou mean a group of agents sponsored by Russia to conduct a high profile black op had time to ....... mine BTC?????\n\nThis is fucking hilarious.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ehiaj": [
        {
            "Parent ID": "t1_e2e2by7",
            "Comment ID": "e2ehiaj",
            "Author": "blockchaincasino",
            "Date Created": "07-14-2018 20:02:23",
            "Upvotes": 1,
            "Text": "\"$95,000 through a web of transactions structured to capitalize on the perceived anonymity of cryptocurrencies such as bitcoin.\"... \n\nThere you go, BTC is definitely good for international exchange !!!\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2drxhz": [
        {
            "Parent ID": "t1_e2dqzrb",
            "Comment ID": "e2drxhz",
            "Author": "damchi",
            "Date Created": "07-14-2018 12:32:49",
            "Upvotes": 3,
            "Text": "Save this: [https://iancoleman.io/bip39/](https://iancoleman.io/bip39/) to a usb key and run it on an offline computer (might use a live Linux distro)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2excxm": [
        {
            "Parent ID": "t1_e2ew5jm",
            "Comment ID": "e2excxm",
            "Author": "racebum",
            "Date Created": "07-15-2018 01:26:40",
            "Upvotes": 2,
            "Text": "Better. The last time it was denied there were a few issues. It's unlikely the CBOE would come back if they did not feel those issues had been addressed\n\nThe physicist nails the major issues in depth a couple posts down",
            "Edited?": "07-15-2018 01:40:04",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2drk65": [
        {
            "Parent ID": "t1_e2dn1ki",
            "Comment ID": "e2drk65",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 12:26:32",
            "Upvotes": 6,
            "Text": "Do you remember when we were out boating together, and I bought you some flowers, and then I fell in the water.  How we laughed!\n\nWhat happened to us criscrypt?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dn603": [
        {
            "Parent ID": "t1_e2dn1ki",
            "Comment ID": "e2dn603",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:12:49",
            "Upvotes": 3,
            "Text": "Remember when it was $200? Its actually incredible how far Bitcoin has come in such a short time.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e3wiw": [
        {
            "Parent ID": "t1_e2dso0g",
            "Comment ID": "e2e3wiw",
            "Author": "Jaqqarhan",
            "Date Created": "07-14-2018 15:59:14",
            "Upvotes": 4,
            "Text": "It's quite stable right now. The price has been between $5800 and $6800 for an entire month.\n\nIf it goes back up to an ATH again, there will be another crash and more instability. Nothing stabilizes at the top of the bubble. It stabilizes after the crash.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dxwuu": [
        {
            "Parent ID": "t1_e2dso0g",
            "Comment ID": "e2dxwuu",
            "Author": "JW4974",
            "Date Created": "07-14-2018 14:13:58",
            "Upvotes": 2,
            "Text": "Yes.  \n\nRight before the regulators step in.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dszxs": [
        {
            "Parent ID": "t1_e2dso0g",
            "Comment ID": "e2dszxs",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:50:46",
            "Upvotes": 2,
            "Text": "Considering this process had repeated itself multiple times over recent years, it wouldn't be a stretch. But it's unlikely to be the last time. Coin price stability is still a few years out imo. People say just because it's happened over and over that's no reason to assume it will happen again... but the fact is, history is undisputed as an indicator of future events. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e05jc": [
        {
            "Parent ID": "t1_e2dso0g",
            "Comment ID": "e2e05jc",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 14:53:00",
            "Upvotes": 3,
            "Text": "No.  I think we have at least 3 more bubble cycles to go before it is used regularly as a currency.   30k then drop.  100k then drop.   250k then drop.....\n\nI’m not expecting regular use by the masses to begin until around 300k+ ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e8c1q": [
        {
            "Parent ID": "t1_e2dso0g",
            "Comment ID": "e2e8c1q",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 17:17:14",
            "Upvotes": 1,
            "Text": "No. Frankly, I wouldn't believe you if you said it was going back to 10000 either.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2du92o": [
        {
            "Parent ID": "t1_e2dspc5",
            "Comment ID": "e2du92o",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 13:11:45",
            "Upvotes": 7,
            "Text": "All shitcoins.  \n\nZcash is a Ver project - they have promised to shop you to govt agencies - so what's the point in a 'privacy' coin like that :)  \n\nCompletely undermined by its own developers.\n\nSilly buggers.  \n\nConbase will always remembered as a very suspect launchpad for Bcash.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dxs2k": [
        {
            "Parent ID": "t1_e2dspc5",
            "Comment ID": "e2dxs2k",
            "Author": "JW4974",
            "Date Created": "07-14-2018 14:11:36",
            "Upvotes": 1,
            "Text": "What do you expect from a company that makes money from transaction fees?\n\nI very much doubt \"Good for bitcoin\" is their company mantra.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eegl7": [
        {
            "Parent ID": "t1_e2ed25k",
            "Comment ID": "e2eegl7",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 19:05:53",
            "Upvotes": 2,
            "Text": "Oh, go ahead.  \n\nWhile the leading coin and everything else is falling, put your money into another imaginary shitcoin ..\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e9hbi": [
        {
            "Parent ID": "t1_e2e85os",
            "Comment ID": "e2e9hbi",
            "Author": "RickityRickRick",
            "Date Created": "07-14-2018 17:37:23",
            "Upvotes": 3,
            "Text": "Why are you still here? Have you not been liquidated into oblivion yet?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eacv4": [
        {
            "Parent ID": "t1_e2e85os",
            "Comment ID": "e2eacv4",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 17:52:42",
            "Upvotes": 3,
            "Text": "Uh oh.  Someone's been skimming a wiki page and is presenting himself as an instant expert in gold standards ..\n\n(Why does nobody ever do this with anything REALLY complicated ..)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ejjlx": [
        {
            "Parent ID": "t1_e2e85os",
            "Comment ID": "e2ejjlx",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:41:20",
            "Upvotes": 1,
            "Text": "Actually, we were all screwed when Nathan Rothschild invented the central banks.  Nixon is just a small time minion.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ek6de": [
        {
            "Parent ID": "t1_e2eivid",
            "Comment ID": "e2ek6de",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 20:53:30",
            "Upvotes": 1,
            "Text": "The USA is the 1% of the world. \nIt’s not good enough for individual Americans though. They want to be 0.00001% of the world or just a 2 percentager in USA.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2fg2b7": [
        {
            "Parent ID": "t1_e2eivid",
            "Comment ID": "e2fg2b7",
            "Author": "AdvancedExpert8",
            "Date Created": "07-15-2018 10:46:20",
            "Upvotes": 1,
            "Text": "America still has poverty ya ding dong",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e691a": [
        {
            "Parent ID": "t1_e2e2o80",
            "Comment ID": "e2e691a",
            "Author": "UpwardCharterhouse",
            "Date Created": "07-14-2018 16:40:25",
            "Upvotes": 4,
            "Text": "I looked at Paxful and the cheapest bitcoin is going for $8500",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dlq6q": [
        {
            "Parent ID": "t1_e2dk052",
            "Comment ID": "e2dlq6q",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 10:47:26",
            "Upvotes": 2,
            "Text": "I bet you wish you could afford 'bags' worth $6230 each!  Maybe one day if you stop wasting your time on forums!  :) ",
            "Edited?": "07-14-2018 10:53:29",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmg9j": [
        {
            "Parent ID": "t1_e2dk052",
            "Comment ID": "e2dmg9j",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:00:11",
            "Upvotes": 1,
            "Text": "I've held your wife too.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnajs": [
        {
            "Parent ID": "t1_e2dk052",
            "Comment ID": "e2dnajs",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:15:03",
            "Upvotes": -1,
            "Text": "Really how much you holding?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dca34": [
        {
            "Parent ID": "t1_e2dbakw",
            "Comment ID": "e2dca34",
            "Author": "gotnoskillz",
            "Date Created": "07-14-2018 06:51:43",
            "Upvotes": 1,
            "Text": "^This",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dng7x": [
        {
            "Parent ID": "t1_e2dn54l",
            "Comment ID": "e2dng7x",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 11:17:51",
            "Upvotes": 5,
            "Text": "I don’t have a problem with people posting topical negative news if they sincerely believe there is a problem.  However the fudsters with an agenda that repeatedly post only negative information in a effort to scare others and possibly bring the price down - that is low life. \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnbyb": [
        {
            "Parent ID": "t1_e2dn54l",
            "Comment ID": "e2dnbyb",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:15:44",
            "Upvotes": 2,
            "Text": "> As always, the truth is found somewhere in the middle.\n\n relativist.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e8ixs": [
        {
            "Parent ID": "t1_e2dn54l",
            "Comment ID": "e2e8ixs",
            "Author": "Venom--",
            "Date Created": "07-14-2018 17:20:34",
            "Upvotes": 1,
            "Text": "Exactly.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dwjtm": [
        {
            "Parent ID": "t1_e2dn54l",
            "Comment ID": "e2dwjtm",
            "Author": "gotnoskillz",
            "Date Created": "07-14-2018 13:50:13",
            "Upvotes": 0,
            "Text": "LMAO ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnykz": [
        {
            "Parent ID": "t1_e2dmqgz",
            "Comment ID": "e2dnykz",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 11:26:50",
            "Upvotes": 3,
            "Text": "I hope your algos take us above 6850 soon, this is a boring range to be in. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e0unv": [
        {
            "Parent ID": "t1_e2e02uz",
            "Comment ID": "e2e0unv",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 15:05:13",
            "Upvotes": 3,
            "Text": "You spoke as if it were fact and you KNEW exactly what would happen. Even posted times and advised people to sell based on it.   \n\nNo ... you are not a TA analyst.  You’re a classic fudster.  \n\nYour “prediction” was bs.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2exxa9": [
        {
            "Parent ID": "t1_e2eluij",
            "Comment ID": "e2exxa9",
            "Author": "racebum",
            "Date Created": "07-15-2018 01:41:38",
            "Upvotes": 3,
            "Text": "Yes actually because the volatility truly can be set at any level you want it to be since we have futures. For example if you want to have a slightly long bias you could do 60% long 40% short and that's just on pure Bitcoin what if you have a fund that is made up of a lot of Diversified asset classes and only 1% of your money is in Bitcoin. Now if it does well you gain something and if it does poorly it's not going to affect the overall fund that much. There are all kinds of ways to use it effectively in a major investment. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2emle9": [
        {
            "Parent ID": "t1_e2eluij",
            "Comment ID": "e2emle9",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 21:39:54",
            "Upvotes": 3,
            "Text": "Yup. Eventually. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2emdof": [
        {
            "Parent ID": "t1_e2eluij",
            "Comment ID": "e2emdof",
            "Author": "JW4974",
            "Date Created": "07-14-2018 21:35:49",
            "Upvotes": 0,
            "Text": "You are going to see hypocrisy and self-serving responses.\n\nThose desperate for a BTC price increase will root for it.  The pension holders be damned if BTC price crashes.\n\nOf course, all disguised as being \"good for Bitcoin\".  Fucking hypocrites.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ewcbt": [
        {
            "Parent ID": "t1_e2ekto6",
            "Comment ID": "e2ewcbt",
            "Author": "_I_O_T_A_",
            "Date Created": "07-15-2018 01:01:50",
            "Upvotes": 1,
            "Text": "Many, yes.\n\nBut not everyone.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e4dqo": [
        {
            "Parent ID": "t1_e2e3kks",
            "Comment ID": "e2e4dqo",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 16:07:42",
            "Upvotes": 2,
            "Text": "Agreed but it would be interesting to see what he says about his $15k prediction.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ejoru": [
        {
            "Parent ID": "t1_e2ei9h2",
            "Comment ID": "e2ejoru",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 20:44:06",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": "08-09-2018 08:36:30",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dlgbu": [
        {
            "Parent ID": "t1_e2dl9ax",
            "Comment ID": "e2dlgbu",
            "Author": "DJWhizzy",
            "Date Created": "07-14-2018 10:42:27",
            "Upvotes": 3,
            "Text": "Ahh, got it. Thank you ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnsi6": [
        {
            "Parent ID": "t1_e2dn2wg",
            "Comment ID": "e2dnsi6",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:23:51",
            "Upvotes": -3,
            "Text": "In other words, it's theoretical and no one has a clue on how it can be implemented.\n\nIt's currently a false economy where the cost of transacting is offset by the price of BTC.  Once last coin is mined, the full cost of mining will have to be recovered through transaction fees.  The cost will either be so high that it's no longer viable to transact or the security compromised as hash power is reduced.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ehm1r": [
        {
            "Parent ID": "t1_e2ehiaj",
            "Comment ID": "e2ehm1r",
            "Author": "OliveTBeagle",
            "Date Created": "07-14-2018 20:04:22",
            "Upvotes": 1,
            "Text": "It's very clear that bitcoin's killer app is illicit trade.  \n\nIt's very good for human trafficking, drug deals, money laundering, terrorism, and now state sponsored cyber attacks on western democracies.\n\nWhat an awesome technology this is. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eylnx": [
        {
            "Parent ID": "t1_e2excxm",
            "Comment ID": "e2eylnx",
            "Author": "inforcrypto",
            "Date Created": "07-15-2018 02:00:26",
            "Upvotes": 1,
            "Text": "Thanks, saw that now.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eyv3d": [
        {
            "Parent ID": "t1_e2excxm",
            "Comment ID": "e2eyv3d",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:07:53",
            "Upvotes": 1,
            "Text": "You’re giving me too much credit. I simply linked to an article.  But the author did a good job there. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dygs0": [
        {
            "Parent ID": "t1_e2drk65",
            "Comment ID": "e2dygs0",
            "Author": "Chimichanga007",
            "Date Created": "07-14-2018 14:23:33",
            "Upvotes": 0,
            "Text": "Yes,  precious.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dngd3": [
        {
            "Parent ID": "t1_e2dn603",
            "Comment ID": "e2dngd3",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 11:17:56",
            "Upvotes": 0,
            "Text": "The Dutch once said the same thing about tulip bulbs: \"Wow! Can you believe these things are actually selling for like 5 acres of good farmland!\"\n\nThere was also those many years when Blockbuster Video was a huge deal, heck, they had their own major college bowl game for many years. Now, one store is left (in Alaska).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dyxcg": [
        {
            "Parent ID": "t1_e2dxwuu",
            "Comment ID": "e2dyxcg",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 14:31:31",
            "Upvotes": 2,
            "Text": "Probably needs some regulation.  All new techs need some regulation.  Shitcoins certainly do.\n\nThat's why following the invention of any technology, e.g. the internal combustion engine, someone will eventually come up with regulations.  In the stated case a speed limit for automobiles.  Why?  To piss upon the masses?  Nope: to protect reasonable people.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ehoc5": [
        {
            "Parent ID": "t1_e2e05jc",
            "Comment ID": "e2ehoc5",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:05:34",
            "Upvotes": 1,
            "Text": "Cute.  Why stop at 250k?\n\nWhy not keep going ATH until it takes over all the fiat?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e3ry0": [
        {
            "Parent ID": "t1_e2du92o",
            "Comment ID": "e2e3ry0",
            "Author": "_I_O_T_A_",
            "Date Created": "07-14-2018 15:57:01",
            "Upvotes": 2,
            "Text": "Well... don't shoot the messenger.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e1iwg": [
        {
            "Parent ID": "t1_e2dxs2k",
            "Comment ID": "e2e1iwg",
            "Author": "JW4974SUCKSDICK",
            "Date Created": "07-14-2018 15:17:13",
            "Upvotes": 1,
            "Text": "Coinbase doesn't have a mantra or slogan and you aren't capable of seeing anything but negativity as demonstrated by your submission history.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2hljah": [
        {
            "Parent ID": "t1_e2e691a",
            "Comment ID": "e2hljah",
            "Author": "xtal_00",
            "Date Created": "07-16-2018 12:25:54",
            "Upvotes": 1,
            "Text": "Anonymity has a price.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2doqb7": [
        {
            "Parent ID": "t1_e2dlq6q",
            "Comment ID": "e2doqb7",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:39:53",
            "Upvotes": 2,
            "Text": "Well, the Satoshi size bags are much cheaper and affordable.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo0j4": [
        {
            "Parent ID": "t1_e2dlq6q",
            "Comment ID": "e2eo0j4",
            "Author": "minReddit",
            "Date Created": "07-14-2018 22:07:45",
            "Upvotes": 1,
            "Text": "Sentiment on the forums is important for trade though. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enwy5": [
        {
            "Parent ID": "t1_e2dmg9j",
            "Comment ID": "e2enwy5",
            "Author": "minReddit",
            "Date Created": "07-14-2018 22:05:51",
            "Upvotes": 1,
            "Text": "I am holding your mother. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enz2y": [
        {
            "Parent ID": "t1_e2dnajs",
            "Comment ID": "e2enz2y",
            "Author": "minReddit",
            "Date Created": "07-14-2018 22:07:00",
            "Upvotes": 1,
            "Text": "I trade, not holding.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dpm3r": [
        {
            "Parent ID": "t1_e2dng7x",
            "Comment ID": "e2dpm3r",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:54:13",
            "Upvotes": 3,
            "Text": "If the price goes down by negative news being spread in this sub, then the crypto market is totally FUBAR.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dq4nx": [
        {
            "Parent ID": "t1_e2dng7x",
            "Comment ID": "e2dq4nx",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:02:40",
            "Upvotes": 4,
            "Text": "This guy is always posting negative shit. He has a very limited comprehension of the things he tries to comment about and it shows. \nI mean unless he has no life what's in it for him? I smell a fuddy agenda.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dptqq": [
        {
            "Parent ID": "t1_e2dng7x",
            "Comment ID": "e2dptqq",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 11:57:38",
            "Upvotes": 2,
            "Text": "Okay, there is reasonableness in that statement. But you also have to consider that the converse is equally true, i.e., those people who spread only good news to artificially pump the price so that they can later dump at a higher price, and which often ends up distorting the price downwards in a way worse then if they had done nothing at all.\n\nThat's why BTC and all crypto have a bad reputation among investors right now, which is that December 2017 was simply a massive pump-and-dump. Of course, nobody complained about all that fake good news when they thought they were getting rich, i.e., greed took over. In retrospect, BTC would have been better off had the December 2017 bubble never developed and it had continued its slow and steady growth. Now, there is a very real possibility that BTC is mortally wounded because the biggest investors who really drive investments markets will forever stay away.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnk3v": [
        {
            "Parent ID": "t1_e2dnbyb",
            "Comment ID": "e2dnk3v",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 11:19:46",
            "Upvotes": 4,
            "Text": "And realist!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e4ibu": [
        {
            "Parent ID": "t1_e2e0unv",
            "Comment ID": "e2e4ibu",
            "Author": "Venom--",
            "Date Created": "07-14-2018 16:09:57",
            "Upvotes": 0,
            "Text": "It wasn’t mine. It was some crypto expert from twitter. \n\nThe Bitcoin worldwide market is massive, it’s not influenced by a small English language forum. \n\nBut if a person is on reddit only shilling positive news then they are a fudster too!  \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enee5": [
        {
            "Parent ID": "t1_e2emle9",
            "Comment ID": "e2enee5",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 21:55:48",
            "Upvotes": -7,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo423": [
        {
            "Parent ID": "t1_e2emdof",
            "Comment ID": "e2eo423",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:09:40",
            "Upvotes": 3,
            "Text": "You realize you're a narcissist right? Try considering alternative viewpoints before you lose all ability to practice rational thinking. The best perspectives come from an open mind and the awareness that you can't always be right.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ezdfr": [
        {
            "Parent ID": "t1_e2emdof",
            "Comment ID": "e2ezdfr",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:22:37",
            "Upvotes": 1,
            "Text": "You forgot “rent seeker” you coward. Too scared to post under your real username u/btc4trade ? \n\nHmmm?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e6nmi": [
        {
            "Parent ID": "t1_e2e4dqo",
            "Comment ID": "e2e6nmi",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 16:47:26",
            "Upvotes": 1,
            "Text": "It’s not end of July yet.  I’m curious as to his explanation too ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ek13v": [
        {
            "Parent ID": "t1_e2ejoru",
            "Comment ID": "e2ek13v",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:50:42",
            "Upvotes": 3,
            "Text": "I heard that Santa Claus and his elves are in on this too.\n\nThey are going to run the trust company.  IPO this Christmas.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ejw1l": [
        {
            "Parent ID": "t1_e2ejoru",
            "Comment ID": "e2ejw1l",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 20:48:00",
            "Upvotes": 3,
            "Text": "Nobody knows when, but interest has been expressed. Regulatory clarity needs to be in place before institutional money flows further into crypto. Don't kid yourself though, it's coming.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dttan": [
        {
            "Parent ID": "t1_e2dnsi6",
            "Comment ID": "e2dttan",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 13:04:25",
            "Upvotes": 3,
            "Text": "Not at all, it's actually not theoretical... well unless you fail to envision, assuming we continue to see computing power increase as it almost inevitably will, that mining equipment will be much more affordable. \nBased on the fact that anything can fail to come into fruition, you can say anything is theoretical. But that's just living a horribly pessimistic and miserable existence. Who would choose to live that way? Oh .... wait :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ep3t0": [
        {
            "Parent ID": "t1_e2ehm1r",
            "Comment ID": "e2ep3t0",
            "Author": "omnologist",
            "Date Created": "07-14-2018 22:29:21",
            "Upvotes": 2,
            "Text": "Right now cash money is used for all of those. It’s not like prostitution and drugs didn’t exist before bitcoin. Truth is, no matter what system is in place there will be criminals that abuse it so I don’t subscribe to that argument that’s been spoon fed on mainstream media to scare the mainstream lemmings. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ej68v": [
        {
            "Parent ID": "t1_e2ehm1r",
            "Comment ID": "e2ej68v",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 20:34:19",
            "Upvotes": 1,
            "Text": "The sad reality is that porn, war, and crime have contributed to main stream adoption of many innovative technologies we all enjoy today. In a long trailed way ...but still a fact nevertheless.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ejqth": [
        {
            "Parent ID": "t1_e2ehm1r",
            "Comment ID": "e2ejqth",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:45:11",
            "Upvotes": 1,
            "Text": "That is bullshit.\n\nI mean, how the hell do you make a drug deal when the price can drop 20% before you ship the good stuff?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ez98y": [
        {
            "Parent ID": "t1_e2eyv3d",
            "Comment ID": "e2ez98y",
            "Author": "racebum",
            "Date Created": "07-15-2018 02:19:15",
            "Upvotes": 3,
            "Text": "Maybe. But you shared it. There for you deserve some appreciation",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ezhh1": [
        {
            "Parent ID": "t1_e2eyv3d",
            "Comment ID": "e2ezhh1",
            "Author": "inforcrypto",
            "Date Created": "07-15-2018 02:26:00",
            "Upvotes": 2,
            "Text": "Please keep posting daily hopiums. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2douqs": [
        {
            "Parent ID": "t1_e2dngd3",
            "Comment ID": "e2douqs",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:41:47",
            "Upvotes": 4,
            "Text": "What's your point other then constantly spamming bullshit on reddit? People \nhave been comparing a lot of stuff to tulips over the years and sometime they end up being right, sometime they don't. Can't you come up with something that hasn't already been said a thousand times by the pessimists of the world?\n\nYou and that clueless JW4984 guy should start a website about all the idiotic things you have both said on reddit. You both suffer from the same thing: Your need to always be right has gotten in the way of your need to learn more so you can actually be right.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2drmxp": [
        {
            "Parent ID": "t1_e2dngd3",
            "Comment ID": "e2drmxp",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 12:27:51",
            "Upvotes": 5,
            "Text": "Here's a man who read a paragraph of economic history, and is now regards himself a professor in the subject :)\n\n(Tulip numbers, BTW, were not limited to 21 million !)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2do57w": [
        {
            "Parent ID": "t1_e2dngd3",
            "Comment ID": "e2do57w",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 11:29:58",
            "Upvotes": 2,
            "Text": "I miss blockbuster video.   Nice place to walk around hunting for a movie for the night after a dinner out.    We are losing all the late night places to go to just wander around.   Tower records was great too.  All long gone. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dnzj1": [
        {
            "Parent ID": "t1_e2dngd3",
            "Comment ID": "e2dnzj1",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:27:18",
            "Upvotes": 1,
            "Text": "Someone moron is going to tell you that $200 is not possible because a zillion $ has been pumped into the hashing equipment.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e51fd": [
        {
            "Parent ID": "t1_e2dyxcg",
            "Comment ID": "e2e51fd",
            "Author": "vroomDotClub",
            "Date Created": "07-14-2018 16:19:28",
            "Upvotes": 0,
            "Text": "yes the government loves you. and i got a bridge for sale.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ei5cd": [
        {
            "Parent ID": "t1_e2ehoc5",
            "Comment ID": "e2ei5cd",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 20:14:39",
            "Upvotes": 1,
            "Text": "I don’t see it completely taking over fiat in our lifetimes.  Maybe 50% at most in 10 years.  There will still be many holdouts (older generations) using credit card and cash for a while.  Price will begin to stabilize at 300k+ due to the sheer number of users at that point.   Much harder for individual whales to substantially affect the price at that level. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ehsba": [
        {
            "Parent ID": "t1_e2e3ry0",
            "Comment ID": "e2ehsba",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:07:41",
            "Upvotes": 1,
            "Text": "No worries mate.  We still love you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e5t83": [
        {
            "Parent ID": "t1_e2e3ry0",
            "Comment ID": "e2e5t83",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 16:32:56",
            "Upvotes": 0,
            "Text": "?  The point of that aphorism is that the messenger is not guilty.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dq5xx": [
        {
            "Parent ID": "t1_e2dpm3r",
            "Comment ID": "e2dq5xx",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:03:14",
            "Upvotes": 1,
            "Text": "Exactly ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqedq": [
        {
            "Parent ID": "t1_e2dq4nx",
            "Comment ID": "e2dqedq",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:07:12",
            "Upvotes": -1,
            "Text": "Hey Shorty, I think you need to change your nick to something that is less obvious.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e5t95": [
        {
            "Parent ID": "t1_e2e4ibu",
            "Comment ID": "e2e5t95",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 16:32:57",
            "Upvotes": 2,
            "Text": "You should have added a disclaimer to your post then.  You spoke as if it were fact. \n\n\nI almost never post FUD (fear, uncertainty, and doubt) because I am an unabashedly diehard bitcoin supporter.  It’s what we permabulls do. \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enk0l": [
        {
            "Parent ID": "t1_e2enee5",
            "Comment ID": "e2enk0l",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 21:58:56",
            "Upvotes": 8,
            "Text": "Look. I’m sorry you were born so extremely pessimistic and cowardly that you are unable to see the potential of this new asset class, but that’s no reason to take your frustration out on me.  Perhaps find something else to do to occupy your time.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2esvye": [
        {
            "Parent ID": "t1_e2enee5",
            "Comment ID": "e2esvye",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 23:45:33",
            "Upvotes": 2,
            "Text": "You are a strange one.\n\nOn the face of it you have all of these pseudo-clever arguments against crypto and adoption.\n\nBut when you read carefully, they are not anti-crypto, they are not even anti-Bitcoin.  They are more specific than that.\n\nAll of your negative comments, going back weeks, are against BTC.\n\nYou are very specific about that, and very consistent - you always write BTC.\n\nI think you are a Bcashing troll.  \n\nQuite a sophisticated one - probably the best they have got :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo8vw": [
        {
            "Parent ID": "t1_e2eo423",
            "Comment ID": "e2eo8vw",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:12:22",
            "Upvotes": -2,
            "Text": "Another self serving hypocrite.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ebc2k": [
        {
            "Parent ID": "t1_e2e6nmi",
            "Comment ID": "e2ebc2k",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 18:09:53",
            "Upvotes": 1,
            "Text": "Why do you’s care? He wants attention and thinks people care about his murdering, coked up asinine thoughts. The guy can’t talk without coughing from doing so much blow. His mind is mush. It hurts Bitcoin that he supports it. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eljhl": [
        {
            "Parent ID": "t1_e2ejw1l",
            "Comment ID": "e2eljhl",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 21:19:52",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": "08-09-2018 08:36:28",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2emy9i": [
        {
            "Parent ID": "t1_e2ejw1l",
            "Comment ID": "e2emy9i",
            "Author": "JW4974",
            "Date Created": "07-14-2018 21:47:04",
            "Upvotes": -1,
            "Text": "Regulatory is needed.  The challenge is that this requires cooperation across many governments.\n\nAmerican regulators have no jurisdiction beyond America's shores.  Look at how Bitfinex gave them the middle finger when subpoenaed.\n\nChance of ETF - Zero.  And it's the right decision.\n\n ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2em7ei": [
        {
            "Parent ID": "t1_e2ejw1l",
            "Comment ID": "e2em7ei",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "07-14-2018 21:32:29",
            "Upvotes": -2,
            "Text": "1000 people control 40% of the market. Institutions are smart enough to know these people will cash out and leave the institutions holding their bags as soon as the money poured in. **Institutional money is never coming.**",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2duo1v": [
        {
            "Parent ID": "t1_e2dttan",
            "Comment ID": "e2duo1v",
            "Author": "JW4974",
            "Date Created": "07-14-2018 13:18:43",
            "Upvotes": 0,
            "Text": "See?  Again you fail to understand basic economics.\n\nIt does not matter that the cost/hash goes down.  When there is X amount of $ to be made (either through price of BTC or transaction fee), pools will compete till market equilibrium is reached.\n\nSo as I have explained, there are only two possible scenarios.  Either transaction fee (which is offset by BTC price) goes up or security goes down.  Whatever savings in cost/hash needed to secure is offset by the same savings in cost/hash needed to compromise BTC's security.\n\nGot it?  Sigh.....",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ewvp7": [
        {
            "Parent ID": "t1_e2ep3t0",
            "Comment ID": "e2ewvp7",
            "Author": "OliveTBeagle",
            "Date Created": "07-15-2018 01:14:45",
            "Upvotes": 1,
            "Text": "Society has built a shitload of obstacles to making it more difficult to do this at scale.  The concern is less about street trade and more about the big players who have to move massive amounts of cash. \n\nThis isn't a scare tactic - it's fucking real that bitcoin is going to be used for very nefarious purposes and will facilitate  massive amounts of illicit activity.  You might want to write this off - but people will be hurt, some will die and bad guys will be able to shuttle cash to where they need it with a tiny fraction of the transactional risk that exists today.  \n",
            "Edited?": "07-15-2018 01:18:29",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ekkgb": [
        {
            "Parent ID": "t1_e2ejqth",
            "Comment ID": "e2ekkgb",
            "Author": "AnotherRedditSpammer",
            "Date Created": "07-14-2018 21:01:00",
            "Upvotes": 1,
            "Text": "Well I guess that will put the price of *dodgy stuff* even higher",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ezkiu": [
        {
            "Parent ID": "t1_e2ezhh1",
            "Comment ID": "e2ezkiu",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:28:32",
            "Upvotes": 1,
            "Text": ":) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dp10f": [
        {
            "Parent ID": "t1_e2douqs",
            "Comment ID": "e2dp10f",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:44:32",
            "Upvotes": 0,
            "Text": "?  why am I dragged into this\n\nI like Tulips by the way.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dpzwx": [
        {
            "Parent ID": "t1_e2douqs",
            "Comment ID": "e2dpzwx",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 12:00:29",
            "Upvotes": -5,
            "Text": "One can say that it is just so much internet chatter, but to the folks who bought in circa. December 2017, they lost a lot of real money, and not just a few could not afford the losses, i.e., people who cashed out their retirement plans or bought crypto using credit card debt. Those losses are very real hard losses. Financial Darwinism, yes, but painful to watch nonetheless.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dsov0": [
        {
            "Parent ID": "t1_e2drmxp",
            "Comment ID": "e2dsov0",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:45:39",
            "Upvotes": 5,
            "Text": "It's easy to criticize Bitcoin when the coin price is down. Many people are so very stuck on the market aspect of Bitcoin they have no ability to comprehend the efforts underway to bring Bitcoin mainstream as a currency. It's almost as if they deny the potential intentionally to fulfill some agenda.",
            "Edited?": "07-14-2018 13:06:11",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2etmac": [
        {
            "Parent ID": "t1_e2drmxp",
            "Comment ID": "e2etmac",
            "Author": "aidanlister",
            "Date Created": "07-15-2018 00:01:05",
            "Upvotes": 1,
            "Text": "But how many satoshis are there? Is that the best unit to talk about scarcity?\n\nYou can’t buy anything with half a tulip- you cam buy plenty with half a BTC.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2doxp7": [
        {
            "Parent ID": "t1_e2do57w",
            "Comment ID": "e2doxp7",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:43:03",
            "Upvotes": 2,
            "Text": "Ha ha, yeah something to be said for that whole process! I miss it too, except when the weather is crappy and I'm thankful for Netflix lol.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dp02k": [
        {
            "Parent ID": "t1_e2dnzj1",
            "Comment ID": "e2dp02k",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 11:44:06",
            "Upvotes": 2,
            "Text": "You have zero credibility and your comments come from a very uninformed perspective. Rant all you want.. you have nothing of value to input. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dphz2": [
        {
            "Parent ID": "t1_e2dnzj1",
            "Comment ID": "e2dphz2",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:52:21",
            "Upvotes": 1,
            "Text": "And there's still those who think that because the price is going up, then it means that money is flowing in, when in fact, it's just 0,001 orders being fulfilled creating a fake upper trend...  \n\nF*ck, we don't even know if the numbers showing in markets such as Bitfinex are really true or not... They could be raising the price and engaging in Inside trading for all we know... ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e6u5s": [
        {
            "Parent ID": "t1_e2e5t95",
            "Comment ID": "e2e6u5s",
            "Author": "Venom--",
            "Date Created": "07-14-2018 16:50:41",
            "Upvotes": 0,
            "Text": "Mate. I read a lot of TAs. But I’m always aware they are forecasts.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2epyvy": [
        {
            "Parent ID": "t1_e2enk0l",
            "Comment ID": "e2epyvy",
            "Author": "Occams_shaving_soap",
            "Date Created": "07-14-2018 22:46:14",
            "Upvotes": 6,
            "Text": "Apparently there are a lot of people angry about crypto (did they lose their shorts?) and they’re becoming more vitriolic on these subs. Ignore them and keep up the hopium. Some of us hodlers need the optimism. 😉",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo315": [
        {
            "Parent ID": "t1_e2enk0l",
            "Comment ID": "e2eo315",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 22:09:06",
            "Upvotes": -3,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2etsbl": [
        {
            "Parent ID": "t1_e2esvye",
            "Comment ID": "e2etsbl",
            "Author": "tofuspider",
            "Date Created": "07-15-2018 00:04:40",
            "Upvotes": 3,
            "Text": "Jihan Wu's 4974th sockpuppet = JW4974\n\nOkay, I'm done with my tinfoil hat for now :p\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eyndf": [
        {
            "Parent ID": "t1_e2esvye",
            "Comment ID": "e2eyndf",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:01:46",
            "Upvotes": 2,
            "Text": "Just a guess but I think he’s (jw4974) u/btc4trade.\n\nHe started posting here right after that guy left. \n\nThey have a similar writing style, and afaik is the only other guy around here that has been so hateful to me. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eolzb": [
        {
            "Parent ID": "t1_e2eo8vw",
            "Comment ID": "e2eolzb",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:19:36",
            "Upvotes": 3,
            "Text": "Yes the whole world is wrong, including any financial expert or brilliant coder that feels there is a bright future for Bitcoin. Everyone! We're all assholes who have no clue, and only you alone have the answers. Perhaps you should send out a team to burn us all to a stake, and write bitcoin supporters on our doors in blood.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ezim7": [
        {
            "Parent ID": "t1_e2eo8vw",
            "Comment ID": "e2ezim7",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:26:58",
            "Upvotes": 1,
            "Text": "[https://imgflip.com/i/2crzik](https://imgflip.com/i/2crzik)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ecan4": [
        {
            "Parent ID": "t1_e2ebc2k",
            "Comment ID": "e2ecan4",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 18:26:55",
            "Upvotes": 1,
            "Text": "That’s harsh.  He can be interesting sometimes; however, it seems so far, a Nostradamus he is not. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2emfk7": [
        {
            "Parent ID": "t1_e2eljhl",
            "Comment ID": "e2emfk7",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 21:36:49",
            "Upvotes": 1,
            "Text": "Ok so you disagree, got it. Many well respected and intelligent people have expressed their expectations on both sides of this, and it is not as simple as \"oh look what happened in the post bubble days, we should avoid it like a plague\". How you or I may disagree on the outcome is not relevant, I realize this, but my point is that many believe that regulatory clarity combined with a lower coin price point of entry may be an attractive scenario for many institutional investors. \nI still have no doubt that it will remain a high risk category, but there is demand for that. I've reviewed several proposed portfolio allocation charts. It's almost certain to happen eventually, but I am not so naive as to think this is going to occur tomorrow.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enbb7": [
        {
            "Parent ID": "t1_e2eljhl",
            "Comment ID": "e2enbb7",
            "Author": "JW4974",
            "Date Created": "07-14-2018 21:54:07",
            "Upvotes": 1,
            "Text": "It can get far worse.  Remember the 2008 crisis and the greed of bankers?\n\nAfter ETFs, synthetic and leveraged ETFs will come.  Then all sort of \"creative\" derivatives will arrive with BTC risks embedded so deep that buyers won't even know.\n\nThen when BTC crash, the entire house of cards will create another financial crisis.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enfr0": [
        {
            "Parent ID": "t1_e2emy9i",
            "Comment ID": "e2enfr0",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 21:56:32",
            "Upvotes": 3,
            "Text": "I hear many opinions on this, and have had lengthy discussions with several financial professionals and even with a few investors and miners who have been involved with crypto for over 6 years. It never ceases to amaze me how equally intelligent and informed people can have such differing opinions on Bitcoin ETFs and institutional investment. \nIf I could have one request granted regarding how people Express their side of a debate, it would be the communication of opinion versus proven fact. Because nobody can state their opinion on something that may or may not happen as though it's a fact. Proceeding one's thoughts with the phrase \"in my opinion\" could bring significant respect and credibility to 80% of the perspectives offered in this thread. Yet everyone seems to think they have a crystal ball.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2emvoi": [
        {
            "Parent ID": "t1_e2em7ei",
            "Comment ID": "e2emvoi",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 21:45:39",
            "Upvotes": 1,
            "Text": "You didn't really think that through did you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f3tnb": [
        {
            "Parent ID": "t1_e2em7ei",
            "Comment ID": "e2f3tnb",
            "Author": "TheZah1",
            "Date Created": "07-15-2018 04:49:55",
            "Upvotes": 1,
            "Text": "Institutional money is going in to blockchain tech. They're not going to log on Binance and buy BTC. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dpbeo": [
        {
            "Parent ID": "t1_e2dp10f",
            "Comment ID": "e2dpbeo",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 11:49:18",
            "Upvotes": 0,
            "Text": "Maybe because u/cryptogrip likes tulips and he is expecting you to send some to him. Mixed signals wrongly interpreted by him, maybe?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e5d5q": [
        {
            "Parent ID": "t1_e2dpzwx",
            "Comment ID": "e2e5d5q",
            "Author": "vroomDotClub",
            "Date Created": "07-14-2018 16:25:10",
            "Upvotes": 2,
            "Text": "Why because there investment horizon was 6 months? Who in the FK ever reccomended going into crypto investments with that short of a horizon or going it it for fiat gains. No people are greedy and selfish if they just want to jump on our backs for a quick fiat profit. They don't help bitcoin or develop anything or lift a finger to get it accepted as merchants. Frankly I'm glad those types lost money.     \n\n\nWant to invest in bitcoin then do it long term and not for fiat profit but to acquire and spend it in years to come on those that accept it and want to be part of this asset class.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqmr5": [
        {
            "Parent ID": "t1_e2dpzwx",
            "Comment ID": "e2dqmr5",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:11:01",
            "Upvotes": 3,
            "Text": "Ok but that's called a bad decision. You can't go from that to the absurd assumption that Bitcoin will go the way of Blockbuster (by the way that comparison is bizarre and the two entities share nothing).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2du51f": [
        {
            "Parent ID": "t1_e2dsov0",
            "Comment ID": "e2du51f",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 13:09:52",
            "Upvotes": 8,
            "Text": "There's a lot of bitterness from altcoiners.  They were hoping for returns of hundreds of percent in days.  But holding those coins never works.  BTC has stood up better than virtually all in this bear market (there is perhaps one exception - a non-shitcoin that I also invested in :)  I also invested 5% of my BTC portfolio in other promising shitcoins as an experiment - and frankly **none** of them have performed.  \n\nSo if you are a shitcoiner, and haven't even got a forum to go and moan on - well you come back to the mothership, and whinge here.  \n\nBTC is, once again, the focus of attention because it is by far the most important coin - and it isn't going anywhere.  Be patient :)\n\nedit: removed bold face.",
            "Edited?": "07-14-2018 13:21:02",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dp8zc": [
        {
            "Parent ID": "t1_e2dp02k",
            "Comment ID": "e2dp8zc",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:48:10",
            "Upvotes": 0,
            "Text": "Oooooooh .... u sensitive little newbie.\n\nJust because you don't have a clue doesn't mean you should throw a tantrum :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2druhw": [
        {
            "Parent ID": "t1_e2dphz2",
            "Comment ID": "e2druhw",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:31:25",
            "Upvotes": 2,
            "Text": "You're right about not knowing of the numbers are correct. There's also a lot more you don't know.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dq893": [
        {
            "Parent ID": "t1_e2dphz2",
            "Comment ID": "e2dq893",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:04:19",
            "Upvotes": 1,
            "Text": "You don't need to do inside trade when you own the exchange and the insurance of phoney coins used for trading.\n\nThis whole bunch of \"top BTC exchanges\" (ZB.COM, HitBTC, Huobi, Bitfinex, Binance) sort of reminds me of the good old porn spam sites which are all owned by just a few individuals. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eqk75": [
        {
            "Parent ID": "t1_e2epyvy",
            "Comment ID": "e2eqk75",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 22:57:55",
            "Upvotes": 1,
            "Text": "I know. I will try.  Hopium is the main thing that makes bitcoin fun. It’s why I joined this subreddit. \n\nI am really looking forward to the next bull run.  Then the fun and excitement will really begin anew. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eod5m": [
        {
            "Parent ID": "t1_e2eo315",
            "Comment ID": "e2eod5m",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:14:43",
            "Upvotes": 3,
            "Text": "Wow so serious. So you're insulting someone else now hey? Are you starting to realize it's not \"every other person\" that's wrong yet? \nChill out a little. Bitcoin is not going to topple everyone's pension or create a world of chaos and turmoil. I think you're slightly (or severely) misinterpreting the whole institutional investment concept.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eob1j": [
        {
            "Parent ID": "t1_e2eo315",
            "Comment ID": "e2eob1j",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 22:13:34",
            "Upvotes": 1,
            "Text": "Who’s we?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ew19k": [
        {
            "Parent ID": "t1_e2etsbl",
            "Comment ID": "e2ew19k",
            "Author": "[deleted]",
            "Date Created": "07-15-2018 00:54:40",
            "Upvotes": 2,
            "Text": "Heh.  It is someone with a lot of anger, and a good degree of cognitive dissonance.  Pretty smart too.  \n\nDefinitely more anti-BTC than crypto - which of course is dissonant.\n\nIMO this is a major BTC troll - and could well be an important sockpuppet.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ey40v": [
        {
            "Parent ID": "t1_e2etsbl",
            "Comment ID": "e2ey40v",
            "Author": "JW4974",
            "Date Created": "07-15-2018 01:46:49",
            "Upvotes": -2,
            "Text": "Oh please, enough with your conspiracies.\n\nI don't even know or give a shit on who that is.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f06ru": [
        {
            "Parent ID": "t1_e2eyndf",
            "Comment ID": "e2f06ru",
            "Author": "JW4974",
            "Date Created": "07-15-2018 02:47:13",
            "Upvotes": 1,
            "Text": "That's pretty strong.\n\nDude, you haven't noticed that I have been very cordial till you started this ETF/Pension shit?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ep454": [
        {
            "Parent ID": "t1_e2eolzb",
            "Comment ID": "e2ep454",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:29:32",
            "Upvotes": 1,
            "Text": "Whether BTC has a bright future is still on debate.  I think it has but at the moment, it's clogged with price manipulation.\n\nYou do not take the current crap and put it into mainstream.\n\nWhen BTC is well regulated and we all have faith and confidence on it's fair price, I will be one of the most vocal supporter for cash ETFs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ep8a1": [
        {
            "Parent ID": "t1_e2eolzb",
            "Comment ID": "e2ep8a1",
            "Author": "reakshow",
            "Date Created": "07-14-2018 22:31:45",
            "Upvotes": 1,
            "Text": "I think you may be exaggerating the percentage of people who still have a positive outlook on bitcoin. I must break this to you; you're the minority!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ei6rn": [
        {
            "Parent ID": "t1_e2ecan4",
            "Comment ID": "e2ei6rn",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:15:24",
            "Upvotes": 2,
            "Text": "Agree.  I think he's great entertainment value.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo5cu": [
        {
            "Parent ID": "t1_e2enfr0",
            "Comment ID": "e2eo5cu",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:10:25",
            "Upvotes": 0,
            "Text": "You have no clue what this is about so stfu.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2endln": [
        {
            "Parent ID": "t1_e2emvoi",
            "Comment ID": "e2endln",
            "Author": "JW4974",
            "Date Created": "07-14-2018 21:55:24",
            "Upvotes": -2,
            "Text": "It's a fact that concentration of ownership of BTC is far far higher than any other asset.  \n\nIf you don't know this, then you really are clueless.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eorkd": [
        {
            "Parent ID": "t1_e2emvoi",
            "Comment ID": "e2eorkd",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "07-14-2018 22:22:40",
            "Upvotes": -2,
            "Text": "Tell me where I'm wrong. Institutions exits to make money, they don't care about the mission statement of Bitcoin. How is buying into a Ponzi scheme established a decade ago going to make them money? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dpdvg": [
        {
            "Parent ID": "t1_e2dpbeo",
            "Comment ID": "e2dpdvg",
            "Author": "Stormjib",
            "Date Created": "07-14-2018 11:50:28",
            "Upvotes": 2,
            "Text": "What's better than roses on your piano?  ...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dq7ef": [
        {
            "Parent ID": "t1_e2dpbeo",
            "Comment ID": "e2dq7ef",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:03:56",
            "Upvotes": 1,
            "Text": "Yummy tulip soup.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dptqw": [
        {
            "Parent ID": "t1_e2dpbeo",
            "Comment ID": "e2dptqw",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:57:38",
            "Upvotes": -2,
            "Text": "Yeah, I sort of get it that he doesn't like to be told that he's wrong.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dr09n": [
        {
            "Parent ID": "t1_e2dqmr5",
            "Comment ID": "e2dr09n",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:17:16",
            "Upvotes": 1,
            "Text": "That's because you have a limited understanding of how the world works (no offence intended).\n\nThe point here is relevance vs dominance.  The lesson is that being dominant is no assurance of survival once you become irrelevant.  That's what happened to Blockbuster.\n\nSame here in crypto.  Just because BTC is dominant, it does not ensure that it will survive.  If BTC does not get adopted as a currency, it will become irrelevant.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dujbd": [
        {
            "Parent ID": "t1_e2du51f",
            "Comment ID": "e2dujbd",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 13:16:32",
            "Upvotes": 3,
            "Text": "Yes that's obvious but the pessimists on here will NEVER admit that Bitcoin is making progress. They simply judge all things by the coin price and dismiss the infrastructure growth. You can't fix stupid and you definitely can't fix stubborn!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqb7p": [
        {
            "Parent ID": "t1_e2dp8zc",
            "Comment ID": "e2dqb7p",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:05:43",
            "Upvotes": 4,
            "Text": "Sure thing...look you have been bashing bitcoin regularly. I have mo idea what your agenda is, or what you stand to gain. But you clearly don't really understand what you talk about so why bother. It just makes very little sense.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dr7b6": [
        {
            "Parent ID": "t1_e2dq893",
            "Comment ID": "e2dr7b6",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 12:20:32",
            "Upvotes": 1,
            "Text": "True... true...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ey143": [
        {
            "Parent ID": "t1_e2eqk75",
            "Comment ID": "e2ey143",
            "Author": "racebum",
            "Date Created": "07-15-2018 01:44:32",
            "Upvotes": 1,
            "Text": "Same here man and I know I like reading your posts. You have a good head on your shoulders and contribute well. I just think the space is getting kind of toxic. You have a lot of extreme negativity. Part of me wants to point out how common this is around Market bottoms but at the same time I just have been a lot less social in the crypto space until we find a bearing. I think a lot of people lost a lot of money and now they just want to see the world burn",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eolyp": [
        {
            "Parent ID": "t1_e2eod5m",
            "Comment ID": "e2eolyp",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:19:35",
            "Upvotes": 0,
            "Text": "Dude, unsecured mortgages were fine as only some home owners were impacted.\n\nBut when it was collateralised with other securities and sold as triple-A, the risk ballooned and caused the subprime crisis.\n\nThe important lesson here is do not underestimate the greed and creativity of Wall Street.  Like I said, they will pack shit into fancy boxes and sell them by the truckloads.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eodcv": [
        {
            "Parent ID": "t1_e2eob1j",
            "Comment ID": "e2eodcv",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:14:49",
            "Upvotes": 1,
            "Text": "Gamblers and speculators.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eysfc": [
        {
            "Parent ID": "t1_e2ew19k",
            "Comment ID": "e2eysfc",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 02:05:50",
            "Upvotes": 1,
            "Text": "He’s gotta be u/btc4trade   Look at the writing style. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f119h": [
        {
            "Parent ID": "t1_e2f06ru",
            "Comment ID": "e2f119h",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 03:13:51",
            "Upvotes": 2,
            "Text": "All I did was link to an article about it.   You are so sensitive. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eqptg": [
        {
            "Parent ID": "t1_e2ep8a1",
            "Comment ID": "e2eqptg",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 23:01:01",
            "Upvotes": 2,
            "Text": "I don't think most average people even heard of Bitcoin until last year. I do however think that many younger people will drive the adoption of Bitcoin as they transition into mainstream consumers and investors. My optimistic opinion is based on a fairly lengthy timeline for Bitcoin. I believe that realistically, within 5-10 years we could see serious growth in Bitcoin adoption as a currency choice and yes, I feel this will positively influence the price of the coin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ej01j": [
        {
            "Parent ID": "t1_e2ei6rn",
            "Comment ID": "e2ej01j",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 20:31:02",
            "Upvotes": 1,
            "Text": "He is. Personally I think he’s funny as hell and thoughtful.  Regardless of his grandiose crypto predictions, wouldn’t mind having a beer and waxing philosophical with that guy. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eop98": [
        {
            "Parent ID": "t1_e2eo5cu",
            "Comment ID": "e2eop98",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:21:23",
            "Upvotes": 2,
            "Text": "So dark.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2enncm": [
        {
            "Parent ID": "t1_e2endln",
            "Comment ID": "e2enncm",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:00:41",
            "Upvotes": 3,
            "Text": "And you need to work on your math. Think about what happens to sums represented by percentages of an expanding total.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqt59": [
        {
            "Parent ID": "t1_e2dpdvg",
            "Comment ID": "e2dqt59",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:14:02",
            "Upvotes": 2,
            "Text": "Rose on my piano. And her cousin Blossom sitting next to her.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2drqmn": [
        {
            "Parent ID": "t1_e2dptqw",
            "Comment ID": "e2drqmn",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:29:38",
            "Upvotes": 2,
            "Text": "Ha ha, you have a very limited and biased perspective, so what qualifies you you to tell me I'm wrong? You refuse to consider the opposite side of any argument you've made on here. That's just being stubborn and child like. It carries no weight.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ds6ha": [
        {
            "Parent ID": "t1_e2dr09n",
            "Comment ID": "e2ds6ha",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:37:05",
            "Upvotes": 2,
            "Text": "As I recall Blockbuster enjoyed many years of success before becoming irrelevant as a result of failure to adapt. The comparison is premature. Bitcoin is only getting off the ground.\nThe only way you'll come around is if and when Bitcoin becomes a mainstream currency, but even then you'll probably just deny that reality as you seen to deny many of the current realities of Bitcoin progress.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2drlof": [
        {
            "Parent ID": "t1_e2dr09n",
            "Comment ID": "e2drlof",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 12:27:15",
            "Upvotes": -1,
            "Text": "Exactly.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2duo99": [
        {
            "Parent ID": "t1_e2dujbd",
            "Comment ID": "e2duo99",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 13:18:49",
            "Upvotes": 4,
            "Text": "There is much uninformed comment.  \n\nI have my concerns - but taking a long view, you simply cannot uninvent a technology.\n\nComparisons with Tulips and video formats are, franky silly.  P.s. I've removed my boldface from above.  There's no need.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dqo6r": [
        {
            "Parent ID": "t1_e2dqb7p",
            "Comment ID": "e2dqo6r",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:11:41",
            "Upvotes": 1,
            "Text": "Dude, go read my post history.  \n\nI do have an opinion on why ETF is bad for BTC and just because you don't like it, doesn't mean I'm bashing BTC.\n\nAnd I do have an opinion that the heavy concentration of mining in China is a risk for BTC.  Again, if you don't like it, it doesn't mean I'm bashing BTC.\n\nGrow up.  Learn to be objective and stop thinking that any opinion that is not aligned to yours is \"bashing\".  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ep8ua": [
        {
            "Parent ID": "t1_e2eodcv",
            "Comment ID": "e2ep8ua",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 22:32:03",
            "Upvotes": 0,
            "Text": "Gold funds are selectable in many 401k plans right now. In the past gold has been pretty damn volatile as well. Yet it’s still there. \n\nBitcoin is gold 2.0.  Eventually it will be selectable in 401k/IRAs too.  It is up to the adults (not you of course) to decide what % of risk they are willing to take on in their portfolio. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f13nf": [
        {
            "Parent ID": "t1_e2f119h",
            "Comment ID": "e2f13nf",
            "Author": "JW4974",
            "Date Created": "07-15-2018 03:16:00",
            "Upvotes": 1,
            "Text": "Let's just say that you hit a raw nerve.\n\nI work in the IT industry and specialises in FSI.  My clients are mostly banks.  And if you have worked with these folks close and long enough, you will grow an intense dislike of their kind.  They are the scums of the world and the amount of greed is overbearing.  It's corrupted to the core at all levels and they sell out each other for money.\n\nSorry, nothing personal against you.",
            "Edited?": "07-15-2018 03:20:30",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ejmks": [
        {
            "Parent ID": "t1_e2ej01j",
            "Comment ID": "e2ejmks",
            "Author": "JW4974",
            "Date Created": "07-14-2018 20:42:55",
            "Upvotes": 1,
            "Text": "Yeap.  And he might actually share his weed with you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2epml6": [
        {
            "Parent ID": "t1_e2eop98",
            "Comment ID": "e2epml6",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:39:34",
            "Upvotes": 1,
            "Text": "When you have friends who are hard working and have families lose their homes while banks got bailed with tax payers' money and their CEOs take home obscene bonuses despite the mess they created .... \n\nYou will think like I do.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2env26": [
        {
            "Parent ID": "t1_e2enncm",
            "Comment ID": "e2env26",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:04:51",
            "Upvotes": 3,
            "Text": "For the record, your arrogance is barely tolerable. If you communicate this way in a professional environment then you must eradicate any possibility of collaboration. My line of work involves a great deal of collaboration, exchange and contribution of new ideas so it's difficult to imagine a world that tolerates your attitude.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dr97g": [
        {
            "Parent ID": "t1_e2dqt59",
            "Comment ID": "e2dr97g",
            "Author": "Stormjib",
            "Date Created": "07-14-2018 12:21:26",
            "Upvotes": 1,
            "Text": "Or Tulips on your organ.   ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dtipe": [
        {
            "Parent ID": "t1_e2drqmn",
            "Comment ID": "e2dtipe",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:59:30",
            "Upvotes": 1,
            "Text": "No shit.  Care to show an example where you might stand a chance of being right?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dtlcx": [
        {
            "Parent ID": "t1_e2ds6ha",
            "Comment ID": "e2dtlcx",
            "Author": "JW4974",
            "Date Created": "07-14-2018 13:00:43",
            "Upvotes": 1,
            "Text": "Progress?  Oh please show me a source that says that adoption has increased.  Or at least point me to a major merchant that accepts BTC as payment.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dranu": [
        {
            "Parent ID": "t1_e2dqo6r",
            "Comment ID": "e2dranu",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:22:07",
            "Upvotes": 4,
            "Text": "Please. You have never said a single positive thing about Bitcoin and you consistently turn every potentially positive turn of events into a conspiracy and gloom.\nIt's clear that you gather up what you farm from random news articles and try to put it into context on here but it shows. \nYou never heard of a protocol and then a comment later, you proceed to explain why it can't be effective?? Come on man, you know that reeks of bullshit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ephc3": [
        {
            "Parent ID": "t1_e2ep8ua",
            "Comment ID": "e2ephc3",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:36:40",
            "Upvotes": -1,
            "Text": "Bitcoin is not Gold, period.\n\nWhen it's accepted across the world by governments as a solid reserve currency, then yes, it's good as Gold.  \n\nAt this moment, \"Digital Gold\" is just marketing to bring in the suckers.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f159y": [
        {
            "Parent ID": "t1_e2f13nf",
            "Comment ID": "e2f159y",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 03:17:27",
            "Upvotes": 2,
            "Text": "Ok. Fine. Why don’t you just keep the same username. What are you hiding from?  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f2y59": [
        {
            "Parent ID": "t1_e2f13nf",
            "Comment ID": "e2f2y59",
            "Author": "The-Physicist",
            "Date Created": "07-15-2018 04:17:56",
            "Upvotes": 1,
            "Text": "So you should be rooting for bitcoin to succeed like me.  Let’s get rid of the banksters together instead of fighting with one another. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2esi0w": [
        {
            "Parent ID": "t1_e2epml6",
            "Comment ID": "e2esi0w",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 23:37:27",
            "Upvotes": 3,
            "Text": "That has little to do with Bitcoin. It has to do with life, choices, corruption and manipulation. Bitcoin was not created to be a bubble, or a scam, or a medium for manipulation. These things find their way into any potential entity that allows them to thrive. That does not mean Bitcoin will not survive in the need, once that crap is weeded out of the space.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eo6tu": [
        {
            "Parent ID": "t1_e2env26",
            "Comment ID": "e2eo6tu",
            "Author": "JW4974",
            "Date Created": "07-14-2018 22:11:13",
            "Upvotes": 0,
            "Text": "I deal with the real world.\n\nYou deal with what you want to hear.\n\nSo fuck off.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dscsd": [
        {
            "Parent ID": "t1_e2dr97g",
            "Comment ID": "e2dscsd",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 12:40:00",
            "Upvotes": 2,
            "Text": "Lol",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e0an1": [
        {
            "Parent ID": "t1_e2dtipe",
            "Comment ID": "e2e0an1",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 14:55:25",
            "Upvotes": 3,
            "Text": "It's futile because you've already made your mind up. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2duagb": [
        {
            "Parent ID": "t1_e2dtlcx",
            "Comment ID": "e2duagb",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 13:12:24",
            "Upvotes": 3,
            "Text": "Don't be so lazy and go learn on your own steem. You seem to be a pro at cherry picking info from all the FUD news and refurgitating it on here to create the facade of someone who knows what they are talking about. \nYou're either an eternal pessimist, been burned badly by the investment side of Bitcoin, or you have an agenda to spread FUD in the reddit community. I'm guessing one of the first two options.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2duq8o": [
        {
            "Parent ID": "t1_e2dtlcx",
            "Comment ID": "e2duq8o",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 13:19:44",
            "Upvotes": 1,
            "Text": "Why are you constantly so negative against Bitcoin?  You said you owned some the other day.....",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dtcs6": [
        {
            "Parent ID": "t1_e2dranu",
            "Comment ID": "e2dtcs6",
            "Author": "JW4974",
            "Date Created": "07-14-2018 12:56:44",
            "Upvotes": 1,
            "Text": "Conspiracy and gloom?  You referring to my view on ETF?  Yes - it's nothing but another tool for trading houses to earn commission and giving you more ropes to hang yourself.  And I will repeat this till you can convince me otherwise.\n\nBetterHash?  I admit I wasn't aware of the proposal but that doesn't change the fact that I'm right in that it will not address the decentralisation issue.  Along with dumb fuck idea about killing ASICs, which will outright kill the security of BTC.\n\nListen now kid - I deal with projects that span across a wide range of tech and I get retards with 'killer ideas' on my desk every day.  My job is to be objective and analytical and toss out looney ideas.  You, on the other hand, worship developers and \"gurus\", lick every bone they toss at you and treat it as gospel truths.  \n\nLearn to be objective and think with that pea brain of yours.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dwdvh": [
        {
            "Parent ID": "t1_e2dranu",
            "Comment ID": "e2dwdvh",
            "Author": "gotnoskillz",
            "Date Created": "07-14-2018 13:47:26",
            "Upvotes": 1,
            "Text": "It's FUD init",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eqxuf": [
        {
            "Parent ID": "t1_e2ephc3",
            "Comment ID": "e2eqxuf",
            "Author": "The-Physicist",
            "Date Created": "07-14-2018 23:05:31",
            "Upvotes": 2,
            "Text": "It is gold 2.0. You just don’t know it yet. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2f3ocr": [
        {
            "Parent ID": "t1_e2f2y59",
            "Comment ID": "e2f3ocr",
            "Author": "JW4974",
            "Date Created": "07-15-2018 04:44:22",
            "Upvotes": 1,
            "Text": "To do that, BTC first need to establish itself as an alternative to fiat.\n\nCan't you see?  The more trading platforms are promoted, whether exchanges, futures or ETFs, the less likely that BTC is used as a currency.  We are essentially shooting ourselves in the foot.\n\nI'm just waiting for the regulators to clamp down so that all these speculations and price manipulations can be managed down.  That's when true price discovery can start and reach investor grade price acceptance.  That will be the true start of adoption by the merchants.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eylo1": [
        {
            "Parent ID": "t1_e2esi0w",
            "Comment ID": "e2eylo1",
            "Author": "JW4974",
            "Date Created": "07-15-2018 02:00:26",
            "Upvotes": 1,
            "Text": "This, I agree.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2eoqs7": [
        {
            "Parent ID": "t1_e2eo6tu",
            "Comment ID": "e2eoqs7",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 22:22:16",
            "Upvotes": 3,
            "Text": "So bitter.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2duxxi": [
        {
            "Parent ID": "t1_e2duq8o",
            "Comment ID": "e2duxxi",
            "Author": "JW4974",
            "Date Created": "07-14-2018 13:23:17",
            "Upvotes": 1,
            "Text": "I'm negative against BTC being speculated, rampant price manipulation, centralisation of mining and the fixation on price rather than adoption and crazy notions about bringing down governments and banks.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dvktp": [
        {
            "Parent ID": "t1_e2dtcs6",
            "Comment ID": "e2dvktp",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 13:33:46",
            "Upvotes": 1,
            "Text": "Kid? Hmm. I already know I am both older and far more versed in this space than you ..well OK I'm fairly sure how about that?\nA book I've often recommended to my students is \"Sex Bombs and Burgers\". How about you consider reading that for some much needed perspective that I honestly believe will open up that mind of yours. Take off the blinders and consider how things evolve ...you'll appreciate it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dwia7": [
        {
            "Parent ID": "t1_e2dtcs6",
            "Comment ID": "e2dwia7",
            "Author": "gotnoskillz",
            "Date Created": "07-14-2018 13:49:29",
            "Upvotes": 1,
            "Text": "Lol",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dx5fb": [
        {
            "Parent ID": "t1_e2dtcs6",
            "Comment ID": "e2dx5fb",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 14:00:37",
            "Upvotes": 1,
            "Text": "By the way, no, I don't worship myself or anyone else in my community. \n\nI have a killer idea for making some quick money! I'd like to buy you for what you're worth, and the sell you for what you think you're worth. Oh my God, with that kind of margin, we could make soooo much profit here. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dvat8": [
        {
            "Parent ID": "t1_e2duxxi",
            "Comment ID": "e2dvat8",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 13:29:12",
            "Upvotes": 1,
            "Text": "What about it being a store of value like a Digital Gold or Gold Version 2?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dxlb7": [
        {
            "Parent ID": "t1_e2dx5fb",
            "Comment ID": "e2dxlb7",
            "Author": "JW4974",
            "Date Created": "07-14-2018 14:08:19",
            "Upvotes": 1,
            "Text": "Well, given that I have proven you wrong about just every point you made, you are bordering on being obnoxious.\n\nWhy don't you take a break, come back with a fresh mind, re-read the posts and then decide where you stand?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dwcl6": [
        {
            "Parent ID": "t1_e2dvat8",
            "Comment ID": "e2dwcl6",
            "Author": "JW4974",
            "Date Created": "07-14-2018 13:46:51",
            "Upvotes": 1,
            "Text": "BTC has always been a store of value from Day 1.  How else do you think I bought stuff with it?\n\nAs an alternative to Gold, it must first be accepted as an international currency, then carry enough weight to be a reserve currency.  Gold is valuable because of this reason - it is held as reserve by governments to finance imports in case it's own currency is rejected.  \n\nSo the claim that BTC is \"Digital Gold\" today is BS.  It needs first to be accepted as a currency then elevate to being accepted by governments as solid enough to be held in reserves.  This is when it becomes Digital Gold.\n\nNow you understand why the claim that BTC will replace fiat is retarded?  Acceptance by governments for international settlement is a pre-requisite to BTC becoming a Gold alternative.  And you can't achieve that by attempting to undermine the primary lever for fiscal governance, which is government control of fiat.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dz4r1": [
        {
            "Parent ID": "t1_e2dxlb7",
            "Comment ID": "e2dz4r1",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 14:35:06",
            "Upvotes": 2,
            "Text": "Yes, in your own mind you have proven me wrong with your out of context garbled arguments. That's the thing about living in your own version of reality. \n\nOne day however, you may very well be stuck with actual reality and the realization of your hypocrisy in the use of the word 'subjective'. It will not be a good day for you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dxvrg": [
        {
            "Parent ID": "t1_e2dwcl6",
            "Comment ID": "e2dxvrg",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 14:13:26",
            "Upvotes": 1,
            "Text": "In time we will see what happens. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dzqf6": [
        {
            "Parent ID": "t1_e2dxvrg",
            "Comment ID": "e2dzqf6",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 14:45:39",
            "Upvotes": 2,
            "Text": "\"Now you understand why the claim that BTC will replace fiat is retarded?\"\n\nCan you sense the condescending and patronizing tone in that statement? That's what this guy does in all comments. He truly believes he is correct!! Its astonishing.\nIf you want some really interesting perspectives from a few guys that actually have a 'real' credible perspective on the Bitcoin as gold concept, watch this debate. They both make great points and Erik swayed the audience from minority to majority believing that Bitcoin can function as gold. Again, these are credible experts, not some blow hard moron on reddit :)\nhttps://youtu.be/S47aJ6NPC4E",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2e1vtv": [
        {
            "Parent ID": "t1_e2dzqf6",
            "Comment ID": "e2e1vtv",
            "Author": "BitcoinAlways",
            "Date Created": "07-14-2018 15:23:31",
            "Upvotes": 1,
            "Text": "I've seen that debate already, thanks though :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}