{
    "e2b8yb5": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b8yb5",
            "Author": "45sbvad",
            "Date Created": "07-13-2018 07:42:27",
            "Upvotes": 17,
            "Text": "Many people see the rising global debt as an indication of a coming economic collapse. I agree that current levels of debt are unsustainable ; however I don't believe the economic \"meltdown\" will proceed as many believe it will. Most people when they think of economic collapse associate it with the collapse of markets; real-estate, stock markets, etc.\n\nBut when debt truly reaches unsustainable levels economic collapse doesn't manifest as falling markets. It will manifest as skyrocketing markets.\n\nWe are already paying a significant fraction of the US budget to just pay the interest on our current debt. 7.4% of our total budget is spent just on the interest on the US debt. Each year this % rises and at a certain point we will be faced with cutting other programs in order to just pay the interest on this debt. This is known as austerity.\n\nAusterity in Europe happens because no one country controls the currency. So when greece goes into debt; it can't just create more money to pay off that debt. It must cut programs or raise taxes to pay that debt.\n\nIn the US on the other hand; we control the worlds reserve currency. So as our debt increases; and our interest payments increase; we can print more money to pay off those interest payments.\n\nBut the USD is itself an instrument of Debt. So printing more money just increases the debt; increasing the interest payments ; increasing the need to print more money and go deeper in debt.\n\nThis pattern has repeated itself countless times throughout history.\n\nThe collapse will actually cause prices of everything to increase at increasing rates. Owners of assets and means of production will greatly benefit ; those on fixed salaries or income will lose.\n\nPeople think that Bitcoin is a bubble; but don't even consider that Fiat may be in an enormous bubble.\n\nFiat currencies have no intrinsic value; they have literally nothing backing it at all. Unless somehow you think violence is backing. There are some legal requirements that give it some value (because you must pay taxes in it); Its just special paper with some hightech inks; but beyond that the value of dollars are entirely psychological.\n\nBitcoin on the other hand is backed by energy; Bitcoin is Stored Work. Not only is it just random \"Stored Work\" ; but the work thats stored is the work of securing itself! In addition to being backed by energy and work; Bitcoin exists independent of any State. Countries can come and go; but Bitcoin is not dependent on any. Bitcoins incentive system makes it very likely that people will keep working for Bitcoin for decades if not hundreds or even thousands of years from now.\n\nThe world needs a global reserve currency ; and we need a currency that cannot be manipulated by corrupt individuals. That is why we have Bitcoin. Bitcoin cannot be changed; it cannot be bent to the whims of any politician. They can't inflate or deflate it. Bitcoin is money independent of politics. Bitcoin is the Jubilee the world has been waiting for.\n\n**War is Over**\n\n**If you Want it**",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c15ia": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c15ia",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 14:41:28",
            "Upvotes": 5,
            "Text": "Hmmm, this last small rise actually looks organic. Not the usual big price pumps that happen from a handful of wallets in 20 minutes.\nInteresting. I like it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2chpij": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2chpij",
            "Author": "blockchaincasino",
            "Date Created": "07-13-2018 18:41:01",
            "Upvotes": 4,
            "Text": "Right this moment, that graph ends in the form of a perfect fish hook.  Who's gonna bite?\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c4rx5": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c4rx5",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 15:29:50",
            "Upvotes": 6,
            "Text": "So, what happened to $20k by end of July?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cqeej": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cqeej",
            "Author": "The-Physicist",
            "Date Created": "07-13-2018 21:14:30",
            "Upvotes": 3,
            "Text": "Daily Hopium:\nS02E01\n\nHenceforth “Daily Hopium” will be rebranded as “Hopium Time”.  It will generally not be daily as too much Hopium, like too much ice cream 🍦, can be hazardous to both of our healths 🤒.\n\n\nToday we are exploring the notion of bitcoin regret. \n\n\nDon’t be like the two guys below.  This could be your moment to shine.  Bitcoin is on the low side of a major correction like it has done many times before.  All I know is, I’m still buying.  Are you? \n\n\n—-\n\n[deleted] - 111d\n\nLol that was my first thought. But i understand his pain, i was introduced to bitcoin in 2010. I thought it was a scam. Now I have some very rich friends -_-\n\n—-\n\nu/n0eticsyntax. - 111d\n\nI went to a hackerspace in SF back in 2011. Me and some of the guys went to the bar across the way and talked about bitcoin over a few beers. The party was separated into two camps: one who was holding BTC already and advocated for others to do the same, and the others who put their nose up at the idea. Sadly I was a part of the second group...\n\n—-\n\nhttps://www.reddit.com/r/Bitcoin/comments/86stie/found_a_text_exchange_from_2013_i_had_i_wanna_cry/\n\n\n\nIn a few years, you don’t wanna be visiting the site below and wish you bought some bitcoin while it was cheap.  But instead you were a coward and never bought, or panic sold it all.  \n\n\nhttps://bitcoinregret.club\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bn71z": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bn71z",
            "Author": "OHSHACKHENNESSY",
            "Date Created": "07-13-2018 11:39:51",
            "Upvotes": 5,
            "Text": "Can someone explain to me the difference between GBTC (the Bitcoin investment trust) and a Bitcoin ETF? Everyone seems pumped about a Bitcoin ETF because it will open easy investment to the public but I thought that we already had that with GBTC. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqwlu": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bqwlu",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 12:28:59",
            "Upvotes": 7,
            "Text": "Rosenstein indicted another 12 Russians for interference in US elections.  How did they finance and money launder their operations?\n\nCrypto.  ",
            "Edited?": "07-13-2018 12:37:41",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b5jc0": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b5jc0",
            "Author": "dancingvulture",
            "Date Created": "07-13-2018 06:02:35",
            "Upvotes": 5,
            "Text": "Friday the 13th...BOO!!!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c4tod": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c4tod",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 15:30:31",
            "Upvotes": 6,
            "Text": "The overall morale in the space is almost at zero. That may be a good sign for the price, maybe.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b5wfw": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b5wfw",
            "Author": "skaska23",
            "Date Created": "07-13-2018 06:14:41",
            "Upvotes": 2,
            "Text": "Good tutorial how to program pro.coinbase api for automatic buys?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2chmrg": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2chmrg",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "07-13-2018 18:39:45",
            "Upvotes": 6,
            "Text": "Time for a dump. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bhz2u": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bhz2u",
            "Author": "goldMy",
            "Date Created": "07-13-2018 10:26:21",
            "Upvotes": 5,
            "Text": "important privacy: \n\n@bitcoincom tweeted today, that the bitcoin.com wallet users generated the 2,5mio wallet, the questions is where do they get the number from without sending userdata back to the bitcoincom servers: \n\nhttps://reddit.app.link/uhoiXMikwO",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c0bm6": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c0bm6",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 14:30:43",
            "Upvotes": 4,
            "Text": "Lookin good people, we just gotta get above these clouds then its on to 7000.  Hodl on to your butts.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmtky": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cmtky",
            "Author": "biba8163",
            "Date Created": "07-13-2018 20:08:58",
            "Upvotes": 4,
            "Text": "CNB's Brian Kelly says BCASH @ :15\n\nhttps://twitter.com/CNBCFastMoney/status/1017884653578018817\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bb0ia": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bb0ia",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 08:28:44",
            "Upvotes": 3,
            "Text": "**Bitcoin Again Shows Green Shoots After $6K Defense**\n\nhttps://www.coindesk.com/bitcoin-again-shows-green-shoots-after-6k-defense/\n\nBitcoin's (BTC) sharp recovery from two-week lows has raised the odds of a stronger rally towards $6,400, technical studies indicate.\n\nAs of writing, the leading cryptocurrency is changing hands at $6,245 on Bitfinex.\n\nBTC was expected to drop below $6,000 in the last 24 hours as the bears were on the offensive following an inverted flag breakdown.\n\nHowever, the intraday oversold conditions likely put a floor under bitcoin prices at the two-week low of $6,080, helping it chart a solid rebound to $6,283 (today's high).\n\nWhile it is too early to call a bullish reversal, the change of fortune has saved the day for the BTC bulls. Moreover, the probability of BTC's price charting a picture-perfect inverse head-and-shoulders bullish reversal pattern would have dropped sharply had BTC found acceptance below $6,000.\n\nFurther, the sharp recovery from $6,080 to $6,283 has opened the doors to re-test of $6,400, the price chart analysis indicates.\n\nView\n\nBTC could attack the $6,400 mark, but further gains are ruled out for now as the descending (bearish) 5-day MA and 10-day MA are located at $6,366 and $6,500, respectively.\n\nThat said, if BTC manages to close (as per UTC) today above 10-day MA, then the doors would open for a re-test of the Monday's high of $6,820.\n\nBearish scenario: A failure to produce a significant move higher despite the bullish price RSI divergence and the falling wedge breakout would shift risk in favor of a drop to a recent low of $5,755. The downside move will likely gather pace if BTC fails to hold above $6,080 (previous day's high) over the weekend.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b4jtv": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b4jtv",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 05:29:01",
            "Upvotes": 3,
            "Text": "We will no longer let them hold us down.  Stand here and stand strong.  We will hodl through the storm, and hodl for the people once and for all!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqtce": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bqtce",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 12:27:49",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2br5yo": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2br5yo",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:32:18",
            "Upvotes": 1,
            "Text": "Why will the downward trend continue?\n\nThis will be bear market for quite some time, this is because bull market indicates outsiders coming in. the huge wave of outsiders coming in is done. It is near impossible to bring outsiders into crypto space at the moment. Mainly because of the nature of asic and bitmain. Btc is pretty much controlled by bitmain at the moment so who in their right mind would invest their hard earned money into btc which directly and indirectly go to bitmain. Any substantial value increase will cause bitmain to dump and will create a downward trend again.\n\nAside from that, scams are out of fucking control. So even if outsiders ignore asic and bitmain(HUGE PROBLEM THAT DEFEATS PURPOSE OF CRYPTO), they will get burned by inevitable scams and they wont invest anymore money.\n\nAlso, try explaining bitcoin cash or ICOs to the average Joe without sounding like a complete retard for having money tied up in crypto. If anything, the hardcore fan boys that dont fully grasp abstract concepts are destroying this industry",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c1wbq": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c1wbq",
            "Author": "scamMeOnceShameOneMe",
            "Date Created": "07-13-2018 14:51:12",
            "Upvotes": 1,
            "Text": "Care to comment on my scary scam e-mail\n\nhttps://imgur.com/UzXRCDQ\n\nInitially it didn't go to the spam folder.\n\nThe scammer doesn't know me that well so I can sleep fine. I was mostly afraid of who he wanted to send the \"movie\" to and claim it was me... but the scammer didn't write so much.. I guess that replying would only put me on his 'always scam list'.\n\nAnyways this is a generic scam e-mail, but as astrology it might fit perfectly most of the time.\n ",
            "Edited?": "07-13-2018 15:32:31",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b490w": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b490w",
            "Author": "thehihoguy",
            "Date Created": "07-13-2018 05:18:45",
            "Upvotes": -2,
            "Text": "I think the data combined with the comments on here tell us one concrete fact -- no one on here has any fucking clue what BTC is doing, or why.",
            "Edited?": "07-13-2018 08:29:48",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b8w2z": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2b8w2z",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 07:40:57",
            "Upvotes": 1,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cj7z3": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cj7z3",
            "Author": "noad1001",
            "Date Created": "07-13-2018 19:06:09",
            "Upvotes": 1,
            "Text": "Cnbc made my day when they talking about coins Coinbase might add. He was like they had a problem when they added bcash",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ckxqi": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2ckxqi",
            "Author": "lemon4lemon",
            "Date Created": "07-13-2018 19:35:44",
            "Upvotes": -4,
            "Text": "This year has been 12K will hold, then 11K, then 10K then 9K, then 8k, then 7k, now 6K\n\nAnyone see a trend here, the scam is unfolding really fast. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bf7uk": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bf7uk",
            "Author": "IOExceptionGrrr",
            "Date Created": "07-13-2018 09:44:19",
            "Upvotes": 2,
            "Text": "Hi, I am a bot! Wow, such future, everyone clueless, beep boooooooop!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c79oq": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2c79oq",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 16:04:31",
            "Upvotes": 0,
            "Text": "On Bitfinex they're dumping hundreds of Bitcoins at once",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cvv9h": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cvv9h",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:57:17",
            "Upvotes": -9,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bp0w1": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2bp0w1",
            "Author": "Cryptovampire",
            "Date Created": "07-13-2018 12:04:08",
            "Upvotes": 0,
            "Text": "Network clogged? Waiting 2 hours for transaction of  0.00007999999999999999 BTC per kB ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d4pn2": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2d4pn2",
            "Author": "ck310",
            "Date Created": "07-14-2018 02:22:36",
            "Upvotes": -8,
            "Text": "Anyone who buys bitcoin but doesn’t own stocks or manage their own stocks is destined to lose all their money. You are “get rich quick” players driven by hype and momentum. My mother in law wanted to buy BTC in December. Instead, I helped her short bitcoin in the futures market around $16,500. It’s a trading vehicle. Nothing more. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cxn97": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cxn97",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 23:32:49",
            "Upvotes": -1,
            "Text": "Cause they still don’t understand you can buy half or even a tenth of a Bitcoin. They see the high price of 1 and get scared off. Time to move the decimal point over. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cwvu0": [
        {
            "Parent ID": "t3_8yie5r",
            "Comment ID": "e2cwvu0",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 23:17:26",
            "Upvotes": -6,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bgi6a": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2bgi6a",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 10:04:28",
            "Upvotes": 4,
            "Text": "Exactly who wants a currency subject to widespread manipulation and high volatility?",
            "Edited?": "07-13-2018 10:20:26",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bnpsl": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2bnpsl",
            "Author": "alfon_",
            "Date Created": "07-13-2018 11:46:47",
            "Upvotes": 1,
            "Text": "That's exactly why I'm accumulating Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqfwb": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2bqfwb",
            "Author": "GreenStretch",
            "Date Created": "07-13-2018 12:23:02",
            "Upvotes": 1,
            "Text": "\"\\[V\\]iolence \\_is\\_ backing.\"  Just the name Austrian economics gives the game away.  Even if the economic principles are 100&#37; correct, economically (and otherwise) irrational states like Nazi Germany and the Soviet Union can have a greater influence.  And while it may be possible for states based on sound money to have defeated them, in our actual history it was Keynesian states that did. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqpsx": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2bqpsx",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:26:32",
            "Upvotes": 1,
            "Text": "Ummm bitcoin pump and dump is manipulated like CRAZY by whales and people.\nWhat you are saying isn't correct atm.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2chwov": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2chwov",
            "Author": "tedjonesweb",
            "Date Created": "07-13-2018 18:44:17",
            "Upvotes": 1,
            "Text": "> We are already paying a significant fraction of the US budget to just pay the interest on our current debt. 7.4% of our total budget is spent just on the interest on the US debt. Each year this % rises\n\nThis means that bank's profits raise. They get real $ and use them to pay salaries and dividends to the bankers.\n\nThis is essentially a \"tax on taxes\" - banks receive taxes from the government.\n\n> and at a certain point we will be faced with cutting other programs in order to just pay the interest on this debt.\n\nAnother option - to print more money (more debt).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ba4xx": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2ba4xx",
            "Author": "fallenkeith1990",
            "Date Created": "07-13-2018 08:10:03",
            "Upvotes": -1,
            "Text": "^ exactly",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bo9tz": [
        {
            "Parent ID": "t1_e2b8yb5",
            "Comment ID": "e2bo9tz",
            "Author": "Stayathomepyrat",
            "Date Created": "07-13-2018 11:54:10",
            "Upvotes": -1,
            "Text": "no, only a handfull of idiots see that.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c2if4": [
        {
            "Parent ID": "t1_e2c15ia",
            "Comment ID": "e2c2if4",
            "Author": "rinsan",
            "Date Created": "07-13-2018 14:59:15",
            "Upvotes": 11,
            "Text": "annnnnnnd, it's all gone.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cekaf": [
        {
            "Parent ID": "t1_e2c15ia",
            "Comment ID": "e2cekaf",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:50:48",
            "Upvotes": 5,
            "Text": ">  this last small rise actually looks organic\n\nsmall rise?\n\nbtc is down about $400 just this week\n\nthats not a rise, bitcoin has been crashing (almost continuously) the last 6 months\n\nand its STILL crashing hard\n\nthere are slight little upticks (or dead cat bounces) but there is no \"rise\"\n\nBTC is just going down, more and more, with no end in site\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cihr1": [
        {
            "Parent ID": "t1_e2chpij",
            "Comment ID": "e2cihr1",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 18:54:01",
            "Upvotes": 1,
            "Text": "The bulls :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cw18b": [
        {
            "Parent ID": "t1_e2chpij",
            "Comment ID": "e2cw18b",
            "Author": "nonesecure",
            "Date Created": "07-13-2018 23:00:32",
            "Upvotes": 1,
            "Text": "Sound yummy ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c54pp": [
        {
            "Parent ID": "t1_e2c4rx5",
            "Comment ID": "e2c54pp",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 15:34:47",
            "Upvotes": 3,
            "Text": "Same as the $20k predictions by the end of April, May and June.",
            "Edited?": "07-13-2018 15:40:29",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c58mg": [
        {
            "Parent ID": "t1_e2c4rx5",
            "Comment ID": "e2c58mg",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:36:18",
            "Upvotes": 4,
            "Text": "McAfee said $15k by the end of July which is obviously not going to happen now.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c55vz": [
        {
            "Parent ID": "t1_e2c4rx5",
            "Comment ID": "e2c55vz",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:35:14",
            "Upvotes": 3,
            "Text": "If you're naive enough to believe the extreme in either direction of price movement then you're obviously new to this space. While Bitcoin, in terms of the crypto market side of things, has made many radical price moves, nobody has ever accurately predicted them.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cqmup": [
        {
            "Parent ID": "t1_e2cqeej",
            "Comment ID": "e2cqmup",
            "Author": "fallenkeith1990",
            "Date Created": "07-13-2018 21:18:54",
            "Upvotes": 2,
            "Text": "be careful since that hopium is addicting, you're going to create a lot of new hopium addicts :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bo87f": [
        {
            "Parent ID": "t1_e2bn71z",
            "Comment ID": "e2bo87f",
            "Author": "arBettor",
            "Date Created": "07-13-2018 11:53:36",
            "Upvotes": 9,
            "Text": "GBTC trades at a premium to its underlying bitcoin holdings because shares of it aren't created/redeemed on a regular basis.  An ETF would allow APs (authorized participants) to create and redeem shares of the ETF so that it would trade much closer to the value of its underlying holdings.\n\nThus, an ETF would mostly eliminate the risk of expansion/contraction of the price premium and provide exposure just to the BTC price.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2boiwz": [
        {
            "Parent ID": "t1_e2bn71z",
            "Comment ID": "e2boiwz",
            "Author": "GreenStretch",
            "Date Created": "07-13-2018 11:57:28",
            "Upvotes": 7,
            "Text": "GBTC trades at a premium, or theoretically could trade at a discount to the real market price of bitcoin.  This entry says it was on average a 62.98&#37; premium over the last 52 weeks.  A more normal etf would presumably have a net asset value at (or close to) the market price and would buy and sell bitcoin as investors deposit or withdraw money. [https://www.bloomberg.com/quote/GBTC:US](https://www.bloomberg.com/quote/GBTC:US)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bpptf": [
        {
            "Parent ID": "t1_e2bn71z",
            "Comment ID": "e2bpptf",
            "Author": "CoinedPrince",
            "Date Created": "07-13-2018 12:13:26",
            "Upvotes": 2,
            "Text": "Questions like these are good for Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c0een": [
        {
            "Parent ID": "t1_e2bqwlu",
            "Comment ID": "e2c0een",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 14:31:42",
            "Upvotes": 3,
            "Text": "They have used it partially, but so what. They've been using cash for years. Cash is far more anonymous than crytpo. Every crypto transaction is recorded on the blockchain, and less than 1% of all transaction are linked to any illegal activity.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cg811": [
        {
            "Parent ID": "t1_e2bqwlu",
            "Comment ID": "e2cg811",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 18:16:51",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": "07-09-2020 23:05:40",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2brd8y": [
        {
            "Parent ID": "t1_e2bqwlu",
            "Comment ID": "e2brd8y",
            "Author": "007meow",
            "Date Created": "07-13-2018 12:34:54",
            "Upvotes": -6,
            "Text": "I wouldn’t be surprised if crypto *tanked* now. \n\nThis is an inherent vulnerability of crypto, and why I feel that we’ll never see it truly take off - too high of a potential for the anonymity to be abused by criminals. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c58xq": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2c58xq",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:36:25",
            "Upvotes": 5,
            "Text": "Yep, you are not wrong, I would say morale is very low at the moment.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5bcs": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2c5bcs",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:37:22",
            "Upvotes": 8,
            "Text": "The morale has been gone and resurrected many many times in the past several years. It's business as usual for anyone that's been on this train for a while.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7lfp": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2c7lfp",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 16:09:09",
            "Upvotes": 3,
            "Text": " You mean guys who wear hats backwards are crying into their trust funds because they bought 6 months ago when the one guy in their frat who is totally working on his MBA like for real told them to buy?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7m8h": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2c7m8h",
            "Author": "LemosineRidin",
            "Date Created": "07-13-2018 16:09:27",
            "Upvotes": 3,
            "Text": "I’m happy as fuck ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ce9mq": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2ce9mq",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:46:17",
            "Upvotes": 4,
            "Text": "> The overall morale in the space is almost at zero.\n\nyeah, bitcoin is down 70% from where it was just a few months ago\n\nand its still crashing HARD\n\nLosing hundreds in value daily\n\nso yeah... what a mystery, I can't imagine why morale would be so low?\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c51yx": [
        {
            "Parent ID": "t1_e2c4tod",
            "Comment ID": "e2c51yx",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 15:33:43",
            "Upvotes": 0,
            "Text": "Umkay",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ckyqd": [
        {
            "Parent ID": "t1_e2chmrg",
            "Comment ID": "e2ckyqd",
            "Author": "lemon4lemon",
            "Date Created": "07-13-2018 19:36:13",
            "Upvotes": -2,
            "Text": "yep, this can easily go to 1K or less",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bmdho": [
        {
            "Parent ID": "t1_e2bhz2u",
            "Comment ID": "e2bmdho",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 11:28:44",
            "Upvotes": 1,
            "Text": "Roger Ver's Bcash scam site.  Nothing would surprise me.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cf4hj": [
        {
            "Parent ID": "t1_e2c0bm6",
            "Comment ID": "e2cf4hj",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:59:30",
            "Upvotes": 2,
            "Text": "lol\n\nsure\n\nwhatever you say\n\nyou are aware that bitcoin is deep into a hard crash, with no evidence of an end in sight?\n\nbut hey... if acting as if everything is ok helps you, but all means, don't let me interrupt your play-pretend ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cwkld": [
        {
            "Parent ID": "t1_e2cmtky",
            "Comment ID": "e2cwkld",
            "Author": "dreampsi",
            "Date Created": "07-13-2018 23:11:12",
            "Upvotes": 1,
            "Text": "...\"they have a live server and a live roadmap\" \n\ngood to know the roadmap is now \"live\" ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8y08": [
        {
            "Parent ID": "t1_e2cmtky",
            "Comment ID": "e2d8y08",
            "Author": "DankReynolds",
            "Date Created": "07-14-2018 04:43:29",
            "Upvotes": 1,
            "Text": " I thought they called a bitcoin funeral and weren’t covering it anymore? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bh38q": [
        {
            "Parent ID": "t1_e2bb0ia",
            "Comment ID": "e2bh38q",
            "Author": "JohnnyLingoMusic",
            "Date Created": "07-13-2018 10:13:14",
            "Upvotes": 3,
            "Text": "makes sense to me.  The monthly is in a pretty tight range and I imagine the more days the price stays above 6k or even 5800 the better the chances that the bottom is in and all the pompous entitled finance guys who think they are so smart cause they are going to load up once it goes back to 5k or lower will have to buy in at these prices.  Would like nothing more than for people like ElErian and others to totally miss out",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bge2a": [
        {
            "Parent ID": "t1_e2bb0ia",
            "Comment ID": "e2bge2a",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 10:02:40",
            "Upvotes": 4,
            "Text": "Rally towards 6400, LOL. My how expectations have fallen\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2brbha": [
        {
            "Parent ID": "t1_e2bb0ia",
            "Comment ID": "e2brbha",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:34:16",
            "Upvotes": 1,
            "Text": "Too bad TA used to predict shares of a publically owned company doesnt apply to crypto.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bfmon": [
        {
            "Parent ID": "t1_e2bb0ia",
            "Comment ID": "e2bfmon",
            "Author": "sat0shinakamot0",
            "Date Created": "07-13-2018 09:50:50",
            "Upvotes": 1,
            "Text": "this bear is really bad,,  i want to hunt all the bear in this world so no more bear,\n\nwhy always attacking the bull, the bull is doing nothing",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bgkhy": [
        {
            "Parent ID": "t1_e2b4jtv",
            "Comment ID": "e2bgkhy",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 10:05:26",
            "Upvotes": 2,
            "Text": "Problem is, most of the folks who had money are now soldrs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqz2z": [
        {
            "Parent ID": "t1_e2b4jtv",
            "Comment ID": "e2bqz2z",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:29:51",
            "Upvotes": 1,
            "Text": "Holding isn't good. you want liquidity.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bsvzg": [
        {
            "Parent ID": "t1_e2bqtce",
            "Comment ID": "e2bsvzg",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 12:54:33",
            "Upvotes": 1,
            "Text": "On what coin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2btbtu": [
        {
            "Parent ID": "t1_e2bqtce",
            "Comment ID": "e2btbtu",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 13:00:11",
            "Upvotes": 1,
            "Text": "Back in 2014 ghash.io obtained 51% mining power and was constantly attempting double spends.  They were ddosed non stop which brought their hashing power to 38%. On record it has never been successful\n\nhttps://en.m.wikipedia.org/wiki/Ghash.io\n\nBitmain is close to 51% but chances are they wont attempt double spend. They spread their hashing power across 3 pools (maybe more).\nStill isn't going to stop them from turning people off crypto as it becomes centralized and monopolized which defeats the point of crypto. At the moment they are their own, and cryptos, worst enemy.\n\nOff topic but good to know:\nNeo is centralized because their nodes are private. Ripple is centralized too. the three worst cryptos at the moment (out of top 20) are BTC, Neo and ripple (not including bcash because it is really infuriating to people who understand crypto that it exists and has the market cap it does. better to just ignore it as it will inevitably be worth nothing in the future). This is due to the community not fully grasping the original (and only benefit over fiat) purpose of crypto\n\nThe best crypto in terms of not becoming centralized (51% attacks) and as far as anonymity goes is Monero.   The reason why monero is polarizing and doesn't get the praise it deserves is because they are anti asic(monopolization and centralization). Bitmain scammed people by selling asic miners (at a  really reduced price) for cryptonight algo knowing monero was in the process of altering the algo to brick the asic.  So people that are sheep and bird brain got burned HARD. \n\nhttps://www.ccn.com/monero-declares-war-asic-manufacturers/\n\n\nPeople in crypto that understand the purpose prefer Monero over Ethereum and Ethereum over BTC.  All other cryptos are virtually the same as BTC, Ethereum and monero because they use their algos with very little or nothing changed (hence why people call them scams). the majority of alt coins are ethereum based algo because its platform and algo are the easiest for newbs to make shitcoins on (tron is one of these coins). you can blame ethereum for all these ico airdrop scams. Why? \nhttps://en.m.wikipedia.org/wiki/ERC20",
            "Edited?": "07-13-2018 13:44:26",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bo7e8": [
        {
            "Parent ID": "t1_e2b490w",
            "Comment ID": "e2bo7e8",
            "Author": "SonOfZaknafein",
            "Date Created": "07-13-2018 11:53:16",
            "Upvotes": 3,
            "Text": "It's true. That's why I take this shit with a grain of salt. I still wish for a rocket to the moon, but I'm certain that\n\n at this moment, I'm basically gambling.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2b56ry": [
        {
            "Parent ID": "t1_e2b490w",
            "Comment ID": "e2b56ry",
            "Author": "MikeLittorice",
            "Date Created": "07-13-2018 05:50:53",
            "Upvotes": 1,
            "Text": "Turd ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmjtc": [
        {
            "Parent ID": "t1_e2ckxqi",
            "Comment ID": "e2cmjtc",
            "Author": "oceaniax",
            "Date Created": "07-13-2018 20:04:03",
            "Upvotes": 2,
            "Text": "Clever, man. Have not heard this before.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cnkeg": [
        {
            "Parent ID": "t1_e2ckxqi",
            "Comment ID": "e2cnkeg",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 20:22:23",
            "Upvotes": 5,
            "Text": "Ah, but each backwards step increases the possible future upside, LOL.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmvyq": [
        {
            "Parent ID": "t1_e2ckxqi",
            "Comment ID": "e2cmvyq",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 20:10:12",
            "Upvotes": 3,
            "Text": "Just because this is your first year, don't assume that there none of us that don't know the difference. The huge run up in December created massive gains for a lot of people who are profit taking. This can happen many times until Bitcoin becomes more than just a coin to trade in the market. Recent infrastructure has been underway on a bigger scale these last few years. It won't be much longer before Bitcoin becomes much more useful than it currently is, and this pump and dump scenarios will fade into the past.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c81j7": [
        {
            "Parent ID": "t1_e2c79oq",
            "Comment ID": "e2c81j7",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 16:15:24",
            "Upvotes": 5,
            "Text": "That also means someone is buying hundreds at once. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cl08p": [
        {
            "Parent ID": "t1_e2c79oq",
            "Comment ID": "e2cl08p",
            "Author": "lemon4lemon",
            "Date Created": "07-13-2018 19:36:56",
            "Upvotes": -2,
            "Text": "Scam alert, those buying up are the next bait in the downwards price dive",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d2598": [
        {
            "Parent ID": "t1_e2cvv9h",
            "Comment ID": "e2d2598",
            "Author": "CoinedPrince",
            "Date Created": "07-14-2018 01:13:28",
            "Upvotes": 7,
            "Text": "You are an idiot.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d9bgs": [
        {
            "Parent ID": "t1_e2cvv9h",
            "Comment ID": "e2d9bgs",
            "Author": "gotnoskillz",
            "Date Created": "07-14-2018 04:57:34",
            "Upvotes": 1,
            "Text": "You wouldn't be saying that if you were in the green. Hypocrisy at its finest.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d582w": [
        {
            "Parent ID": "t1_e2d4pn2",
            "Comment ID": "e2d582w",
            "Author": "q-1",
            "Date Created": "07-14-2018 02:37:26",
            "Upvotes": 3,
            "Text": "so why are you here, then?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d86yp": [
        {
            "Parent ID": "t1_e2cwvu0",
            "Comment ID": "e2d86yp",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 04:15:43",
            "Upvotes": 1,
            "Text": "Heh.  I reckon my 4 year old gaming laptop could make me, hey, maybe 0.1 cent per month gross.  And that's before I pay for the extra electricity.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2booxu": [
        {
            "Parent ID": "t1_e2bgi6a",
            "Comment ID": "e2booxu",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 11:59:42",
            "Upvotes": 5,
            "Text": "The symptoms you are refering to is a product of low volume and should theoretically go away as volume increases over time and more BTC is accumulated by institutions who are less likely to sell",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqvq7": [
        {
            "Parent ID": "t1_e2bgi6a",
            "Comment ID": "e2bqvq7",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:28:41",
            "Upvotes": 1,
            "Text": "Yeah. Owning a lot of btc is way more uncomfortable than using the fiat to buy land......",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bmbdh": [
        {
            "Parent ID": "t1_e2bgi6a",
            "Comment ID": "e2bmbdh",
            "Author": "JW4974",
            "Date Created": "07-13-2018 11:27:56",
            "Upvotes": -1,
            "Text": "Come on, give the guy some credit ... he actually took the time to write two pages.  Although most of it are cut and paste.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2co0e7": [
        {
            "Parent ID": "t1_e2chwov",
            "Comment ID": "e2co0e7",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:30:26",
            "Upvotes": 1,
            "Text": "Isn't this exactly what Tether is doing?\n\nPrinting Tethers from the air to prop up the price of BTC.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c3ukd": [
        {
            "Parent ID": "t1_e2c2if4",
            "Comment ID": "e2c3ukd",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 15:17:11",
            "Upvotes": 3,
            "Text": "He jinxed it! lol\n\nNah, JK... there's nothing organic in this market... people should have known that by now...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cm0ny": [
        {
            "Parent ID": "t1_e2cihr1",
            "Comment ID": "e2cm0ny",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 19:54:41",
            "Upvotes": 1,
            "Text": "There's no bull anymore in Bitcoin",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2clr8b": [
        {
            "Parent ID": "t1_e2c55vz",
            "Comment ID": "e2clr8b",
            "Author": "TragicKid",
            "Date Created": "07-13-2018 19:50:06",
            "Upvotes": 3,
            "Text": "I predicted that I'll never get a lambo and so far I'm right. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cqubv": [
        {
            "Parent ID": "t1_e2cqmup",
            "Comment ID": "e2cqubv",
            "Author": "The-Physicist",
            "Date Created": "07-13-2018 21:22:48",
            "Upvotes": 1,
            "Text": "I know, I just got out of rehab myself 😆\n\nThat’s why It’s not daily anymore ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2boelz": [
        {
            "Parent ID": "t1_e2bo87f",
            "Comment ID": "e2boelz",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 11:55:54",
            "Upvotes": 6,
            "Text": "^ what he said. Finally a solid answer. You'd be amazed at the freak show answers I've seen for this question. Thanks for keeping it straight and Not just jumping on the ETF FUD train :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c659d": [
        {
            "Parent ID": "t1_e2c0een",
            "Comment ID": "e2c659d",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 15:48:53",
            "Upvotes": 1,
            "Text": "Not all crypto uses blockchain - but regardless, sophisticated users of crypto can easily anonymize their transactions and move vast sums through TOR.  with Bitcoin you can skip intermediaries and all those pesky \"know your customer\" laws and headaches of having to be legitimate when using the banking system.  \n\nUsing cash is hard (for illegitimate transactions), and gets harder all the time.  Gone are the days of anonymous Swiss numbered bank accounts.  Moving physical cash is logistically challenging.  \n\nIn fact, the only real way to monitor bitcoin is when it interacts with the banking system.  Otherwise huge sums of money can be moved anonymously without any interference.  ",
            "Edited?": "07-13-2018 16:06:44",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cgv8i": [
        {
            "Parent ID": "t1_e2cg811",
            "Comment ID": "e2cgv8i",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 18:27:22",
            "Upvotes": 5,
            "Text": "\"no Americans were involved\"\n\nI said 12 Russians. . .so, yeah? \n\n\"all took place under obama\"\n\nin support of Trump \n\n\"Good news for Trump (which, generally speaking, is good news for America)\"\n\nThat's an interesting read. . .\n\n\"This is nothing to do with whether or not someone on here likes Trump, or not (thats anybody's free choice to like the guy or not)\"\n\nI get the feeling you like him!\n\n\"I'm just saying, Trump (once again) being shown to have nothing to do with so-called \"russian collusion\" is good news, and stabilizing\"\n\nUh, no. . .it doesn't show that at all.  It shows 12 additional Russians muddled in our election (with connection to an unnamed Trump campaign associate).  It says nothing dispositive about Trump.\n\n\"That it all took place under obama's watch,\"\n\nYou already said that. \n\n\"but this news showing Trump to not be involved is good for the crypto assets markets in general\". \n\nIt doesn't show Trumps involvement or lack there of at all - this is directed at 12 Russian agents.  \n\n\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bvo9w": [
        {
            "Parent ID": "t1_e2brd8y",
            "Comment ID": "e2bvo9w",
            "Author": "shotty293",
            "Date Created": "07-13-2018 13:30:47",
            "Upvotes": 5,
            "Text": "I'm pretty sure 99% of laundered money is fiat. You make no sense.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2brkbm": [
        {
            "Parent ID": "t1_e2brd8y",
            "Comment ID": "e2brkbm",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 12:37:28",
            "Upvotes": 8,
            "Text": "Cash gets used for hundreds of thousands maybe millions of dodgy deals every day, shall we ban cash as well? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bzxxh": [
        {
            "Parent ID": "t1_e2brd8y",
            "Comment ID": "e2bzxxh",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 14:25:46",
            "Upvotes": 0,
            "Text": "Ha ha that rumor came from a shady website that accepted crypto ages ago and has since been proven inaccurate.\n\nIn fact, less than 1% of all Bitcoin transactions have been used or even linked to any criminal activity. There was also a study published by the Foundation for Defense of Democracies that showed this along with other investigations into the use of crypto.\n\nHow can people still be saying this? You should not just hear some rumor and spread it on without verifying it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c6lh5": [
        {
            "Parent ID": "t1_e2c58xq",
            "Comment ID": "e2c6lh5",
            "Author": "crossy-road",
            "Date Created": "07-13-2018 15:55:08",
            "Upvotes": 5,
            "Text": "\"The ~~beatings~~ dumps will continue until morale improves!\"",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d83q5": [
        {
            "Parent ID": "t1_e2c5bcs",
            "Comment ID": "e2d83q5",
            "Author": "Teaotic",
            "Date Created": "07-14-2018 04:12:33",
            "Upvotes": 0,
            "Text": "I hope we get to 2K again, fire sale prices.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cahm0": [
        {
            "Parent ID": "t1_e2c7lfp",
            "Comment ID": "e2cahm0",
            "Author": "benziebawks",
            "Date Created": "07-13-2018 16:49:59",
            "Upvotes": 5,
            "Text": "I'm very lucky that my friends were too dumb to figure out how to open a crypto account.  I'd much rather them laugh at me than to want to kill me.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c82j7": [
        {
            "Parent ID": "t1_e2c7m8h",
            "Comment ID": "e2c82j7",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 16:15:47",
            "Upvotes": 1,
            "Text": "For the moment",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c9yop": [
        {
            "Parent ID": "t1_e2c7m8h",
            "Comment ID": "e2c9yop",
            "Author": "gotnoskillz",
            "Date Created": "07-13-2018 16:42:33",
            "Upvotes": 1,
            "Text": "You shorted?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c86zg": [
        {
            "Parent ID": "t1_e2c7m8h",
            "Comment ID": "e2c86zg",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 16:17:30",
            "Upvotes": 0,
            "Text": "A very bad ill may catch you any time now",
            "Edited?": "07-13-2018 16:20:45",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cfdm8": [
        {
            "Parent ID": "t1_e2ce9mq",
            "Comment ID": "e2cfdm8",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 18:03:28",
            "Upvotes": 1,
            "Text": "It's a month that we are in the 6ish thouusand  range... in any case what youu said you obviously true",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5c3k": [
        {
            "Parent ID": "t1_e2c51yx",
            "Comment ID": "e2c5c3k",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:37:39",
            "Upvotes": 1,
            "Text": "Got anymore Iraqi Dinar stories for us? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cpx73": [
        {
            "Parent ID": "t1_e2ckyqd",
            "Comment ID": "e2cpx73",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 21:05:32",
            "Upvotes": 3,
            "Text": "Congrats on your Bitcoin Noob status.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bhe2n": [
        {
            "Parent ID": "t1_e2bge2a",
            "Comment ID": "e2bhe2n",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 10:17:42",
            "Upvotes": 4,
            "Text": "Got to start somewhere. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bm5od": [
        {
            "Parent ID": "t1_e2bfmon",
            "Comment ID": "e2bm5od",
            "Author": "JW4974",
            "Date Created": "07-13-2018 11:25:46",
            "Upvotes": 4,
            "Text": "Errrr ..... that's the problem.\n\nThe bull is doing nothing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bqax4": [
        {
            "Parent ID": "t1_e2bfmon",
            "Comment ID": "e2bqax4",
            "Author": "CanadaPolitixTranny",
            "Date Created": "07-13-2018 12:21:14",
            "Upvotes": 1,
            "Text": "Bull market indicates outsiders coming in.  the huge wave of outsiders coming in is done.  It is near impossible to bring outsiders into crypto space at the moment.  Mainly because of the nature of asic and bitmain.  Btc is pretty much controlled by bitmain at the moment so who in their right mind would invest their hard earned money into btc which directly and indirectly go to bitmain.  Any substantial value increase will cause bitmain to dump and will create a downward trend again.\n\nAside from that, scams are out of fucking control.   So even if outsiders  ignore asic and bitmain(HUGE PROBLEM THAT DEFEATS PURPOSE OF CRYPTO),  they will get burned by inevitable scams and they wont invest anymore money.\n\nAlso, try explaining bitcoin cash or ICOs to the average Joe without sounding like a complete retard for having money tied up in crypto.  If anything, the hardcore fan boys that dont fully grasp abstract concepts are destroying this industry",
            "Edited?": "07-13-2018 12:31:20",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bupdd": [
        {
            "Parent ID": "t1_e2bo7e8",
            "Comment ID": "e2bupdd",
            "Author": "CoinedPrince",
            "Date Created": "07-13-2018 13:18:15",
            "Upvotes": 2,
            "Text": "You are likely speculating, not gambling. There is a difference. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bk7ch": [
        {
            "Parent ID": "t1_e2b56ry",
            "Comment ID": "e2bk7ch",
            "Author": "GrandKaleidoscope",
            "Date Created": "07-13-2018 10:58:28",
            "Upvotes": 1,
            "Text": "poop",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2conad": [
        {
            "Parent ID": "t1_e2cmvyq",
            "Comment ID": "e2conad",
            "Author": "nikolays817",
            "Date Created": "07-13-2018 20:42:01",
            "Upvotes": 1,
            "Text": "Can somebody explain why bitcoin would be more than just hype trading asset? Its not useful for storage f value or medium of exchange due to price fluctuations. You have to pay hefty fees to acquire it. Fees to get your $ back. Whats the point? What is it for, really? My answer is - nothing. Sorry, dear HODLers. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cntcq": [
        {
            "Parent ID": "t1_e2cmvyq",
            "Comment ID": "e2cntcq",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:26:52",
            "Upvotes": -1,
            "Text": "Cost of infrastructure has zero impact on price.\n\nJust ask Dubai about their huge property investments and debt restructuring as it went insolvent.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cl4m4": [
        {
            "Parent ID": "t1_e2c81j7",
            "Comment ID": "e2cl4m4",
            "Author": "JW4974",
            "Date Created": "07-13-2018 19:39:03",
            "Upvotes": 5,
            "Text": "It can be short positions being closed.  But yes, still considered buying.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ca53a": [
        {
            "Parent ID": "t1_e2c81j7",
            "Comment ID": "e2ca53a",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 16:45:01",
            "Upvotes": 2,
            "Text": "Not quite, because there is an order book which is depleted by the immediate sells",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d5gsa": [
        {
            "Parent ID": "t1_e2d582w",
            "Comment ID": "e2d5gsa",
            "Author": "ck310",
            "Date Created": "07-14-2018 02:44:47",
            "Upvotes": 1,
            "Text": "I’m here for the comments.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c0tjo": [
        {
            "Parent ID": "t1_e2booxu",
            "Comment ID": "e2c0tjo",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 14:37:11",
            "Upvotes": 4,
            "Text": "You can't get that concept through the heads of anyone with one-dimensional thinking. They only see the way it is now and think that because the Bitcoin network has been running 10 years it should already be successful. But it took the internet about 40 years, and this is money we're talking about..\n and that is an even harder thing to transition. It's coming though. Anyone that can't see it yet will have to open their eyes eventually.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2coeaf": [
        {
            "Parent ID": "t1_e2booxu",
            "Comment ID": "e2coeaf",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:37:27",
            "Upvotes": 0,
            "Text": "Yes, heard that one before ...  \"institutions\".\n\nWell, the only \"institutions\" doing any investing are investing in platforms to earn fees.  I mean, if they can make money from suckers, why not?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2co5wy": [
        {
            "Parent ID": "t1_e2co0e7",
            "Comment ID": "e2co5wy",
            "Author": "tedjonesweb",
            "Date Created": "07-13-2018 20:33:14",
            "Upvotes": 2,
            "Text": "It's possible, but there is no proof. Most likely they don't operate with fractional reserve like banks, because it's very dangerous to their business.\n\nBut sometimes humans make bad decisions, so nothing is certain.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c4sin": [
        {
            "Parent ID": "t1_e2c3ukd",
            "Comment ID": "e2c4sin",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:30:03",
            "Upvotes": 3,
            "Text": "Lol ...the drop is fine, the organic growth gave profit takers another opportunity. Volume is the only saving grace this market can have, and that may come from news, LN, ETF, SEC ....who knows. Maybe it'll even just happen over time. But volume will destroy these shorts and I'm confident we'll get there in time.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2co2w6": [
        {
            "Parent ID": "t1_e2cm0ny",
            "Comment ID": "e2co2w6",
            "Author": "LemosineRidin",
            "Date Created": "07-13-2018 20:31:44",
            "Upvotes": 5,
            "Text": "I dunno man.  I’ve held coin for 6 months. Through uPs and downs. I used it tonight for about the 25th time.  It’s stupid fast. Accurate.  Prime time easy buying shit.   It works for me.  Why do I need cast.  Not fiat. Cash ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cr8ac": [
        {
            "Parent ID": "t1_e2cqubv",
            "Comment ID": "e2cr8ac",
            "Author": "CoinedPrince",
            "Date Created": "07-13-2018 21:30:05",
            "Upvotes": 1,
            "Text": "I hope you aren’t serious.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bp32j": [
        {
            "Parent ID": "t1_e2boelz",
            "Comment ID": "e2bp32j",
            "Author": "arBettor",
            "Date Created": "07-13-2018 12:04:58",
            "Upvotes": 2,
            "Text": "tbf the ETF will be managed by the same lesbian Anunnaki who killed JFK and faked the moon landing, so I can understand people's concerns.\n\n^^^^^/s",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c6un2": [
        {
            "Parent ID": "t1_e2c659d",
            "Comment ID": "e2c6un2",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:58:38",
            "Upvotes": 2,
            "Text": "That's because anything that fiat can do, Bitcoin can do better :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c6y3m": [
        {
            "Parent ID": "t1_e2c659d",
            "Comment ID": "e2c6y3m",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:59:59",
            "Upvotes": 1,
            "Text": "Oh, and any crypto that doesn't use a blockchain can be banned ... it doesn't even count in my opinion.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmcw9": [
        {
            "Parent ID": "t1_e2cgv8i",
            "Comment ID": "e2cmcw9",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 20:00:38",
            "Upvotes": 2,
            "Text": "ok, you want to make this political\n\nplease stick to how it affects btc or not\n\nbut all this talk about [russia collusion](https://imgur.com/u7mapmq) belongs on a conspiracy subreddit, not on here, where we limit talk to crypto assets and things that are related to them and their performance\n\nthanks!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bs3ed": [
        {
            "Parent ID": "t1_e2brkbm",
            "Comment ID": "e2bs3ed",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 12:44:15",
            "Upvotes": 7,
            "Text": "Cash is difficult to move surreptitiously. which is why they used crypto.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2brpxl": [
        {
            "Parent ID": "t1_e2brkbm",
            "Comment ID": "e2brpxl",
            "Author": "007meow",
            "Date Created": "07-13-2018 12:39:26",
            "Upvotes": 2,
            "Text": "Cash can be traced somewhat ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cddau": [
        {
            "Parent ID": "t1_e2cahm0",
            "Comment ID": "e2cddau",
            "Author": "mojority",
            "Date Created": "07-13-2018 17:32:34",
            "Upvotes": 4,
            "Text": "So True! - 'The only thing people hate more than losing money, is the person who lost it for them.' Anonymous",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cfx6a": [
        {
            "Parent ID": "t1_e2cfdm8",
            "Comment ID": "e2cfx6a",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 18:12:01",
            "Upvotes": 1,
            "Text": "thanks\n\nand lets not forget,\n\nits already lost about $400 in value *just this week*,\n\nand it seems like the current crash we are in is still going on, and each new day is a lowering of value ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5pxt": [
        {
            "Parent ID": "t1_e2c5c3k",
            "Comment ID": "e2c5pxt",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 15:42:58",
            "Upvotes": 2,
            "Text": "My pool guy says the Big RV may be this weekend, and is the real reason that Trump is meeting with European leaders and Putin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bv0pd": [
        {
            "Parent ID": "t1_e2bupdd",
            "Comment ID": "e2bv0pd",
            "Author": "SonOfZaknafein",
            "Date Created": "07-13-2018 13:22:22",
            "Upvotes": 1,
            "Text": "I confess. I'm no dummy.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cr05a": [
        {
            "Parent ID": "t1_e2conad",
            "Comment ID": "e2cr05a",
            "Author": "crossy-road",
            "Date Created": "07-13-2018 21:25:46",
            "Upvotes": 1,
            "Text": "> My answer is - nothing. Sorry, dear HODLers. \n\nIt's okay. I'm sorry too.\n\nI tried years ago arguing with people saying what you're saying. I tried so hard to help them to understand that BTC would eventually do exactly what it did in December last year.\n\nAround January, I started getting excited messages. \"So I finally bought Bitcoin.\" I screamed internally (and externally at the closer ones). \n\nActual retardation. Who the fuck thinks that kind of growth is sustainable and a good thing to buy?\n\nI would have told them to wait for the bulls to leave. Wait until a day when despair coloured the air, blood filled the streets, and Buttcoiners filled our daily thread. It is their time now.\n\n\"This, too, shall pass.\" Not just the bear phase. The whole thing. The back and forth. One of these days, the bears are going to \"win\" for good. But Bitcoin isn't going to zero. It's just going to 10% of its final ATH... and staying there. \n\nI hope for my friends' sake that we've got one more in us. But thanks to not listening to dinosaurs and scared liberals 5 years ago, I am much better off today than I was when Bitcoin was first declared a \"scam.\" \n\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cpxu9": [
        {
            "Parent ID": "t1_e2conad",
            "Comment ID": "e2cpxu9",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 21:05:52",
            "Upvotes": -1,
            "Text": "This is the same thing people always say about new technologies. All the issues you mentioned will eventually be addressed. It would not be possible to advance any faster than it currently is. I remember how we mused about video chatting back when the internet was dial up. I also remember even earlier, loads of people not being able to grasp the internet as a useful tool. There were newspaper articles claiming the internet was the biggest waste of electricity the world has ever known and that it would not amount to anything. Yet here we are.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cppy2": [
        {
            "Parent ID": "t1_e2cntcq",
            "Comment ID": "e2cppy2",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 21:01:47",
            "Upvotes": 1,
            "Text": "It's simple. Infrastructure in technology helps onboard users. Sort of how a step helps you reach a high door. Nothing to do with affecting the price in the way you're coming at it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cem57": [
        {
            "Parent ID": "t1_e2ca53a",
            "Comment ID": "e2cem57",
            "Author": "crossy-road",
            "Date Created": "07-13-2018 17:51:36",
            "Upvotes": 7,
            "Text": "It is still buying. Nobody ever sells more than someone else buys or vice versa. For every seller there is a willing buyer.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cahjz": [
        {
            "Parent ID": "t1_e2ca53a",
            "Comment ID": "e2cahjz",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 16:49:58",
            "Upvotes": 1,
            "Text": "Fair point.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d5mih": [
        {
            "Parent ID": "t1_e2d5gsa",
            "Comment ID": "e2d5mih",
            "Author": "q-1",
            "Date Created": "07-14-2018 02:49:42",
            "Upvotes": 3,
            "Text": "for your own comments? to see how many people you can troll, or rile up? from a cursory reading of your post, it seems you're part of the \"get rich quick\" crowd as well.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c1xt3": [
        {
            "Parent ID": "t1_e2c0tjo",
            "Comment ID": "e2c1xt3",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 14:51:44",
            "Upvotes": 1,
            "Text": "Assumes that in a year BTC will not be on this list at http://www.deadcoins.com",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dt6kc": [
        {
            "Parent ID": "t1_e2coeaf",
            "Comment ID": "e2dt6kc",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 12:53:47",
            "Upvotes": 1,
            "Text": "Institutions have not bought because their framework for buying is different from a retail buyer. We're talking about an asset that takes education, training, and new internal controls to prevent fraud, theft, hacks, etc. It's risky for more reasons than simply its volatility or volume. With custodial services and exchange traded funds, the ease of purchase and reduced liability will make purchase of actual Bitcoin more attractive.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c59x2": [
        {
            "Parent ID": "t1_e2c4sin",
            "Comment ID": "e2c59x2",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:36:48",
            "Upvotes": 1,
            "Text": "Why is the drop fine?  I think it sucks pretty badly! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cre4d": [
        {
            "Parent ID": "t1_e2cr8ac",
            "Comment ID": "e2cre4d",
            "Author": "The-Physicist",
            "Date Created": "07-13-2018 21:33:08",
            "Upvotes": 1,
            "Text": "Hah. J/k man.  Was taking a short break in Hopium rehab ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7cen": [
        {
            "Parent ID": "t1_e2c6un2",
            "Comment ID": "e2c7cen",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 16:05:38",
            "Upvotes": 1,
            "Text": "if you're a criminal, this is undoubtably true.  For everyone else, the banking system is infinitely easier and more efficient.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmplp": [
        {
            "Parent ID": "t1_e2cmcw9",
            "Comment ID": "e2cmplp",
            "Author": "ipewp666",
            "Date Created": "07-13-2018 20:06:57",
            "Upvotes": 5,
            "Text": "It's not a conspiracy, lols they obviously have evidence if they can indict them. Feds don't play. That orange troll is getting fucked.\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cn2g9": [
        {
            "Parent ID": "t1_e2cmcw9",
            "Comment ID": "e2cn2g9",
            "Author": "mobileKixx",
            "Date Created": "07-13-2018 20:13:29",
            "Upvotes": 2,
            "Text": "You made it political. Just like a Trump supporter to accuse someone of something they themselves did. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmu3j": [
        {
            "Parent ID": "t1_e2cmcw9",
            "Comment ID": "e2cmu3j",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 20:09:14",
            "Upvotes": 1,
            "Text": "What Russian bot farm are you working out of anyway?  \n\n\"ok, you want to make this political\". \n\nUh, no, that was you.  I just responded to your nonsense.\n\n\"please stick to how it affects btc or not\"\n\nI posted it above w/o comment.  Since you asked, it's pretty clear that crypto's killer app is illicit transactions.  This is the latest example.  \n\n\"but all this talk about russia collusion belongs on a conspiracy subreddit\"\n\nI brought up the crypto angle.  You brought in the politics son. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2brvp5": [
        {
            "Parent ID": "t1_e2brpxl",
            "Comment ID": "e2brvp5",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 12:41:28",
            "Upvotes": 1,
            "Text": "So can crypto.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cpgk6": [
        {
            "Parent ID": "t1_e2cfx6a",
            "Comment ID": "e2cpgk6",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:56:55",
            "Upvotes": 1,
            "Text": "BTC can go up $500 in minutes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7e3x": [
        {
            "Parent ID": "t1_e2c5pxt",
            "Comment ID": "e2c7e3x",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 16:06:18",
            "Upvotes": 1,
            "Text": "Mining pool or mempool?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5th1": [
        {
            "Parent ID": "t1_e2c5pxt",
            "Comment ID": "e2c5th1",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:44:20",
            "Upvotes": 0,
            "Text": "Your pool guy certainly has a lot to say for himself.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2culie": [
        {
            "Parent ID": "t1_e2cpxu9",
            "Comment ID": "e2culie",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:33:04",
            "Upvotes": -1,
            "Text": "8 year old tech is not \"New\".\n\nAnd adoption is not only negligible but dropping.  The only use case for BTC now is speculating on exchanges.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2crn4i": [
        {
            "Parent ID": "t1_e2cppy2",
            "Comment ID": "e2crn4i",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:37:52",
            "Upvotes": 2,
            "Text": "And why would anyone bother since there are far superior tech already available?\n\nBTC's 8 year old tech is a dinosaur with bandaids and as a currency, acceptance by merchants is pathetic and dropping.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ceyrs": [
        {
            "Parent ID": "t1_e2cem57",
            "Comment ID": "e2ceyrs",
            "Author": "ilpirata79",
            "Date Created": "07-13-2018 17:57:02",
            "Upvotes": 3,
            "Text": "Not what I meant",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d63av": [
        {
            "Parent ID": "t1_e2d5mih",
            "Comment ID": "e2d63av",
            "Author": "tbonecollion",
            "Date Created": "07-14-2018 03:04:17",
            "Upvotes": 2,
            "Text": "No he just trade stock to learn how to invest",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d5sex": [
        {
            "Parent ID": "t1_e2d5mih",
            "Comment ID": "e2d5sex",
            "Author": "ck310",
            "Date Created": "07-14-2018 02:54:50",
            "Upvotes": -4,
            "Text": "Lol not even close. I did make a sweet trade on bitcoin, but it was mostly luck. I subscribe to a service with one of the top traders in the world. Hell-a worth it. If you want more details about that then message me. I can help you win your money back. Otherwise, just posting my opinion that Bitcoin is not an investment. It was a bubble for this generation like Pets.com was for another. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c4wkb": [
        {
            "Parent ID": "t1_e2c1xt3",
            "Comment ID": "e2c4wkb",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:31:36",
            "Upvotes": 2,
            "Text": "Sure. That's actually the most insane thing I've heard. Would you like to bet?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dtsjj": [
        {
            "Parent ID": "t1_e2dt6kc",
            "Comment ID": "e2dtsjj",
            "Author": "JW4974",
            "Date Created": "07-14-2018 13:04:04",
            "Upvotes": 1,
            "Text": "I agree with you on the need for regulations to eliminate fraud, etc.\n\nBut you are wrong in that ETF will solve the problem.  As long as the underlying asset can't be effectively regulated, building an ETF on top of it amplifies the risk, not solve it.  And it's because of this very reason that SEC has so far refused to allow a BTC ETF.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5k30": [
        {
            "Parent ID": "t1_e2c59x2",
            "Comment ID": "e2c5k30",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:40:43",
            "Upvotes": 3,
            "Text": "Because it's a natural part of markets. This is going to happen a lot, but make no mistake, a glance around the globe points clearly to Bitcoin becoming a very big part of society over the next decade. So I say accept the price movement and let time do its job.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c9ek0": [
        {
            "Parent ID": "t1_e2c7cen",
            "Comment ID": "e2c9ek0",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 16:34:33",
            "Upvotes": 2,
            "Text": "It was much easier to use a horse and buggy before paved roads and highway infrastructure to accommodate cars at high speed transportation too. Give it time. The internet took 40 years to go mainstream and another 20 to accommodate bandwidth for today's many applications. Crytpo roots already run too deep for it to go away, and realistically, it can't be any further adopted than it is at this point in time.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cvaut": [
        {
            "Parent ID": "t1_e2cmplp",
            "Comment ID": "e2cvaut",
            "Author": "Nimble4Liberty",
            "Date Created": "07-13-2018 22:46:20",
            "Upvotes": -2,
            "Text": "Yeah they have so much evidence they just want to sit on their asses with it instead of prosecuting people connected with Trump so that the actual basis for starting the special counsel in the first place can be justified. It isn't just a partisan tool that is slowly dying and becoming less credible to anyone with half a brain, that was started by unelected unaccountable bureaucrats who have already been shown to be liars and snakes (Comey and Strzok) who were themselves using corrupt means to influence the election. Such as using easily discreditable opposition research paid for by the Clinton campaign to justify a FISA warrant to spy on the Trump campaign.\n\nThey aren't just keeping the dying show alive by trotting out anything they can even if it's irrelevant to the collusion tinfoil theory, to prevent the Dems mid term \"blue wave\" from becoming even more flaccid than it already has once they end the charade. The FBI and DOJ were so concerned about Russian interference during the election and immediately after, that virtually none of their internal communications that have been released show them discussing it at all, far from it there was only partisan banter about how they must stop Trump by conspiring themselves. \n\nYou're totally not just a low info fake news consuming retard. Stay delusional, I like seeing libs perpetually surprised and hammered by reality.",
            "Edited?": "07-13-2018 23:08:31",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2bsmpw": [
        {
            "Parent ID": "t1_e2brvp5",
            "Comment ID": "e2bsmpw",
            "Author": "darkband",
            "Date Created": "07-13-2018 12:51:12",
            "Upvotes": 3,
            "Text": "Very much so, more then people realize.. wouldn't be surprise if crypto was major part of the evidence to indict.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2crk8d": [
        {
            "Parent ID": "t1_e2cpgk6",
            "Comment ID": "e2crk8d",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 21:36:22",
            "Upvotes": 5,
            "Text": "sure, and it could go to $0 in minutes, too\n\nI don't think it will (go to zero)\n\nbut down to $2000 by the end of 2018?\n\nyes, in my opinion, thats very likely",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c85ev": [
        {
            "Parent ID": "t1_e2c7e3x",
            "Comment ID": "e2c85ev",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 16:16:53",
            "Upvotes": 2,
            "Text": "Water pool, although I think he's putting bromide into it to prevent algae.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c6ush": [
        {
            "Parent ID": "t1_e2c5th1",
            "Comment ID": "e2c6ush",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 15:58:42",
            "Upvotes": 2,
            "Text": "Oh, he is quite talkative and totally positive about his \"investments\" such as they are.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cz51b": [
        {
            "Parent ID": "t1_e2culie",
            "Comment ID": "e2cz51b",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:03:45",
            "Upvotes": 1,
            "Text": "We'll see. I'm not going to explain why 8 years is not only new, but in an infancy stage kind of new. There was no existing and working concept of Bitcoin to build on, it's the first one.\nAll this crypto ecosystem is new really. It's very easy to forget that.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d09un": [
        {
            "Parent ID": "t1_e2culie",
            "Comment ID": "e2d09un",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:29:08",
            "Upvotes": 0,
            "Text": "Ever see the 8 year old concept of the internet? How about the 8 year old concept of the airplane? car? 3D Printing is still evolving, it generates a buzz every 4-5 years and just fades out of mainstream media over and over. It's still NEW. How about the cell phone after 8 years? Could you do banking on cell phones only 8 years after they were conceived? THINK before you type. It's not 8 year old tech, it's an 8 year old concept. The tech (hardware and software of the network) is being upgraded all the time, and will continue to ongoing. Get it now? It's the network that organically upgrades because the mining rigs and code will be upgraded for the remainder of its existence ... whether that's 1 month or 1000 years.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2czdza": [
        {
            "Parent ID": "t1_e2crn4i",
            "Comment ID": "e2czdza",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:09:13",
            "Upvotes": 2,
            "Text": "Ha ha. Reality will hit you harder than most. It takes years to prove it has the potential before real effort goes into it. There's no research and development team budget like a corporation. The creators are open source coders. But that is also it's biggest strength and why it will only continue to improve until it fulfills the role of a real solution. Believe it, don't believe it. Nobody really cares what either of us think. This stuff happens with or without us.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctnmv": [
        {
            "Parent ID": "t1_e2crn4i",
            "Comment ID": "e2ctnmv",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 22:15:28",
            "Upvotes": 0,
            "Text": "Exactly. There are a lot of companies that are moving certain operations to Blockchain for reasons and purposes that have utterly nothing to do with BTC, and hodlrs of BTC don't make a tenth of a penny in technology royalties from businesses using Blockchain. The most likely result is that the transaction costs of dealing with government currencies will decrease in areas such as wire-transfers, currency conversions, and credit card transactions, which will further obviate the need for BTC. Then, of course, there are BTC's numerous other problems such as susceptibility to market manipulation, high volatility, and the linger reputation of an \"investment\" that costs many thousands of people many billions of dollars (or their local currency) worldwide. Bitcoin may survive at some level for dark activities, but BTC's chances of replacing any significant governmental currency is probably much less than 1 in 10,000.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csati": [
        {
            "Parent ID": "t1_e2crn4i",
            "Comment ID": "e2csati",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 21:50:17",
            "Upvotes": 0,
            "Text": "It's hilarious that you still think Bitcoin is about being Paypal 2.0. Time for you to dig more into it instead of wasting time on this sub.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8fd2": [
        {
            "Parent ID": "t1_e2d5sex",
            "Comment ID": "e2d8fd2",
            "Author": "misterblk",
            "Date Created": "07-14-2018 04:24:12",
            "Upvotes": 2,
            "Text": "> I subscribe to a service with one of the top traders in the world\n>  It was a bubble for this generation like Pets.com was for another.\n\npick one you inbicil\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d646b": [
        {
            "Parent ID": "t1_e2d5sex",
            "Comment ID": "e2d646b",
            "Author": "q-1",
            "Date Created": "07-14-2018 03:05:05",
            "Upvotes": 1,
            "Text": "If you can call Bitcoin a bubble, you can call everything a bubble. Funny how that goes. Banks are a bubble. Housing is a bubble. Investment is a bubble. Humanity is a bubble.\n\nOn the \"winning my money back\" issue: I don't have any money lost due to Bitcoin, to be completely honest. The only time I actually lost money was when I had to deal with banks (be it bank affiliates, like exchanges, or banks themselves).\n\nI've also had multi-annual forays into the local stock markets and forex markets, with and without professional advisors and traders. I've lost more money (in the thousands of GBP) due to their professional advice than ever before or since. So, thanks, but no, thanks.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8550": [
        {
            "Parent ID": "t1_e2d5sex",
            "Comment ID": "e2d8550",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 04:13:55",
            "Upvotes": 1,
            "Text": "Heh.  Fake.  You sound like the bad guy at the end of Scooby Doo:\n\n'Lol not even close, kids'  'I did make a sweet trade on that ol' haunted goldmine though'\n\nLol.  Trolling loser.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5ct7": [
        {
            "Parent ID": "t1_e2c4wkb",
            "Comment ID": "e2c5ct7",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 15:37:55",
            "Upvotes": 2,
            "Text": "Already betting by shorting BTC.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dxyj7": [
        {
            "Parent ID": "t1_e2dtsjj",
            "Comment ID": "e2dxyj7",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 14:14:48",
            "Upvotes": 1,
            "Text": "You are absolutely right, but I am optimistic that future regulatory framework will make Bitcoin more attractive. I think the most recent battery of crypto-related hearing at Congress and by the SEC in the US reinforce the idea that Bitcoin will be better regulated in the future",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ceszn": [
        {
            "Parent ID": "t1_e2c5k30",
            "Comment ID": "e2ceszn",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:54:33",
            "Upvotes": 1,
            "Text": "> a natural part of markets. \n\nAn asset losing 70% of its value in a little over 6 months is not a natural part of any healthy market\n\nAnd an asset that has been continuously crashing hard for six months straight is not a part of any healthy market, either\n\nThats its STILL crashing hard (-$400 just this week) is not a natural part of any healthy market either\n\nI am not saying BTC will never come back (i don't know) but its in a VERY unhealthy and bad condition right now, and there is no sign that this severe drop in value will be letting up any time soon (or ever).\n\nFirst step is acceptance, and we have to get out of denial and admit that bitcoin is in a death spiral, or in very serious, serious trouble, at the very least.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5ua9": [
        {
            "Parent ID": "t1_e2c5k30",
            "Comment ID": "e2c5ua9",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 15:44:40",
            "Upvotes": 1,
            "Text": "Very hard to be optimistic at the moment.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c9rfc": [
        {
            "Parent ID": "t1_e2c9ek0",
            "Comment ID": "e2c9rfc",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 16:39:42",
            "Upvotes": 0,
            "Text": "I think the only likely way that crypto becomes widely adopted and something other than a black market chit/nerd bucks is when central banks adopt/control/regulate actual crypto that is real currency under the control of central banks, not pseudo currencies that are really digital commodities.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dj625": [
        {
            "Parent ID": "t1_e2cvaut",
            "Comment ID": "e2dj625",
            "Author": "ipewp666",
            "Date Created": "07-14-2018 09:58:35",
            "Upvotes": 1,
            "Text": "Its an independent investigation you half brain, read the news stop reading 4chan and r/the_donald and fox \"news\" that shit is fucking lying to you if you believe it, for entertainment I get it, but to fuckin believe that shit. You are destroying our country if you truly believe this man and his ideologies, and spread his hate, you will fuck us so hard. and by us us i mean your neighbors your coworkers, your friends, family. We will be fucked. You are probably a russian troll, working on russian troll farm, spreading fake information. Fuck you and i hope you die.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2crppt": [
        {
            "Parent ID": "t1_e2crk8d",
            "Comment ID": "e2crppt",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:39:14",
            "Upvotes": 2,
            "Text": "Beats me.  The price is so heavily manipulated, you can never figure out what games they are playing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0po1": [
        {
            "Parent ID": "t1_e2cz51b",
            "Comment ID": "e2d0po1",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:39:03",
            "Upvotes": -1,
            "Text": "Please just take a look at the tech 8 years ago and where we are at now.  Sorry but the world has moved on and BTC is now just a dinosaur.\n\nBTC's application as a currency has failed.  It's now just a digital token speculated on exchanges.\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0j7n": [
        {
            "Parent ID": "t1_e2czdza",
            "Comment ID": "e2d0j7n",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:35:06",
            "Upvotes": 1,
            "Text": "Zzzzzzz ....\n\nI really think you should learn more about tech beyond BTC youtubes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2czt95": [
        {
            "Parent ID": "t1_e2ctnmv",
            "Comment ID": "e2czt95",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:18:43",
            "Upvotes": 1,
            "Text": "Dark activites lol. And nobody said it needs to replace anything. It need to provide an alternative that is well aligned with multiple types of transactions, without any global or total amount restrictions.\nI don't anticipate your mind opening up much past what is currently in place. You need to remind yourself that many technologies we use today weren't even imagined when we were kids.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csvt9": [
        {
            "Parent ID": "t1_e2csati",
            "Comment ID": "e2csvt9",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:01:14",
            "Upvotes": 3,
            "Text": "Let me see ...\n\nBTC - 8yo tech and need bandaids like Lightning to scale (current architecture is obsolete).  Using a medium that is not accepted by 99.99% of merchants.  Generated $0 for shareholders.\n\nPaypal - Processed $451B of payments for real products and services last year.  Using currencies that are acceptable by every major vendor.  Generated $620m for shareholders.\n\nYou are right, the comparison is hilarious.  And Paypal is not even considered cutting edge and is falling behind.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8bcu": [
        {
            "Parent ID": "t1_e2d8550",
            "Comment ID": "e2d8bcu",
            "Author": "ck310",
            "Date Created": "07-14-2018 04:20:06",
            "Upvotes": 1,
            "Text": "Lol pretty much i guess! Good luck to ya. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5v1e": [
        {
            "Parent ID": "t1_e2c5ct7",
            "Comment ID": "e2c5v1e",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:44:57",
            "Upvotes": 2,
            "Text": "Ok so then you're not willing to bet that Bitcoin will be on that list? Because you know fucking well that it won't be. Unless you really truly believe something, don't say it, otherwise you're just spewing verbal diarrhea.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2chd86": [
        {
            "Parent ID": "t1_e2ceszn",
            "Comment ID": "e2chd86",
            "Author": "tedjonesweb",
            "Date Created": "07-13-2018 18:35:25",
            "Upvotes": 3,
            "Text": "Look S&P 500 at 2007-2009.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ckp1h": [
        {
            "Parent ID": "t1_e2ceszn",
            "Comment ID": "e2ckp1h",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 19:31:27",
            "Upvotes": 3,
            "Text": "In serious trouble how? There's more infrastructure, mining software, SEC acknowledgment, peer to peer exchanges, etc, then ever before. The open source community for Bitcoin is stronger than ever, and the Lightning Network is the beginning of much more layering and improvements coming down the pipe. There have been well respected business people claiming Bitcoin will be an excellent fit for real estate transactions among many applications. We don't even have wallet address translation yet, and non technical people have no user friendly platform for onboarding, but it's clearly coming. \nFocusing only in the coin price is silly, but there's the fact that Bitcoin jas crashed like this many many times, in fact it's crashed worse at a 90% drop once. We are in early days, but I do understand that a quick look at the outside view of this would lead one to feel pessimistic. Just remember, in the early days of cars, the speed limit was only 20 mph, because they didn't want to spook the horses.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c5z4x": [
        {
            "Parent ID": "t1_e2c5ua9",
            "Comment ID": "e2c5z4x",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 15:46:32",
            "Upvotes": 6,
            "Text": "Why?  It's the same price as it was last month. Sideways movement usually proceeds upward movement. In any case it seems to have leveled out somewhere between 5500 and 6500. \n\nListen, and if you believe anything you read on here or wherever, please know this:\n\nBitcoin is NOT going away. There's a lot of shit I don't know, a lot. But I have an excellent understanding of how technology evolves and integrates with society. I am telling you right now .. Bitcoin is not going away. Anyone that says it is, well the real bubble is the one they're living in.",
            "Edited?": "07-13-2018 15:55:30",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2clfsp": [
        {
            "Parent ID": "t1_e2c9rfc",
            "Comment ID": "e2clfsp",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 19:44:31",
            "Upvotes": 2,
            "Text": "That's just you refusing to consider other possibilities outside what your brain has been exposed to. You do realize that if everyone thought that way, we'd have none of the innovations we enjoy today.\nIf a new generation that's been raised in a digital culture embrace Bitcoin, then it will be adopted. It's global and non centralized. I don't think it will replace the fiat system in all countries of the world any time soon, but it will almost certainly run along side as an alternative currency that is not tied to any one country or region.\nI fully support  Bitcoin and see where it is headed, but as a network security specialist for years, I sometimes also see it as something that is possibly one of the most robust entities to ever come out of mankind's imagination. Think about what it has already survived... the negativity, and the paid studies from the BIS, all the crap thrown at it to beat it down over the years..yet it just keeps growing bigger and bigger (not the coin price, I mean the entity). One thing I know for sure...Bitcoin will outlive you and I.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cs4ix": [
        {
            "Parent ID": "t1_e2c9rfc",
            "Comment ID": "e2cs4ix",
            "Author": "StraightDegan",
            "Date Created": "07-13-2018 21:46:59",
            "Upvotes": 1,
            "Text": "I think crypto will stop being used as much when the banks get involved. What will really take crypto up is when more shops, bars, services, etc start letting you pay in crypto",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2crvl9": [
        {
            "Parent ID": "t1_e2crppt",
            "Comment ID": "e2crvl9",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 21:42:19",
            "Upvotes": 1,
            "Text": "yes, they can manipulate it a lot\n\nthey might just break it, totally (and then the price will go down to zero)\n\nthey can't manipulate it too much (for example, they can't manipulate it up to $50K)\n\nfor now, I think they'll just manipulate it, up and down (like they are doing now), do lots of pump and dumps for a couple of years, and make billions off of the regular investors, and speculators\n\neventually, everyone will know its a scam, and no one will want BTC, and it will die.\n\nat that point the scammers and whales will just move on to their next scam, and the average investors and *true believers* will be left penniless",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0qgt": [
        {
            "Parent ID": "t1_e2d0j7n",
            "Comment ID": "e2d0qgt",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:39:33",
            "Upvotes": 2,
            "Text": "I did that before there was YouTube. You're really reaching now hey.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dmrj1": [
        {
            "Parent ID": "t1_e2czt95",
            "Comment ID": "e2dmrj1",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-14-2018 11:05:40",
            "Upvotes": 1,
            "Text": "Correct, but many are, see, e.g., wheel.\n\nBut, hey, don't be blinded by greed or anything.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2czm6t": [
        {
            "Parent ID": "t1_e2csvt9",
            "Comment ID": "e2czm6t",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:14:18",
            "Upvotes": 1,
            "Text": "The confirmation you have provided that people with your pinpointed and tunneled scope of information to draw conclusions from even exist makes me all the more grateful for the inventors and innovators we have in this world.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ct583": [
        {
            "Parent ID": "t1_e2csvt9",
            "Comment ID": "e2ct583",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:06:05",
            "Upvotes": 0,
            "Text": "Base layer is not even tech but sound money/Gold 2.0 (Tech only starts from L1 and beyond) so your direct comparison of fintech vs Bitcoin base layer fail hard. Please try again. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7dyi": [
        {
            "Parent ID": "t1_e2c5v1e",
            "Comment ID": "e2c7dyi",
            "Author": "ShortyTheBearTrader",
            "Date Created": "07-13-2018 16:06:14",
            "Upvotes": 2,
            "Text": "Who knows? Suckers bought those other cryptos too thinking they were valuable.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cm8gb": [
        {
            "Parent ID": "t1_e2chd86",
            "Comment ID": "e2cm8gb",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 19:58:29",
            "Upvotes": 2,
            "Text": "yes, just because the most stable investment instrument ever bounced back is hardly proof that the very new, and unstable BTC will also bounce back\n\nyou do know that, right?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cm5fw": [
        {
            "Parent ID": "t1_e2ckp1h",
            "Comment ID": "e2cm5fw",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 19:57:02",
            "Upvotes": 1,
            "Text": "> In serious trouble how?\n\nits crashing\n\nits been crashing for 6 months straight\n\nand its still crashing hard\n\nall those reasons don't overcome the reality that btc is down 70% since last winter\n\nyou can try to excuse how were in a crash that shows no signs of ending, but that still doesnt excuse how it is doing so poorly, with no end in sight!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c7zwg": [
        {
            "Parent ID": "t1_e2c5z4x",
            "Comment ID": "e2c7zwg",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 16:14:46",
            "Upvotes": 1,
            "Text": "It's very hard to be optimistic because we have been going down hill since mid December and the price has crashed around 70%!  10-20% I could accept but 70% is a bloody lot! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ceyla": [
        {
            "Parent ID": "t1_e2c5z4x",
            "Comment ID": "e2ceyla",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:56:57",
            "Upvotes": -2,
            "Text": "> It's the same price as it was last month\n\nwrong\n\nits worth $400 LESS than it was last month\n\nand its still spiraling downward\n\nits been going down nearly non-stop for 6 months straight, and its still crashing hard\n\nyou can have faith in BTC or not, but we need to get out of denial and at least admit that bitcoin is in serious trouble, and there is no evidence that this crash will be ending anytime soon.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cmos1": [
        {
            "Parent ID": "t1_e2clfsp",
            "Comment ID": "e2cmos1",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 20:06:32",
            "Upvotes": 1,
            "Text": "\"You do realize that if everyone thought that way, we'd have none of the innovations we enjoy today.\"\n\nThat's an absurdity.  I can distinguish between things that advance society and things that can be extraordinarily destructive.\n\n\"If a new generation that's been raised in a digital culture embrace Bitcoin, then it will be adopted.\"\n\nDon't smoke your own supply man.\n\n\"It's global and non centralized.\"\n\nSo?  I can use dollars anywhere and even when I can't they're easily convertible.  Transactions are instantaneous and with minimal fees. \n\n\"but it will almost certainly run along side as an alternative currency that is not tied to any one country or region.\"\n\nI don't dispute that a tiny fraction of overall transactions will continue to happen in nerd bucks.  People still operate ham radio.  Doesn't mean it's all that meaningful in grand scheme of things.\n\n\"I fully support Bitcoin and see where it is headed.\"  \n\nGood for you.\n\n\"but as a network security specialist for years, I sometimes also see it as something that is possibly one of the most robust entities to ever come out of mankind's imagination.\"\n\nIf security is the concern bitcoin should scare the fuck out of you.  \n\n\"One thing I know for sure...Bitcoin will outlive you and I.\"\n\nSo will ham radio.  \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csvze": [
        {
            "Parent ID": "t1_e2cs4ix",
            "Comment ID": "e2csvze",
            "Author": "OliveTBeagle",
            "Date Created": "07-13-2018 22:01:19",
            "Upvotes": 1,
            "Text": "Hahahaha.\n\nDude - y'all need to drop this delusion.  Crypto isn't money and will never be used as such (except for a relative handful of nerds).\n\nLike, think about this for 10 fucking seconds.  \n\n1.  It's WAY too volatile to ever be currency.  Only a small fraction of people will have the risk tolerance to be in at all. \n\n2.  Every transaction is a taxable event.  Every. Single. Transaction.  Now you're going to have to transform whole segments of society that fill out a 1040 ez form into 1040 with long schedule Cs - tax headaches for people who make basic wages?  LOL no.\n\n3.  People who hodl bitcoin won't want to spend on the way up (my pizza will be worth 20% more tomorrow!) or the way down (I'll lose 10% if I buy that cupcake).  Either way - this isn't transactional currency.  And that's just for everyday transactions.  Try closing a fucking complicated financing deal with bitcoin?  It would be a fucking nightmare - trust me, I do this for a living.  How are you going to pick a price months out on an asset that can gain or lose as much as 20% in a fucking day?  \n\n4.  It's complicated.  Oh, sure a few nerds will get into it.  Got to think about Aunt Sally.  WTF does Aunt Sally know about hard wallets, soft wallets, cold storage, exchanges, hard forks, soft forks, 51% attacks, lightning network. . .it's going to make her head spin.  You know what Aunt Sally does when her head starts to spin?  That's right she orders a gin and tonic and pays for it with good old fashioned greenbacks.\n\nTo be attractive, currency must be stable.  Currency is also (slowly) inflationary for very good reasons.  Y'all need to stop conflating investments with currency - really bad idea, never going to work.  As a practical matter, the only thing people actually do with bitcoin is trade it. \n\nThat and engage in illicit activities - bitcoin will be useful for black markets, human trafficking, terrorism, drug trade. . . that is a useful feature of bitcoin.  Without a doubt illicit acts are bitcoin's killer app, and for that reason alone I predict heavy heavy regulations.\n\nBut other than that, the broad population doesn't need it and won't adopt it.  ",
            "Edited?": "07-13-2018 22:07:43",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csaxj": [
        {
            "Parent ID": "t1_e2crvl9",
            "Comment ID": "e2csaxj",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:50:20",
            "Upvotes": 3,
            "Text": "True believers don't care about the price (so they claim).\n\nBut yes, it's a scam.  90% of trading is carried out on Chinese exchanges with no addresses and using Tether, which has refused audit.  If these aren't red flags, I don't know what is.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csiad": [
        {
            "Parent ID": "t1_e2crvl9",
            "Comment ID": "e2csiad",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 21:54:13",
            "Upvotes": 2,
            "Text": "Stop using your parent's credit cards to buy Bitcoin. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0hr2": [
        {
            "Parent ID": "t1_e2czm6t",
            "Comment ID": "e2d0hr2",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:34:11",
            "Upvotes": 3,
            "Text": "You been watching too much \"BTC gurus\" on Youtube.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctd52": [
        {
            "Parent ID": "t1_e2ct583",
            "Comment ID": "e2ctd52",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:10:12",
            "Upvotes": 2,
            "Text": "Sure, keep calling a digital token \"sound money\".\n\nStrange that this \"sound money\" is worth $0 to 99.99% of the merchants. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cacz0": [
        {
            "Parent ID": "t1_e2c7dyi",
            "Comment ID": "e2cacz0",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 16:48:10",
            "Upvotes": 2,
            "Text": "But that was because they were hoping on the small change ce that just maybe one of them would stick and get a pump to make them a quick profit.\nBasically ... people were hoping to find the next Bitcoin. But Bitcoin is the authentic currency blockchain and finally has that first decade of network stability under its belt to provide confidence to warrant the investment of more effort from coders to build it into what it needs to be. It has the foundation that no other crypto has come remotely close to achieving. Nobody needs to worry about Bitcoin going away. It only just reached a point where it can really begin scaling.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cnca8": [
        {
            "Parent ID": "t1_e2cm8gb",
            "Comment ID": "e2cnca8",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 20:18:20",
            "Upvotes": 0,
            "Text": "Well maybe history doesn't always repeat but it is undisputed as an excellent source of how patterns occur. As I mentioned, Bitcoin has crashed as much as 90% in the past, only to come back stronger... and that was before the enhanced infrastructure of today.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2co9nq": [
        {
            "Parent ID": "t1_e2cm8gb",
            "Comment ID": "e2co9nq",
            "Author": "tedjonesweb",
            "Date Created": "07-13-2018 20:35:08",
            "Upvotes": 0,
            "Text": "I gave example of something that crashes over 50% and then going up. There are many examples, look for example what happened to AIG stock between 2007 and 2018.\n\n50-60-80% crash is not equal to death.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cpmly": [
        {
            "Parent ID": "t1_e2cm8gb",
            "Comment ID": "e2cpmly",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:00:04",
            "Upvotes": 0,
            "Text": "Stocks are based on real company performance, like revenue and profits.\n\nAs long as the company is performing, the share price will correct itself and recover.\n\nBTC price is based on pure speculation.  There's nothing that can stop it from reaching $0 or $1m.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cn65c": [
        {
            "Parent ID": "t1_e2cm5fw",
            "Comment ID": "e2cn65c",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 20:15:19",
            "Upvotes": 0,
            "Text": "So that's what you got from my comment hey? The coin price has little to do with the future of Bitcoin. The price will follow the adoption in due time. In fact according to the coders and the exchanges, they take full advantage of these lower volumes to focus on improving the infrastructure. \nAnyway, you are just looking with tunnel vision at the market and not at Bitcoin,  so there seems to be little point in this discussion.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c95qq": [
        {
            "Parent ID": "t1_e2c7zwg",
            "Comment ID": "e2c95qq",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 16:31:03",
            "Upvotes": 2,
            "Text": "I know buddy, but if you step back it's just the most realistic example of what a correction is... it went up too much too fast and we're getting back to a more realistic movement. With the fast pace of infrastructure development in the crypto space, the next bull run will be much more solid. It'll happen, and with real investment and real world applications.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cf18s": [
        {
            "Parent ID": "t1_e2c7zwg",
            "Comment ID": "e2cf18s",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 17:58:05",
            "Upvotes": 0,
            "Text": "agreed\n\nthings are bad, and there is no evidence that this hard crash downward will be ending anytime soon (or ever)\n\nsadly, many on here are in denial, and will not open their eyes to the truth the BTC is in very bad shape right now",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ckkk8": [
        {
            "Parent ID": "t1_e2ceyla",
            "Comment ID": "e2ckkk8",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 19:29:17",
            "Upvotes": 2,
            "Text": "In serious trouble how? There's more infrastructure, mining software, SEC acknowledgment, peer to peer exchanges, etc, then ever before. The open source community for Bitcoin is stronger than ever, and the Lightning Network is the beginning of much more layering and improvements coming down the pipe. There have been well respected business people claiming Bitcoin will be a excellent for real estate transactions among many applications. We don't even have wallet address translation yet and non technical people have user friendly platform to onboarding but it's clearly coming. \nFocusing only in the coin price is silly, but there's the fact that Bitcoin jas crashed like this many many times, in fact it's crashed worse at a 90% drop once. We are in early days, but I do understand that a quick look at the outside view of this would lead one to feel pessimistic. Just remember, in the early days of cars, the speed limit was only 20 mph, because they didn't want to spook the horses.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ckw7g": [
        {
            "Parent ID": "t1_e2ceyla",
            "Comment ID": "e2ckw7g",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 19:34:58",
            "Upvotes": 0,
            "Text": "Sorry but it is approximately the same price as mid June and now it's mod July. Zoom out on a chart and you can clearly see downward movement up to mid June, and from there it been bouncing around between 5800 to 6800. But hey who knows.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0m8f": [
        {
            "Parent ID": "t1_e2cmos1",
            "Comment ID": "e2d0m8f",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:37:00",
            "Upvotes": 1,
            "Text": "Ah how sweet, you addressed every point I made.. with completely absurd and irrational responses, but you at least tried. I mean, there are people that think the earth is flat, and with the right wording, can make it sound half convincing to an 8 year old.\nOh, and the fact that you call it nerd bucks says more than anyone needs to know about how your limited brain functions. They used to call PC users nerd tools for years. Those computer things never amounted to anything either. Am I right?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cw3p9": [
        {
            "Parent ID": "t1_e2csvze",
            "Comment ID": "e2cw3p9",
            "Author": "StraightDegan",
            "Date Created": "07-13-2018 23:01:53",
            "Upvotes": 1,
            "Text": "Hey man is everything ok with you at home? You are awfully worked up over a difference in opinion, and when you get worked up you have a tendency to wildly speculate about people's spending habits",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csjh3": [
        {
            "Parent ID": "t1_e2csaxj",
            "Comment ID": "e2csjh3",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 21:54:51",
            "Upvotes": 2,
            "Text": "agreed\n\nits an obvious scam\n\nsadly, i was one of the suckers who was fooled (I lost 60% of what i put in)\n\nOh well... i'm not a fool like those saying \"just HODL\" and \"just wait, i'll go to the moon any day\"\n\nLOL\n\nyear right\n\nits not going to the moon, its going into the toilet\n\nI'm so totally OVER BTC, it was such a scam, I'm just sad for myself and all the good people who were fooled into losing our money\n\nAnd yes... I take FULL personal responsibility, its still sad that scammers are now rich through money they lied to achieve\n\nOH well... all i can say is #neveragain",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cstrx": [
        {
            "Parent ID": "t1_e2csiad",
            "Comment ID": "e2cstrx",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:00:12",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": "07-09-2020 23:31:32",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0skz": [
        {
            "Parent ID": "t1_e2d0hr2",
            "Comment ID": "e2d0skz",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:40:53",
            "Upvotes": 1,
            "Text": "Have never watched even one. I catch the occasional Joe Rogan Pod and music in a third sideline monitor while working but that's about it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctxtu": [
        {
            "Parent ID": "t1_e2ctd52",
            "Comment ID": "e2ctxtu",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:20:45",
            "Upvotes": 0,
            "Text": "Sure keep hogging on to your Keynesian economics. Its just a matter before you drown in your salty tears.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2co56g": [
        {
            "Parent ID": "t1_e2cacz0",
            "Comment ID": "e2co56g",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:32:51",
            "Upvotes": 1,
            "Text": "If you call a couple of mining pools in China operating out of unlabelled warehouses a \"foundation\", yeah sure.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cpo5c": [
        {
            "Parent ID": "t1_e2cnca8",
            "Comment ID": "e2cpo5c",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:00:50",
            "Upvotes": 1,
            "Text": "That's simply because of price manipulation, not organic.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2crimj": [
        {
            "Parent ID": "t1_e2cpmly",
            "Comment ID": "e2crimj",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 21:35:29",
            "Upvotes": 1,
            "Text": "true\n\nand it seems like its heading towards $0 a lot faster than its heading to $1M\n\nI don't think it will go to zero, but its definitely been crashing a long time, and continues to crash even now",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2c9x1f": [
        {
            "Parent ID": "t1_e2c95qq",
            "Comment ID": "e2c9x1f",
            "Author": "BitcoinAlways",
            "Date Created": "07-13-2018 16:41:54",
            "Upvotes": 1,
            "Text": "I hope so :) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8z38": [
        {
            "Parent ID": "t1_e2cf18s",
            "Comment ID": "e2d8z38",
            "Author": "misterblk",
            "Date Created": "07-14-2018 04:44:37",
            "Upvotes": 1,
            "Text": "> things are bad, and there is no evidence that this hard crash downward will be ending anytime soon (or ever)\n\ndumb money is capitulating, the end is near!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cldy3": [
        {
            "Parent ID": "t1_e2ckkk8",
            "Comment ID": "e2cldy3",
            "Author": "JW4974",
            "Date Created": "07-13-2018 19:43:35",
            "Upvotes": 1,
            "Text": "You must be really desperate to be spamming this crap 24x7.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cm6n3": [
        {
            "Parent ID": "t1_e2ckkk8",
            "Comment ID": "e2cm6n3",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 19:57:38",
            "Upvotes": 1,
            "Text": "> In serious trouble how?\n\nits crashing\n\nits been crashing for 6 months straight\n\nand its still crashing hard\n\nall those reasons don't overcome the reality that btc is down 70% since last winter\n\nyou can try to excuse how were in a crash that shows no signs of ending, but that still doesnt excuse how it is doing so poorly, with no end in sight!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d88bb": [
        {
            "Parent ID": "t1_e2d0m8f",
            "Comment ID": "e2d88bb",
            "Author": "OliveTBeagle",
            "Date Created": "07-14-2018 04:17:03",
            "Upvotes": 1,
            "Text": "\"I mean, there are people that think the earth is flat\" \n\nThat's your takeaway, I'm a flat earther?  LOL\n\n\"about how your limited brain functions\"\n\nsick burn bro\n\n\"Those computer things never amounted to anything either. Am I right?\"\n\nGolly, nothing ever doesn't work out in the tech world. Every new innovation is a huge success - no dead ends here!  \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csx79": [
        {
            "Parent ID": "t1_e2csjh3",
            "Comment ID": "e2csx79",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:01:57",
            "Upvotes": 1,
            "Text": "Did you sell your leftover coins already? If not, better do it fast so the smart people that understand sound money can able to get it cheaper. No use for you to be having them when you consider it a scam. \n\nPS: I'll wave to you when you fomo in at 20k again in the future.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ct4sc": [
        {
            "Parent ID": "t1_e2cstrx",
            "Comment ID": "e2ct4sc",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:05:51",
            "Upvotes": 1,
            "Text": "tofuspider is just a troll who randomly drops in and make nonsensical attacks based on troll logic.\n\nHe usually backs off into his little corner once you slam him with facts (he has only a limited arsenal of rhetorics that he cut and paste from websites).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctr4f": [
        {
            "Parent ID": "t1_e2cstrx",
            "Comment ID": "e2ctr4f",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:17:15",
            "Upvotes": 1,
            "Text": "You always say scam everywhere for days without even asking why has it not died for years? Educate yourself and ask for proper resources on the fundamentals on Bitcoin and I'll be glad to link them up to you. I'm sorry you fomo for some of it but I've been there too during the Gox era and during those time, I don't even have the coins to sell if you I want to. \n\nI can be polite/impolite if I want to. I don't give a shit. But be humble and ask for more information to educate yourself instead of spreading your claims without any supporting evidence. Your scam arguments has been debunked since years ago btw.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d8pik": [
        {
            "Parent ID": "t1_e2cstrx",
            "Comment ID": "e2d8pik",
            "Author": "misterblk",
            "Date Created": "07-14-2018 04:34:35",
            "Upvotes": 1,
            "Text": "> As for your insulting comment, yes I lost 60% of what I put into bitcoin\n\nyou still posting here you fuckwit,gtfo somewhere else with your fud and not educated comments, no one cares about you, good bye\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cubj1": [
        {
            "Parent ID": "t1_e2ctxtu",
            "Comment ID": "e2cubj1",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:27:49",
            "Upvotes": 1,
            "Text": "Wow!  Another cut & paste word!  Do you even understand Keynes?\n\nAnyway, you still haven't provided a response to how a digital token that is rejected by 99.99% of merchants be considered \"sound money\".\n\nWant to talk about decentralisation and the fact that China controls over 75% of the mining?  A country with an authoritarian government that can dictate to the miners to launch a 51% attack if they chose to?\n\n\"Sound money\" .... my arse.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d3qdd": [
        {
            "Parent ID": "t1_e2co56g",
            "Comment ID": "e2d3qdd",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 01:54:58",
            "Upvotes": 1,
            "Text": "No that is not what I am referring to. You are not able to have this conversation. You are not equipped.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cs0ox": [
        {
            "Parent ID": "t1_e2crimj",
            "Comment ID": "e2cs0ox",
            "Author": "JW4974",
            "Date Created": "07-13-2018 21:45:01",
            "Upvotes": 1,
            "Text": "That's because it's a speculative price with no real floor.\n\nIn the absence of greater fools, price will go flat and then taper down (or crash) as people take profit or just cut their loss.  There is no basis for price to go up.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d913a": [
        {
            "Parent ID": "t1_e2d8z38",
            "Comment ID": "e2d913a",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 04:46:44",
            "Upvotes": 1,
            "Text": "you laugh\n\ni'm just staying actual facts\n\nif you can't hang, thats on you!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cnlm0": [
        {
            "Parent ID": "t1_e2cldy3",
            "Comment ID": "e2cnlm0",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 20:22:59",
            "Upvotes": 1,
            "Text": "Kind of my job. What's ironic is that I have not lost a penny in Bitcoin or crypto. I'm one of those rare \"in it for the tech\" freaks I guess. \nIf I can shed light on Bitcoin for a few people who are confused, that's worth it. I'd never advise dumping money you cant afford to lose into it. I simply am educating people on a very likely possibility for the next decade.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cnph8": [
        {
            "Parent ID": "t1_e2cm6n3",
            "Comment ID": "e2cnph8",
            "Author": "cryptogrip",
            "Date Created": "07-13-2018 20:24:56",
            "Upvotes": 0,
            "Text": "Its crashed worse, and it will rise and likely crash again too. It will take several years before it functions as an alternative currency. So what?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dlgrz": [
        {
            "Parent ID": "t1_e2d88bb",
            "Comment ID": "e2dlgrz",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 10:42:41",
            "Upvotes": 1,
            "Text": "You are pathetic and should never try and debate this with anyone ever again. Find something you understand.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ct9qg": [
        {
            "Parent ID": "t1_e2csx79",
            "Comment ID": "e2ct9qg",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:08:26",
            "Upvotes": 1,
            "Text": "Well, at least he's honest and can afford to lose.\n\nIt's quite clear to me through you salty posts that you lost more than you can afford.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctagv": [
        {
            "Parent ID": "t1_e2csx79",
            "Comment ID": "e2ctagv",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:08:49",
            "Upvotes": 1,
            "Text": "wow\n\nyou just seem to want to go out of your way to be rude and insulting to a fellow bitcoin user\n\nthats odd\n\ni wonder why you are so perturbed by those who say bitcoin is gonna keep going down hard? (which its been doing ALL of 2018, and shows no sign of even slowing down - in anything, the crash seems to be speeding up)\n\nanyway, no idea why that bothers you so.  I guess we'll never know\n\nhaha!\n\nbut, heres some friendly advice from a fellow member of r/bitcoin\n\n\"Be Polite and Friendly, and your experience here on r/bitcoin will be more pleasant for you, and for all of us\"\n\nAs for selling my\"leftover coins\"\n\nLOL\n\nI have the same number of bitcoins, its just that their value has gone down (you do know how this whole bitcoin thing works, right?)  I haven't sold any yet, and I'll just hold on to them just in case.\n\nIts not THAT much money, so even though I am pretty sure they'll go to zero, at this point, i'll just ride it out and HOLD, just in case it does somehow go up in value again.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctglf": [
        {
            "Parent ID": "t1_e2ct4sc",
            "Comment ID": "e2ctglf",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:11:53",
            "Upvotes": 1,
            "Text": "oh, thanks u/JW4974\n\nwell, if thats what he is, and what he does, and if he's just fueled by angry and hatred, then his comments make sense.\n\ni mean, not \"sense\" as in they're logical, but if he is just an angry troll, then his mindless insults make sense (as thats the sort of things a troll does do).\n\nthanks for clarifying!!!\n\n:) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cttv7": [
        {
            "Parent ID": "t1_e2ct4sc",
            "Comment ID": "e2cttv7",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:18:42",
            "Upvotes": 1,
            "Text": "Troll calling another one a troll. Funny.  I stop because your arguments leads to nowhere most of the time since you are always in your echo chamber of retail payments.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cuyqg": [
        {
            "Parent ID": "t1_e2ctr4f",
            "Comment ID": "e2cuyqg",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:39:56",
            "Upvotes": 1,
            "Text": "> be humble\n\nsorry, but i have a tremendous amount of healthy self-respect\n\nas such, even if i wanted your advice (i'll politely decline) i would never take advice or guidance from someone who has been rude to me.\n\nI do wish you the best in trying to get other people to listen to you, I (regrettably) will not be one of those people\n\n...but best to you, peace!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d93dk": [
        {
            "Parent ID": "t1_e2d8pik",
            "Comment ID": "e2d93dk",
            "Author": "[deleted]",
            "Date Created": "07-14-2018 04:49:07",
            "Upvotes": 1,
            "Text": "> you fuckwit\n\nwe talk about the actual issues, like BTC and crypto assets\n\nwe don't personally insult each other.\n\nstop breaking the rules\n\nand as for saying things like \"gtfo somewhere else with your fud\"\n\nno FUD?\n\nLOL\n\nsorry, pal\n\nALL opinions are allowed on here, not just people who blindly say \"to the moon\"\n\nhahaha\n\nseriously, you need to learn tolerance!\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cv997": [
        {
            "Parent ID": "t1_e2cubj1",
            "Comment ID": "e2cv997",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:45:29",
            "Upvotes": 1,
            "Text": "Users are in control not miners. Let them try a 51% attack and see how fast everyone would make their asics useless. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d4k9n": [
        {
            "Parent ID": "t1_e2d3qdd",
            "Comment ID": "e2d4k9n",
            "Author": "JW4974",
            "Date Created": "07-14-2018 02:18:12",
            "Upvotes": 1,
            "Text": "Lol!  Ok, newbie.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2csd4f": [
        {
            "Parent ID": "t1_e2cs0ox",
            "Comment ID": "e2csd4f",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 21:51:29",
            "Upvotes": 1,
            "Text": "agreed\n\nits had its ups and down when it wasn't worth much\n\nbut once it spiked at 20K, people took their money\n\nand the wiser ones looked into it for real\n\nunder scrutiny, it was obvious that it was based on nothing\n\nand so the slow decent into nothing begins\n\nall of 2018 has been a crash, with no end in sight\n\nits just down, down, down\n\nwhere will it stop?\n\ni don't know.\n\nmy guess?\n\nmaybe about $2000 by end of 2018",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2colcf": [
        {
            "Parent ID": "t1_e2cnlm0",
            "Comment ID": "e2colcf",
            "Author": "JW4974",
            "Date Created": "07-13-2018 20:41:01",
            "Upvotes": 1,
            "Text": "Go learn more about fintech if you are really keen.  Cryptos are just a fringe movement and frankly, the butt of many jokes in the industry.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dm4mn": [
        {
            "Parent ID": "t1_e2dlgrz",
            "Comment ID": "e2dm4mn",
            "Author": "OliveTBeagle",
            "Date Created": "07-14-2018 10:54:33",
            "Upvotes": 1,
            "Text": "That's a fine retort for this era son.  You are right in line with the general tenor of what passes for discourse and discussion these days!\n\nGood job, good effort!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cv0gu": [
        {
            "Parent ID": "t1_e2ctagv",
            "Comment ID": "e2cv0gu",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:40:50",
            "Upvotes": 1,
            "Text": "You mentioned scam. It's not and there are many evidence to support why it's not. I'm not upset about the bear-market like you are and going about saying scam scam scam. If you are only not worried with your portion and going to ride it out, why the shitpost?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cugof": [
        {
            "Parent ID": "t1_e2ctglf",
            "Comment ID": "e2cugof",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:30:31",
            "Upvotes": 1,
            "Text": "You're the one that seems angry calling it a scam without any supporting evidence for couple of days. I know it's hard to lose 60% when you fomo in near the high but if you ask properly, many would be able to help educate you on why Bitcoin is here to stay and why we think there's more upside than downside in the long-term.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2ctz4i": [
        {
            "Parent ID": "t1_e2cttv7",
            "Comment ID": "e2ctz4i",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:21:23",
            "Upvotes": 1,
            "Text": "BTC = Digital token + Broken transacting system that can't scale.\n\nWhich one do you want to talk about?  Digital token?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cw5xg": [
        {
            "Parent ID": "t1_e2cuyqg",
            "Comment ID": "e2cw5xg",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 23:03:05",
            "Upvotes": 1,
            "Text": "No hard feelings here. Hope your weekend goes well. I hope you don't fall for actual scams aka 99% of shitcoins out there in the future. :)\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cvrqy": [
        {
            "Parent ID": "t1_e2cv997",
            "Comment ID": "e2cvrqy",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:55:21",
            "Upvotes": 1,
            "Text": "It's quite clear that you have no clue what a 51% attack will do to BTC.  Users in control?  LOL!  \n\n51% attack will allow them to halt transactions and allow them to conduct transactional reversals and double spend.\n\nNow couple that with the fact that the Chinese also owns 90% of the BTC trading on their exchanges.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0esf": [
        {
            "Parent ID": "t1_e2colcf",
            "Comment ID": "e2d0esf",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:32:17",
            "Upvotes": 1,
            "Text": "sigh, you are so lame.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cveoi": [
        {
            "Parent ID": "t1_e2cv0gu",
            "Comment ID": "e2cveoi",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:48:23",
            "Upvotes": 1,
            "Text": "> You mentioned scam.\n\nyes i did\n\nbitcoin itself isn't the scam\n\nbut there are whales and syndicates that pump and dump, and manipulate the price\n\nso... its a VERY shady marketplace\n\nonce people realize what a crooked system it is, they won't want to deal with it (especially with so many people losing so much - basically anyone who bought in late 2017 or all of 2018 has lost money - who wants to deal with that?)\n\nRegular people don't want to deal with such a shady and heavily manipulated marketplace\n\nso, i think the bottom will drop out even more (its already down 70%) until its down to near nothing.  There will be something better, but for the moment, BTC and similar is all we have, and it sucks!\n\nfuck btc\n\nIts just a big money loser, and just because some earlier adopters made money, doesn't mean it doesnt suck now\n\nbecause.. heres a clue for ya, btc sucks now, and most of us who bought in when it was a \"big deal\" hate it now, and almost no one new wants to come into a marketplace thats lost 70% of its value in just under 7 months \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cuq52": [
        {
            "Parent ID": "t1_e2cugof",
            "Comment ID": "e2cuq52",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 22:35:26",
            "Upvotes": 1,
            "Text": "there is a difference between being critical of bitcoin (which I did) and being critical and personally insulting fellow users of r/bitcoin (which you did)\n\nplease understand that sharing a variety of opinions on bitcoin (good and bad) is what we do here\n\nbitcoin is a made up thing, you don't need to rush to it's rescue every time someone is critical of bitcoin\n\nif you think bitcoin is great, and i think it sucks, thats OK.  More than one opinion is allowed on here\n\nafter all, being tolerant of more than just one opinion or point of view is a more enlightened way to be.\n\nI hope you are able to be more accepting and loving towards your fellow r/bitcoin users on here, without feeling any need to ever insult those of us who do not have much faith in bitcoin\n\nthank you for your consideration in what is hopefully our shared goal of an even better bitcoin subreddit!!!\n\n:)\n\np.s. As for you saying...\n\n>why we think there's more upside than downside in the long-term.\n\nsome on here feel there is more upside, some feel bitcoin is crashing hard never to re-cover.  Its not just ONE opinion that exists on here! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cvgpf": [
        {
            "Parent ID": "t1_e2cugof",
            "Comment ID": "e2cvgpf",
            "Author": "JW4974",
            "Date Created": "07-13-2018 22:49:28",
            "Upvotes": 1,
            "Text": "Let's see ..... 90% of trading on shady Chinese exchanges with no addresses and 60% of trades using Tether, which is from a company that refused to be audited.\n\nOf course it's not a scam.  It's \"safe money\".  LMFAO :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cuaa8": [
        {
            "Parent ID": "t1_e2ctz4i",
            "Comment ID": "e2cuaa8",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 22:27:11",
            "Upvotes": 1,
            "Text": "Can't scale? wtf you talking about? We solve scaling drama last year already. If you think all payments should be done on base layer, then please go to BCash as their community and roadmap is more suited for you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2czoql": [
        {
            "Parent ID": "t1_e2cvrqy",
            "Comment ID": "e2czoql",
            "Author": "tofuspider",
            "Date Created": "07-14-2018 00:15:55",
            "Upvotes": 1,
            "Text": "so pow change. Miners don't change the rules but user does. Any user can be a miner. Where were you last year during the 2 year scaling drama? I thought everyone knew this already about users are in control. If you think miners should be in control, BCash is your place.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2czwdf": [
        {
            "Parent ID": "t1_e2cvrqy",
            "Comment ID": "e2czwdf",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 00:20:38",
            "Upvotes": 1,
            "Text": "That's been addressed by a new protocol to assign the reward. See how out of the loop you are? Get schooled in crypto and come back.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0w86": [
        {
            "Parent ID": "t1_e2d0esf",
            "Comment ID": "e2d0w86",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:43:14",
            "Upvotes": 1,
            "Text": "Well, it is unfortunately true.\n\nI can understand you being in denial, it is ok.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cxu8e": [
        {
            "Parent ID": "t1_e2cveoi",
            "Comment ID": "e2cxu8e",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 23:36:43",
            "Upvotes": 1,
            "Text": "I see it more of a liquidity problem than manipulation (i'm sure there is some but not like every whale is on a united front to pump and dump at the same time) and over time that would resolved itself with better and more secure and transparent exchanges that the market prefers than the shady ones. All part of price discovery in the early stages.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cwey2": [
        {
            "Parent ID": "t1_e2cuq52",
            "Comment ID": "e2cwey2",
            "Author": "tofuspider",
            "Date Created": "07-13-2018 23:08:04",
            "Upvotes": 1,
            "Text": "So why do you consider it an obvious scam? You still haven't answer that yet. I don't mind your opinions but screaming scam without a followup (if you think it's greater fool theory,etc) just portrays you as troll initially even though you're not one. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0dup": [
        {
            "Parent ID": "t1_e2czoql",
            "Comment ID": "e2d0dup",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:31:43",
            "Upvotes": 1,
            "Text": "Funny.\n\nYou guys bragged about the \"huge investments in hash power\" all the time and now claim that users can take back control?  \n\nYou and I know very well that is bullshit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d0gei": [
        {
            "Parent ID": "t1_e2czwdf",
            "Comment ID": "e2d0gei",
            "Author": "JW4974",
            "Date Created": "07-14-2018 00:33:18",
            "Upvotes": 1,
            "Text": "Oooooooooooh.\n\nPlease enlighten all of us on how a \"new protocol to assign the reward\" can address a 51% attack.\n\nIt's ok for you not to respond as you clearly have no clue what you are talking about.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d34bq": [
        {
            "Parent ID": "t1_e2d0w86",
            "Comment ID": "e2d34bq",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 01:38:20",
            "Upvotes": 1,
            "Text": "You agree that you're lame? Great. Let's call it a day. If there's a way to revisit in 5 years I'd be happy to send you a 'I told you so' message, but I'm saying it now in advance.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2cwly4": [
        {
            "Parent ID": "t1_e2cwey2",
            "Comment ID": "e2cwly4",
            "Author": "[deleted]",
            "Date Created": "07-13-2018 23:11:58",
            "Upvotes": 1,
            "Text": ">bitcoin itself isn't the scam\nbut there are whales and syndicates that pump and dump, and manipulate the price\n\n>so... its a VERY shady marketplace\n\n>once people realize what a crooked system it is, they won't want to deal with it (especially with so many people losing so much - basically anyone who bought in late 2017 or all of 2018 has lost money - who wants to deal with that?)\n\n>Regular people don't want to deal with such a shady and *heavily manipulated* marketplace",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d2deu": [
        {
            "Parent ID": "t1_e2d0gei",
            "Comment ID": "e2d2deu",
            "Author": "tofuspider",
            "Date Created": "07-14-2018 01:19:05",
            "Upvotes": 1,
            "Text": "you haven't heard of betterhash in development? Guess we know who is the clueless one.\n\nLink : https://www.ccn.com/betterhash-bitcoin-core-dev-proposes-new-protocols-to-decentralize-bitcoin-mining/\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d49ly": [
        {
            "Parent ID": "t1_e2d0gei",
            "Comment ID": "e2d49ly",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 02:09:44",
            "Upvotes": 0,
            "Text": "Sure! ..First of all, a 51% attack is 'possible' but not probable. You can't take anyone's money using a 51% attack, you can only spend your own. Plus it only takes one miner to refuse to accept any block that seems malicious.\n\nAs for the protocol, you won't find this on your news sources, it's from the Bitcoin Core Developers. Matt Corallo has proposed BetterHash to replace Statum, the current protocol. Instead of allowing the mining pool to decide who gets the work, the miners can pick and create their own blocks. There's a lot of technical details to this, and I'm not sure if you're serious or trolling. So honestly I am not sure you'd understand this ...not an insult, most people don't.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d3q01": [
        {
            "Parent ID": "t1_e2d34bq",
            "Comment ID": "e2d3q01",
            "Author": "JW4974",
            "Date Created": "07-14-2018 01:54:42",
            "Upvotes": 1,
            "Text": "You obviously have a language comprehension problem.\n\nAlright, since you hardly understand the topic, let's call it a day.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d3n6v": [
        {
            "Parent ID": "t1_e2d2deu",
            "Comment ID": "e2d3n6v",
            "Author": "JW4974",
            "Date Created": "07-14-2018 01:52:31",
            "Upvotes": 1,
            "Text": "\"Development\" ..... lol, is this the best you can do?\n\nAnd the concept is already obsolete before it can even be implemented.  Let me give you a clue - centralised ownership of mining farms.  The two largest pools (btc.com and antpool) are both controlled by Bitmain.\n\nGone are the days when it's truly decentralised and mined by users.  It's now a business and owned by the Chinese.\n\nTry not to call someone clueless unless you know what you are talking about.  Otherwise, you end up making an ass of yourself.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d4ssx": [
        {
            "Parent ID": "t1_e2d49ly",
            "Comment ID": "e2d4ssx",
            "Author": "JW4974",
            "Date Created": "07-14-2018 02:25:04",
            "Upvotes": 1,
            "Text": "Oh please .... BetterHash works for public pools.  But when pools are centrally owned such as Bitmain, it's useless.\n\nPoW change as tofuspider suggested?  Try doing another fork and see how fast an organization like Bitmain, with plenty of resources, can adapt.\n\nThe point is - there is little that is unique to a large group of decentralised users that cannot be replicated into a central pool controlled by a single business entity.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d41ir": [
        {
            "Parent ID": "t1_e2d3n6v",
            "Comment ID": "e2d41ir",
            "Author": "tofuspider",
            "Date Created": "07-14-2018 02:03:27",
            "Upvotes": 0,
            "Text": "Are you always so impatient? Development takes time with security as priority.\n\nOnce again, if you hate it so much and it failed in mining and retail adoption, why still in this sub if you see no future for it?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dl3ym": [
        {
            "Parent ID": "t1_e2d4ssx",
            "Comment ID": "e2dl3ym",
            "Author": "cryptogrip",
            "Date Created": "07-14-2018 10:36:16",
            "Upvotes": 1,
            "Text": "Public school? Wha? What are you smoking? You are literally trying to regurgitate portions of information that you squandered from God knows where and make it sound like you understand this stuff. Ha ha this is hilarious!!!\nThis time, you've really shown you have no clue at all. I could accept that you accused me of watching gurus on Youtube or whatever shit you were going with there, because that seems to be something you do. But for you to assume you know more than anyone who spends day in day out reviewing blockchain code is .... is nothing less than insanity, and you should really go back to whatever it is that you may have some limited comprehension of.\nHa ha ha ha my God I'm still laughing at that last comment. You cant even grasp the difference between owning 51% hardware and a 51% attack. Do you even understand what the scare tactics media are referring to when they release the shit articles you've been reading about a 51% attack?? Have you ever written a line of code in your life? \nAnyway this got to stop before I start thinking everyone out there is a non technical as you.\nLater man .... troll the little reddit section all you want. I am now convinced that anyone who could be possible naive enough to hold ANY ounce of weight in your FUD comments are not needed in this community yet anyway.\nYou should message direct Matt Corallo or Jimmy Song and give them your input on 51% attacks. They could use a good laugh, ha ha ha ha ha.",
            "Edited?": "07-14-2018 10:41:03",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2d4g4t": [
        {
            "Parent ID": "t1_e2d41ir",
            "Comment ID": "e2d4g4t",
            "Author": "JW4974",
            "Date Created": "07-14-2018 02:14:53",
            "Upvotes": 1,
            "Text": "Impatient?  That's rather weird coming from a person who claimed that BTC is \"sound money\" and users are in charge when they aren't.\n\nThe entire concept of decentralisation sounds good on paper but it's not implementable when there's real money involved.  PoW change?  How long do you think it will take for a company with plenty of resources like BitMain to adapt?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "e2dndac": [
        {
            "Parent ID": "t1_e2dl3ym",
            "Comment ID": "e2dndac",
            "Author": "JW4974",
            "Date Created": "07-14-2018 11:16:24",
            "Upvotes": 1,
            "Text": "Sigh ....\n\nWhen you control 51% of the hash power, you can build a longer chain that includes corrupted block (including removing a transaction) and replace the blockchain with yours.  Is it that difficult to understand?\n\nAs for BetterHash, the distribution of work and pool becomes irrelevant in a private pool where both the pool operator and miners belong to the same entity.\n\nLol ... technical?  Like I said, if you think crypto is cutting edge tech, you are way way out of depth. \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}