{
    "ehkjw8e": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehkjw8e",
            "Author": "diydude2",
            "Date Created": "03-01-2019 13:25:08",
            "Upvotes": 9,
            "Text": "Somebody is really fighting hard to keep the price under 3850.  They must have a contract that gets rekt at that level.  Sucks to be them.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjou0e": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehjou0e",
            "Author": "Jurre182",
            "Date Created": "03-01-2019 06:11:03",
            "Upvotes": 12,
            "Text": "Does anyone in here think we will still go up 100% from where we are now?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjve0s": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehjve0s",
            "Author": "Sumo_Bro",
            "Date Created": "03-01-2019 08:21:36",
            "Upvotes": 9,
            "Text": "People always ask me \"What's up with Bitcoin? What's gonna happen with those Bitcoins?\" Like Bitcoin is some giant coming down from the mountain to chill out with us little people. I say, Bitcoin is basically the people. Bitcoins is you and me. So instead of asking how Bitcoin is doing, I say how are you doing? How are the people doing? If we're all doing okay, Bitcoin is gonna be okay. If we're all spaced out and babbling about BAKKT lambo moons, that's how Bitcoin is gonna be.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjm0cn": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehjm0cn",
            "Author": "laninsterJr",
            "Date Created": "03-01-2019 04:59:38",
            "Upvotes": 3,
            "Text": "4k today? 8B vol.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkm9ku": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehkm9ku",
            "Author": "jv596",
            "Date Created": "03-01-2019 13:50:22",
            "Upvotes": 3,
            "Text": "Hi. I have a question about paper wallets.\n\nIf u create a paper wallet offline with an OS like win xp and much later u connect the comp again, are there any risks for that paper wallet that was created time ago?\n\nthx!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkq5l6": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehkq5l6",
            "Author": "whalecheetah",
            "Date Created": "03-01-2019 14:33:35",
            "Upvotes": 7,
            "Text": "Does anyone else just enjoy the hell out of tormenting the bch people? \n\nIs it just me? Somehow it brings me Joy by reminding them that their scam coin has lost 96% of its value and continues downtrending\n\nohh...a new message appears \"You've Been Banned From Participating In R/Btc\"\n\nguess they didn't like me pointing out the 96% loss in value or saying i would lol if someone attacked roger at one of his little scam meetups \n\nimo these people are just walking trashcans\n\n\n",
            "Edited?": "03-01-2019 15:05:49",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjg9xy": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehjg9xy",
            "Author": "Tricky_Troll",
            "Date Created": "03-01-2019 02:36:36",
            "Upvotes": 2,
            "Text": "Hey again r/Bitcoin!\n\nI'm still in need of some more participants for the Reddit Cryptocurrency Survey since the data set is still a little bit too small to use right now. So if you haven't yet, do your part for the crypto community and please fill out the survey.\n\n**If you wish to participate, you can do so here:** https://docs.google.com/forms/d/e/1FAIpQLScmIGfTngk1Iw5v5FskYVEcmzoMnSuIvM-rqnwFMCKC9bR7Jw/viewform?usp=sf_link\n\nIf you'd like to see the results of my previous survey, you can find them here: https://www.reddit.com/r/ethtrader/comments/848roh/the_noobening_did_the_cryptocurrency_community/\n\nThank you very much to everyone who participates. I'll be back here to share the results with you in a few weeks. I'm looking forward to sharing the results with you all!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehk14m5": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehk14m5",
            "Author": "50kent",
            "Date Created": "03-01-2019 09:40:55",
            "Upvotes": 2,
            "Text": "Hey newb question here but I’m panicking a little. I bought some btc in Coinbase the other day. It became available today, so I opened my electrum wallet (on a desktop computer), scanned the QR receiving address (using the Coinbase app on my phone), and sent it. Normally within 30 seconds or so electrum would show me the pending incoming coin, but I’m not seeing that now. Coinbase still says Pending like it normally would, but did I make some dumb mistake? Or am I just panicking over nothing? Thanks",
            "Edited?": "03-01-2019 09:44:04",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehld5mn": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehld5mn",
            "Author": "GrouchyEmployer",
            "Date Created": "03-01-2019 19:07:48",
            "Upvotes": 2,
            "Text": "OK bitcoin fan fiction #1 \n\nRV is contacted by the highest ranking officials in the chinese govt, and offered 1 billion dollars to help kill bitcoin. RV plays along the whole time, fumbles everything on purpose, btc community calls him judas, while he sabotages china coin on purpose, turns out he really was bitcoin jesus. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlf9dj": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehlf9dj",
            "Author": "diydude2",
            "Date Created": "03-01-2019 19:36:39",
            "Upvotes": 2,
            "Text": "Ah, Dumpy The Bearwhale never tires of giving his money away, I see. God love 'im.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlo9i0": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehlo9i0",
            "Author": "j00cy_",
            "Date Created": "03-01-2019 21:44:56",
            "Upvotes": 2,
            "Text": "I've been out of the loop with the crypto community for a while, but I've recently been made aware that there are a bunch of people who think that bitcoin shouldn't be used for transactions, and instead it's only a \"store of value\".\n\nSorry but this is some of the dumbest shit I've ever heard. Bitcoin doesn't have value unless it's used for transactions, that's what it's useful for. Where do you think the value actually comes from? Does it come from hype? That's called a bubble.\n\nI think this kind of thinking is due to the hodl meme. I'm sorry to break this to you, but the only people who are now rich due to bitcoin investment are people who adopted it back in 2009-2011 (usually to buy drugs from Silk Road). You're like a decade late to the party, this isn't a get rich quick scheme. Crypto has a bright future, but that future is going to be in newer coins. Satoshi's white paper was revolutionary, but the technology has progressed greatly since then. \n\nAlso, you don't know how to invest if you think that holding on to any particular asset while the price drops is a good idea.\n\nI had to get that off my chest. Downvote me if you want.",
            "Edited?": "03-01-2019 21:49:10",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlfk94": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehlfk94",
            "Author": "Crypdoc",
            "Date Created": "03-01-2019 19:40:54",
            "Upvotes": 1,
            "Text": "Hey guys super new here. Im looking into getting in on Bitcoin. Is it worth it? even if I cant purchase 10% of a single coin? Do i need a lot of money on the side to benefit? or can I just buy a few dollars every now and then? Please direct me somewhere for total noobs if it exists. Thank you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehm3ijo": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehm3ijo",
            "Author": "tommygunz007",
            "Date Created": "03-02-2019 02:12:19",
            "Upvotes": 1,
            "Text": "Time for my weekly Q&A to help me understand Bitcoin.\n\nIf you say 'Clearly you don't understand bitcoin sheesh' and that's your only response, don't waste either of our time. \n\nSo, here it goes. \n\nBitcoin is a closed system. That means, that if everyone in the world converts, and ALL FIAT everywhere becomes bitcoin, it's essentially like living on an island. Let's call this Island, Jurassic Park. \n\n\nPART I:\nNow, on Jurassic Park, people on one side of the island, make $1 per hour, on the other, $5 per hour. I am using $ but assume it's BTC. Now, people making $1 are mad, so they get a little pissy, and want more. People making $5 say that the cost of living where they live means they NEED $5 per hour. What happens over time in this situation? Does it eventually all even out, where a labor hour is a labor hour, and so the richest paid countries will fall into the sea, and the poorest countries will suddenly make a lot more money? Or, on Jurassic Park, over time, everyone gets paid $2.50 per hour for their labor? This is awful for places like the UK but great for people in Mexico, China, etc. It spreads the wealth. \n\nPART II:\nNow, the thing the rich Bitcoin owners want, is cheap labor. So, they want to pay the least per hour, and make the most, so they keep on inching up the prices at their McDonalds. As McDonalds increases their prices, so does the  landlord, so does the super market. The pay actually flat-lines, but the overall cost of living goes up. This actually makes it much worse for the people. The business owners keep on raising and raising. The workers keep making less and less. It's a system that is intentionally rigged in the favor of businesses. Bitcoin doesn't change that fact. The game is rigged. \n\nPart III:\nCan you explain to me, the devaluation of say, American currency, and how would that be any different on Jurassic Park? Like say we swapped dollars for Bitcoin. The people in charge are still in charge (Business Owners) and they can charge whatever they want, and pay whatever they want (minimum wage). How does 'devaluation' work exactly?\n\nPart IV:\nTransitioning from a fiat to a bitcoin, if you are rich, you can just buy up almost all the bitcoin. Then what happens? How is that any different from what is happening now? \n\nFor instance, let's say, that you could take a snapshot of the globe right now. One USD = .75 GBP = One Euro (hypothetically). In this scenario, in this snap shot, let's say we replace ALL currencies with Bitcoin. Like this: One USD = X Bitcoin = .75 GBP = One Euro. In this scenario we basically have swapped out all currency for Bitcoin in this snapshot of time. Now, let's move the clock forward one year, and I bet that the prices of everything go up thanks to business owners, people's pay goes down, and that the currency swap is probably the same relatively. My point is, if you took all the global currency, and matched it to bitcoin, what do you expect to see happen in the future? Is it that the world market will shift, and say, the USD falls but the Yen goes up? The theory is that in the case of Hodlers, if you are in the US you make money, in the case of China you lose money. In the end however, those with the most money, whether it's bitcoin or gold or fiat, will still have the power to enslave everyone else. \n\nThe question I really have, is that so many people here shout all these benefits. And yet, the rich still get richer, whether they buy 50% of the Bitcoin or not. The Winklevoss Brothers will always have more than me, weather it's fiat, gold, or BTC. The only difference is that on the world scale, the Winklevoss Twins would be king if they cornered the market on bitcoins no?\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjtfy0": [
        {
            "Parent ID": "t3_aw1v1w",
            "Comment ID": "ehjtfy0",
            "Author": "PumperDumperr",
            "Date Created": "03-01-2019 07:50:22",
            "Upvotes": -1,
            "Text": "Push me to the edge\nAll my coins are dead\nPush me to the edge \nAll my coins are dead",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlqfh0": [
        {
            "Parent ID": "t1_ehkjw8e",
            "Comment ID": "ehlqfh0",
            "Author": "bitcoinfloridagator",
            "Date Created": "03-01-2019 22:16:41",
            "Upvotes": 1,
            "Text": "Weekend pump coming! and the next time we start with a 4, we won’t start with a 3 again until $30,000",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkyhbn": [
        {
            "Parent ID": "t1_ehkjw8e",
            "Comment ID": "ehkyhbn",
            "Author": "1561KWP",
            "Date Created": "03-01-2019 16:07:42",
            "Upvotes": 1,
            "Text": "I've read that there are some who buy and hold until it goes up 10-15% then sell.  They've been doing this for cycles.  I'ven't any clue if this is real or the price just seems to fit.\n\nHow many btc's would it take to disrupt the market?  100? 1,000?  1,000,000?  Do you think it's even possible?  What if they fuck up one cycle.  Couldn't this break them?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehju04b": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehju04b",
            "Author": "paperraincoat",
            "Date Created": "03-01-2019 07:59:37",
            "Upvotes": 12,
            "Text": "If you’re ok with a 2-3 year timeframe, 10x from where we are now easy, possibly 20-30x just from the supply dynamics of the halvening alone. \n\n\nFor all the skeptics, I’ve been in this space since 2013, I heard all the same arguments and wailing and wringing of hands after the drop from $280 to $90, the drop from $1250 to $300, and now from $19,500 to $3500. Just be patient, bull runs are born from bear markets. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjuzyh": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehjuzyh",
            "Author": "cryptogrip",
            "Date Created": "03-01-2019 08:15:31",
            "Upvotes": 10,
            "Text": "Is there still anyone who thinks it's not? The question is not if, it's when. Will it go lower before it goes higher? Nobody knows any of this, but as long as the space continues to mature, the rise in bitcoin price seems inevitable. Double what it is now? Pfffft, that's just chump change compared to where this is headed.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjw4ca": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehjw4ca",
            "Author": "godlypiggy",
            "Date Created": "03-01-2019 08:32:27",
            "Upvotes": 5,
            "Text": "yes here",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehk23m3": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehk23m3",
            "Author": "b_unky",
            "Date Created": "03-01-2019 09:52:56",
            "Upvotes": 4,
            "Text": "In due time, yes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkq73k": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehkq73k",
            "Author": "The-Physicist",
            "Date Created": "03-01-2019 14:34:04",
            "Upvotes": 4,
            "Text": "More like 3,000% ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjtr0i": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehjtr0i",
            "Author": "HvdTillaart",
            "Date Created": "03-01-2019 07:55:33",
            "Upvotes": 3,
            "Text": "Well, I hope so, and given the developments in bitcoin and the crypto space in general, I think the price is more likely to be higher than lower in 5-10 years.\nBut still, it's impossible to value bitcoin properly. I just hope the price follows previous patterns and gives us at least a bit of insight in the value of the protocol in the long term. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl6wxz": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehl6wxz",
            "Author": "[deleted]",
            "Date Created": "03-01-2019 17:46:58",
            "Upvotes": 2,
            "Text": "Obviously people will be bias here but objectively it’s still a yes. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkj960": [
        {
            "Parent ID": "t1_ehjou0e",
            "Comment ID": "ehkj960",
            "Author": "diydude2",
            "Date Created": "03-01-2019 13:18:14",
            "Upvotes": 1,
            "Text": "We will, and it will happen fast.  \n\nThen we'll double again and again and again.  That's usually what happens after these big \"crashes.\"  Next time it \"crashes,\" it will be from 240K all the way down to 70K and jealous rubes and newbs the world over will be saying, \"Bitcoin is dead for sure this time!\"\n\nIs there anyone who still thinks Bitcoin will stop changing the lives of its grokkers for the better?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjyff7": [
        {
            "Parent ID": "t1_ehjve0s",
            "Comment ID": "ehjyff7",
            "Author": "YAKELO",
            "Date Created": "03-01-2019 09:04:34",
            "Upvotes": 16,
            "Text": "What the fuck did I just read",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkr2ph": [
        {
            "Parent ID": "t1_ehkm9ku",
            "Comment ID": "ehkr2ph",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 14:44:00",
            "Upvotes": 2,
            "Text": "not really. the more interesting question is why your connecting XP, you should nuke that PC and install tails.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkspv2": [
        {
            "Parent ID": "t1_ehkm9ku",
            "Comment ID": "ehkspv2",
            "Author": "[deleted]",
            "Date Created": "03-01-2019 15:02:34",
            "Upvotes": 1,
            "Text": "If you have any doubt what so ever in the integrity of the wallet, create a new wallet and move funds.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlfipd": [
        {
            "Parent ID": "t1_ehkm9ku",
            "Comment ID": "ehlfipd",
            "Author": "diydude2",
            "Date Created": "03-01-2019 19:40:17",
            "Upvotes": 1,
            "Text": "If you put a password on it and have a keylogger installed there might be some risk. \n\nIf you're doing it through a browser make sure you're in Privacy mode so you don't leave footprints in your browser history. And Firefox will be safest for this purpose. \n\nProbably nothing to worry about though.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlfbw2": [
        {
            "Parent ID": "t1_ehkq5l6",
            "Comment ID": "ehlfbw2",
            "Author": "diydude2",
            "Date Created": "03-01-2019 19:37:38",
            "Upvotes": 4,
            "Text": "Why waste your time on that? Let them do their thing and we'll focus on doing ours and everything will work out as it must.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlivkp": [
        {
            "Parent ID": "t1_ehkq5l6",
            "Comment ID": "ehlivkp",
            "Author": "click_again",
            "Date Created": "03-01-2019 20:27:21",
            "Upvotes": 3,
            "Text": "I am having a great time exposing the lies of bcashers.\n\nYou can take a look into my comments replies, all bcashers can't put forth a counter-argument when I call out their coin being a scam coin. Instead they always resort to personal attack and divert the topic of discussion.\n\nBcashers long know that bch can't be successful, not to mention overtaking Bitcoin. Yet they continue to fud along, hoping to mislead newcomers to buy their heavy bag.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkro0b": [
        {
            "Parent ID": "t1_ehkq5l6",
            "Comment ID": "ehkro0b",
            "Author": "vickar12",
            "Date Created": "03-01-2019 14:50:42",
            "Upvotes": 5,
            "Text": "Why would you be happy with people losing money unless you personally have experience of them doing bad things to you?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlr3s7": [
        {
            "Parent ID": "t1_ehkq5l6",
            "Comment ID": "ehlr3s7",
            "Author": "3DprintRC",
            "Date Created": "03-01-2019 22:26:51",
            "Upvotes": 2,
            "Text": "That's impossible. r|Btc doesn't censor.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjkesj": [
        {
            "Parent ID": "t1_ehjg9xy",
            "Comment ID": "ehjkesj",
            "Author": "SAT0SHl",
            "Date Created": "03-01-2019 04:19:19",
            "Upvotes": 10,
            "Text": "**NSA posting in** r/Bitcoin **repeatedly ....who would have known?**",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkqfqx": [
        {
            "Parent ID": "t1_ehjg9xy",
            "Comment ID": "ehkqfqx",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 14:36:47",
            "Upvotes": 2,
            "Text": "you will get more responses if it doesnt require signing in to a google account.\n\nhttps://productforums.google.com/forum/#!topic/docs/lF7f69XeV-M",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehk1xhx": [
        {
            "Parent ID": "t1_ehk14m5",
            "Comment ID": "ehk1xhx",
            "Author": "b_unky",
            "Date Created": "03-01-2019 09:50:55",
            "Upvotes": 4,
            "Text": "Likely a panic over nothing. I sent a transaction last night with the fee set to high and it had an estimated 20min confirmation time. I think it took half that time to even show pending on the receiving end. I think you’re okay.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlp81s": [
        {
            "Parent ID": "t1_ehld5mn",
            "Comment ID": "ehlp81s",
            "Author": "dabears041",
            "Date Created": "03-01-2019 21:58:41",
            "Upvotes": 1,
            "Text": "That or he’s an ego maniac that totally lost his grip on reality ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehltnjj": [
        {
            "Parent ID": "t1_ehlo9i0",
            "Comment ID": "ehltnjj",
            "Author": "AussieBitcoiner",
            "Date Created": "03-01-2019 23:06:07",
            "Upvotes": 2,
            "Text": ">there are a **bunch** of people who think that bitcoin shouldn't be used for transactions\n\nYep. But, many seem to think bitcoiners all share the same opinions and use bitcoin for the same reason.\n\nsome use bitcoin for speculation, some for storage of value, some use it as a currency. As Lightning matures, the currency aspect will improve significantly. the choice is up to everyone individually, it can't be dictated to them.\n\nif you have been out for that long, have a look into what's been happening with the Lightning network. Give it a go, even if only on a light LN wallet on your phone.",
            "Edited?": "03-01-2019 23:17:06",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlyzv9": [
        {
            "Parent ID": "t1_ehlo9i0",
            "Comment ID": "ehlyzv9",
            "Author": "Nursing_guy",
            "Date Created": "03-02-2019 00:38:46",
            "Upvotes": 2,
            "Text": "Store of value is ONE legitimate use of a currency. Wether it is the best one for you at the moment might only ever be understood in perfect hindsight.\n\nHODL is a meme-ification of the greater idea that most people aren't cut out for day trading, which a loose interpretation of your post would seem to advocate (are you a financial advisor btw? Are you a fiduciary?)\n\nThis isn't a get rich quick scheme. I agree with you there. It is better money. A niche I don't see new coins usurping. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehovsil": [
        {
            "Parent ID": "t1_ehlfk94",
            "Comment ID": "ehovsil",
            "Author": "Myngho",
            "Date Created": "03-03-2019 04:52:23",
            "Upvotes": 1,
            "Text": "Welcome. white paper is a good start..",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl4nzk": [
        {
            "Parent ID": "t1_ehkyhbn",
            "Comment ID": "ehl4nzk",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 17:19:03",
            "Upvotes": 3,
            "Text": "> I'ven't\n\n?? thats some serious contraction.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjux44": [
        {
            "Parent ID": "t1_ehju04b",
            "Comment ID": "ehjux44",
            "Author": "Jurre182",
            "Date Created": "03-01-2019 08:14:17",
            "Upvotes": 6,
            "Text": "Very Okay with it. I entered this time last year. From what i’ve seen I think the same way, but at the same time seen a lot of people lose interest",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkq6y2": [
        {
            "Parent ID": "t1_ehjuzyh",
            "Comment ID": "ehkq6y2",
            "Author": "Zarn520",
            "Date Created": "03-01-2019 14:34:01",
            "Upvotes": 1,
            "Text": "Me.  I think it's not.  I think that the last bull run was the result of hype, and now that the hype has dropped people are more aware and less willing to risk it.  That and the way bitcoin is largely treated as an asset and not a currency makes it less viable as either.  I think the best thing for bitcoin is if it can manage to stay stable for awhile and provide more utility as an actual currency.  \n\nAnd I'm aware this will get me downvoted to hell, but that comes with the territory on this sub.  Too many people here want the 10x growth comments out there to try to push new investors so they can get rich quick or make their money back from the last crash.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl5z7n": [
        {
            "Parent ID": "t1_ehkq73k",
            "Comment ID": "ehl5z7n",
            "Author": "biggunsg0b00m",
            "Date Created": "03-01-2019 17:35:18",
            "Upvotes": 2,
            "Text": "Sweet dreams are made of this",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehk0ie4": [
        {
            "Parent ID": "t1_ehjyff7",
            "Comment ID": "ehk0ie4",
            "Author": "CashMeYo",
            "Date Created": "03-01-2019 09:32:48",
            "Upvotes": 13,
            "Text": "Words from Buddha himself. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehjzt23": [
        {
            "Parent ID": "t1_ehjyff7",
            "Comment ID": "ehjzt23",
            "Author": "Sumo_Bro",
            "Date Created": "03-01-2019 09:23:26",
            "Upvotes": 5,
            "Text": "If you want to help out Bitcoin, start by helping yourself out. Go for some self-care, chill and read a good book, go out and buy a nice dinner. Don’t use Bitcoin to pay for it, regular money works perfectly fine.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehksa4w": [
        {
            "Parent ID": "t1_ehkr2ph",
            "Comment ID": "ehksa4w",
            "Author": "djulac",
            "Date Created": "03-01-2019 14:57:38",
            "Upvotes": 1,
            "Text": "TailsOS for the win!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkvoyx": [
        {
            "Parent ID": "t1_ehkr2ph",
            "Comment ID": "ehkvoyx",
            "Author": "redditHi",
            "Date Created": "03-01-2019 15:36:15",
            "Upvotes": 1,
            "Text": "What do you mean \"not really\" that's really bad advice. OP:  do not connect it to the internet.  Wipe the whole computer and shread the hdd data if you really need to reconnect it.  Never know what sort of malware, keylogger, etc. That is on that machine",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehmc2op": [
        {
            "Parent ID": "t1_ehlfipd",
            "Comment ID": "ehmc2op",
            "Author": "jv596",
            "Date Created": "03-02-2019 05:45:45",
            "Upvotes": 1,
            "Text": "thx! :)\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlizs6": [
        {
            "Parent ID": "t1_ehlivkp",
            "Comment ID": "ehlizs6",
            "Author": "whalecheetah",
            "Date Created": "03-01-2019 20:29:01",
            "Upvotes": 1,
            "Text": "Yep. 100% and if you stir them up too much you will get banned as to make sure their sub promotes the roger narrative. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehksuew": [
        {
            "Parent ID": "t1_ehkro0b",
            "Comment ID": "ehksuew",
            "Author": "whalecheetah",
            "Date Created": "03-01-2019 15:04:01",
            "Upvotes": 3,
            "Text": "well if someone backs bcash they aren't what i would consider people. i would consider them scammers, frauds, criminals",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlwpfi": [
        {
            "Parent ID": "t1_ehlr3s7",
            "Comment ID": "ehlwpfi",
            "Author": "whalecheetah",
            "Date Created": "03-01-2019 23:56:57",
            "Upvotes": 1,
            "Text": "Lol. I know right. The screen shot I could create of that ban must be somehow fabricated. \n\nActually you probably don't even need to do that they have open mod logs so you can see all the people they have been Banning. \n\nThen of course they get on video saying they never do that because they know most people aren't going to check and it fits their bullshit narrative.\n\nI mean is anyone really surprised scammers are not exactly honest?\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkwc5z": [
        {
            "Parent ID": "t1_ehkqfqx",
            "Comment ID": "ehkwc5z",
            "Author": "Tricky_Troll",
            "Date Created": "03-01-2019 15:43:32",
            "Upvotes": 1,
            "Text": "Yeah, I realise this, but one person could also make multiple fake responses much easier if I were to change that setting. I'd rather have less responses which I know are all over the risk of fake data.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehk4mve": [
        {
            "Parent ID": "t1_ehk1xhx",
            "Comment ID": "ehk4mve",
            "Author": "50kent",
            "Date Created": "03-01-2019 10:23:06",
            "Upvotes": 4,
            "Text": "Oof yeah you were right thanks so much",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlupx8": [
        {
            "Parent ID": "t1_ehlp81s",
            "Comment ID": "ehlupx8",
            "Author": "GrouchyEmployer",
            "Date Created": "03-01-2019 23:23:12",
            "Upvotes": 1,
            "Text": "...but that's not a fan fiction.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehm71r3": [
        {
            "Parent ID": "t1_ehl4nzk",
            "Comment ID": "ehm71r3",
            "Author": "1561KWP",
            "Date Created": "03-02-2019 03:37:39",
            "Upvotes": 1,
            "Text": "I try.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkj4fk": [
        {
            "Parent ID": "t1_ehjzt23",
            "Comment ID": "ehkj4fk",
            "Author": "diydude2",
            "Date Created": "03-01-2019 13:16:45",
            "Upvotes": 4,
            "Text": "Yup, buy regularly, check occasionally, live a good life with the knowledge that your ship is coming in within the next couple of years.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkgyyi": [
        {
            "Parent ID": "t1_ehjzt23",
            "Comment ID": "ehkgyyi",
            "Author": "shotty293",
            "Date Created": "03-01-2019 12:52:50",
            "Upvotes": 2,
            "Text": "WTF? I dont think you belong in this sub.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl5roo": [
        {
            "Parent ID": "t1_ehksa4w",
            "Comment ID": "ehl5roo",
            "Author": "biggunsg0b00m",
            "Date Created": "03-01-2019 17:32:40",
            "Upvotes": 1,
            "Text": "I'm never heard of it.. I'm going to have to go down a hole i think..",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkwtg5": [
        {
            "Parent ID": "t1_ehkvoyx",
            "Comment ID": "ehkwtg5",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 15:49:01",
            "Upvotes": 1,
            "Text": "a keyloggers not going to transmit a paper wallet. malware that does what exactly? creating a paper wallet offline doesnt store any data that can be transmitted later when the PC connects, assuming it was turned off and the cache was cleared.\n\neither way, i recommended to nuke it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl17p4": [
        {
            "Parent ID": "t1_ehksuew",
            "Comment ID": "ehl17p4",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 16:38:38",
            "Upvotes": 3,
            "Text": "each to their own, but people that use bcash are altcoiners, not scammers (unless they use the \"real bitcoin\" line)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl0mo5": [
        {
            "Parent ID": "t1_ehkwc5z",
            "Comment ID": "ehl0mo5",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 16:31:57",
            "Upvotes": 1,
            "Text": "thats up to you, I was just pointing out a reason why you might not get many responses, especially with a survey about crypto.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehlzu7z": [
        {
            "Parent ID": "t1_ehlupx8",
            "Comment ID": "ehlzu7z",
            "Author": "dabears041",
            "Date Created": "03-02-2019 00:54:20",
            "Upvotes": 1,
            "Text": "Yeah sorry I just impulse shat on rev forgetting that was fan fiction. I guess I can’t help myself. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkz2jg": [
        {
            "Parent ID": "t1_ehkwtg5",
            "Comment ID": "ehkz2jg",
            "Author": "jv596",
            "Date Created": "03-01-2019 16:14:21",
            "Upvotes": 1,
            "Text": "Hi. What if the paper wallet was in pdf? could there be any issues?\n\n&#x200B;\n\nthx for answering!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl1bhm": [
        {
            "Parent ID": "t1_ehl17p4",
            "Comment ID": "ehl1bhm",
            "Author": "whalecheetah",
            "Date Created": "03-01-2019 16:39:52",
            "Upvotes": 5,
            "Text": "Well, let me just refer you to some of this. Take a read. It really goes far beyond them and their real Bitcoin propaganda. \n\nhttps://gist.github.com/chris-belcher/c9f4b90bec1b2fbf8caaab178719ac24\n\nSee what I mean? The leadership of bch are nothing more than common criminals. \n\nThere is a new generation of people coming into crypto and it bothers me when I see them being taken advantage of by this crowd \n\nI'm yet another person who has been banned from their subreddit and in all fairness I did troll the living shit out of them. However. It's the same way I would heckle a child molester if I saw him camping outside a kindergarten with a pair of binoculars. \n\nThey are predatory people ",
            "Edited?": "03-01-2019 16:44:42",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl8stw": [
        {
            "Parent ID": "t1_ehl17p4",
            "Comment ID": "ehl8stw",
            "Author": "46dcvls",
            "Date Created": "03-01-2019 18:10:33",
            "Upvotes": 6,
            "Text": "Bch is absolutely , beyond a doubt, a scam. Those who perpetuate this scam are scammers. \n\nBCH leadership has used their resources to launch an attack on all fronts. First they tried a fork attack, and when that didnt work they've spent their time misleading and misrepresenting Bitcoin to the media. Hijacking bitcoin media outlets and using them to confuse people , spreading outright lies about pretty much anything technical , and overall just purposefully creating confusion as well as delegitimizing the whole ecosystem with their used cars salesman antics.\n\nEveryone who owns Crypto is financially harmed by these scams.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehm0lr6": [
        {
            "Parent ID": "t1_ehlzu7z",
            "Comment ID": "ehm0lr6",
            "Author": "GrouchyEmployer",
            "Date Created": "03-02-2019 01:08:55",
            "Upvotes": 1,
            "Text": "lol understandable. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehkzu87": [
        {
            "Parent ID": "t1_ehkz2jg",
            "Comment ID": "ehkzu87",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 16:23:05",
            "Upvotes": 1,
            "Text": "if its still in pdf on the PC DO NOT CONNECT IT.\n\ncheck that the BTC is still there on a block explorer like https://www.smartbit.com.au/ then write the keys down. delete the pdf, install and run ccleaner (and while youre at it install and run malware bytes)\n\nHonestly youre better off nukeing it and installing Tails. https://tails.boum.org/ because XP is too old now and really shouldnt be online.\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl16tq": [
        {
            "Parent ID": "t1_ehkzu87",
            "Comment ID": "ehl16tq",
            "Author": "jv596",
            "Date Created": "03-01-2019 16:38:22",
            "Upvotes": 1,
            "Text": "hi. the pdf wasnt in the pc. Just a direct access in recent documents that couldnt be opened cause the file wasnt there. Just wanted to know if the os could read the file anyway while has been connected.\nthank u!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ehl3cpp": [
        {
            "Parent ID": "t1_ehl16tq",
            "Comment ID": "ehl3cpp",
            "Author": "time_wasted504",
            "Date Created": "03-01-2019 17:03:24",
            "Upvotes": 1,
            "Text": "> if the os could read the file anyway\n\nif the pdf file isnt on the HDD (run ccleaner to be sure) there is no way it can be read.\nAgain, install and run malwarebytes before connecting but the real question is WHY you want to put this old computer online.\n\nhttps://www.ccleaner.com/ccleaner/download\n\nhttp://www.oldapps.com/malwarebytes.php?system=Windows_XP\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}