{
    "ef9njko": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef9njko",
            "Author": "Takoyami",
            "Date Created": "01-29-2019 10:33:23",
            "Upvotes": 6,
            "Text": "The amount of bitcoin these days one can buy with fiat is dwindling so much compared to a few years ago. If you are investing at the current bitcoin price one bitcoin would take let's say $3500 USD to acquire as an example. Compared to a few years ago one could have bought one bitcoin for let's say $200 USD.\n\nIs it time we actually start pricing in satoshi/something with a smaller denomination? Imagine telling the average Joe to buy one share of Berkshire Hathaway class A. There is no way they can do it and it sounds absurd. Companies do stock splits all the time to make shares more available to the investor. I am aware bitcoin is divisible thus people won't need to buy one whole coin at a time, but will it reach the stage where we should switch to a smaller denomination that makes it sound easier to acquire?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef91lld": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef91lld",
            "Author": "hlwlkkax",
            "Date Created": "01-29-2019 05:29:28",
            "Upvotes": 10,
            "Text": "the oldest exchange in Canada(Quadriga) is filling for bankruptcy, citing they lost access to their cold wallet as their CEO died last month.   \n\n\nCan his ghost move the coins to another wallet in 5 years time without anyone noticing it. In other words can his ghost log-in, change the wallet address and move the funds to another wallet? And in general if the court can reveal the wallet's address is there a way to keep eyes on it?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef954e7": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef954e7",
            "Author": "AussieBitcoiner",
            "Date Created": "01-29-2019 06:47:17",
            "Upvotes": 4,
            "Text": "my LND autopilot has been using on-chain fees an order of magnitude higher to open new channels than what I've been using manually. Is there a way to alter the fee?\n\nI see there is an older PR for this here: [https://github.com/lightningnetwork/lnd/issues/886](https://github.com/lightningnetwork/lnd/issues/886) but it doesn't seem to be receiving much recent attention. have there been any other implementations?\n\nedit 2: only linked an open issue, the actual PR is here : [https://github.com/lightningnetwork/lnd/pull/984](https://github.com/lightningnetwork/lnd/pull/984)",
            "Edited?": "01-29-2019 07:10:24",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef8s0c6": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef8s0c6",
            "Author": "felloftree",
            "Date Created": "01-29-2019 02:21:52",
            "Upvotes": 9,
            "Text": "hello darkness, my old friend",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9t7qu": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef9t7qu",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 11:26:49",
            "Upvotes": 7,
            "Text": "I have a general question, if that's ok.  Looking at the price of one bitcoin, it now seems to be less in USD than it would cost to mine it.  Are people mining bitcoin at a loss right now, hoping that the price will go up?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef94p75": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef94p75",
            "Author": "Danny1878",
            "Date Created": "01-29-2019 06:37:51",
            "Upvotes": 3,
            "Text": "Say someone doesn't have a wallet, but you want to give them bitcoin - how do you do that?  Is it possible to give someone bitcoin on a piece of paper?   Like if I had a small coffee shop and someone paid $5 for a coffee, can i give $2 change in bitcoin by printing a QR code on the receipt?\n\n&#x200B;\n\nThen they can access it later, when they've downloaded a wallet?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef96zub": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef96zub",
            "Author": "HvdTillaart",
            "Date Created": "01-29-2019 07:21:45",
            "Upvotes": 3,
            "Text": "I am looking for some more critical / sceptical BTC news sources, to nuance all hype on reddit and the usual media outlets. They don't have to be anti-BTC, but I would like a rational and down-to-earth approach of the subject. Any ideas? Thanks in advance!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef93cke": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef93cke",
            "Author": "BitcoinAlways",
            "Date Created": "01-29-2019 06:06:30",
            "Upvotes": 5,
            "Text": "Does anyone here see an end to this bear market anytime soon? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9q82q": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef9q82q",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 10:58:49",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": "02-19-2021 11:03:00",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbft0m": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efbft0m",
            "Author": "cjohanneson38",
            "Date Created": "01-29-2019 20:31:11",
            "Upvotes": 2,
            "Text": "If bitcoin become the de facto currency in a country, couldn’t that government regulate it simply by tracking IP addresses while monitoring the blockchain? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efal0q3": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efal0q3",
            "Author": "flafel",
            "Date Created": "01-29-2019 15:32:09",
            "Upvotes": 4,
            "Text": "Hamas millitary wing invites supporters to fund it through Bitcoin. https://www.reddit.com/r/Bitcoin/comments/al4byf/alqassam_military_wing_of_hamas_palestine_invites/?utm_source=reddit-android",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9146d": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef9146d",
            "Author": "tayyab2233",
            "Date Created": "01-29-2019 05:19:07",
            "Upvotes": 2,
            "Text": "Is any one help me to invest which crypto currency is Best I think Bitcoin Is Best and Tell me Trusted Brokers",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb69hw": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efb69hw",
            "Author": "The-Physicist",
            "Date Created": "01-29-2019 18:55:59",
            "Upvotes": 2,
            "Text": "Received this in my inbox from the Gemini exchange that the Winklevoss Twins run.  I have to give them some credit for effort:\n\n&nbsp;\n&#x200B;\n>Hello,  \n>\n>&nbsp;\n>  \n>  \n>In 2018, Gemini engaged with Big Four auditor Deloitte & Touche LLP (Deloitte) to execute a SOC 2® - SOC for Service Organizations Type 1 examination. After months of preparation and an in-depth external review, we are pleased to announce that Gemini has successfully completed its SOC 2 Type 1 examination. This makes Gemini the ***world’s first cryptocurrency exchange and custodian to demonstrate this level of security compliance in protecting customer data and funds.***   \n>\n>&nbsp;\n>  \n>Providing you with a safe and secure platform to buy, sell, and store your cryptocurrency is paramount to our mission to ***build the future of money***. In the traditional financial and technology industries, SOC 2 reviews have become an industry standard for demonstrating security compliance. Our SOC 2 review — coupled with our digital asset insurance — is another step we’ve taken towards raising the bar for consumer protection, safeguards, and industry best practices.    \n>\n>&nbsp;\n> \n>Gemini’s exchange and custody platform was built with a “security-first” mentality from the start. Continuing that approach, Deloitte performed an independent evaluation of the design and implementation of Gemini's security controls. These controls have been independently inspected to meet the trust services criteria set by the American Institute of Certified Public Accountants (AICPA). This included a review of Gemini’s exchange application, infrastructure, and underlying customer database, as well as its institutional-grade cryptocurrency storage system that custodies the private keys of Gemini’s online and offline wallets.   \n>\n>&nbsp;\n>  \n>We feel strongly that this standard of compliance is what all retail and institutional consumers should expect of their cryptocurrency exchange and custodian. We know what’s at stake when you trade and store crypto. That is why, in addition to our SOC 2 Type 1 review, we are also committed to obtaining our SOC 2 Type 2 review in 2019. This additional level of assurance will further validate the effectiveness of our internal controls.  \n>\n>&nbsp;\n> \n>Going forward, we will perform a SOC 2 examination on an annual basis in order to demonstrate our ongoing commitment to safeguarding your data and cryptocurrency.   \n>\n>&nbsp;\n> \n>For questions, please reach out to [support@gemini.com](mailto:support@gemini.com).  \n>\n>&nbsp;\n>  \n>Onward and Upward,  \n>\n>&nbsp;\n> \n>Yusuf Hussain, Head of Risk\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef8qymc": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef8qymc",
            "Author": "SAT0SHl",
            "Date Created": "01-29-2019 02:04:57",
            "Upvotes": 4,
            "Text": "**Parity!** 1 $atoshi = 1 Dollar. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbn8sq": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efbn8sq",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 21:53:05",
            "Upvotes": 1,
            "Text": "Tis where we dine, they die.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efc1szz": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efc1szz",
            "Author": "[deleted]",
            "Date Created": "01-30-2019 01:02:57",
            "Upvotes": 1,
            "Text": "We need to pretend we don’t know what’s going on sometimes. A lot of whales and shitcoin starters out there that need to be watched. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efahrba": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efahrba",
            "Author": "joneyyy1981",
            "Date Created": "01-29-2019 15:01:55",
            "Upvotes": 1,
            "Text": "talking of the mining. am i an idiot, but how was people mining it when the price was $100 etc if it cost $3k to mine?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efapit0": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efapit0",
            "Author": "vegueria124",
            "Date Created": "01-29-2019 16:14:16",
            "Upvotes": 1,
            "Text": "Question...since there is no central authority, is there or will there ever be a mechanism to protect against human error in sending tokens (i.e. entering the wrong Bitcoin address)?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efax23g": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efax23g",
            "Author": "Guy_Incognito97",
            "Date Created": "01-29-2019 17:28:55",
            "Upvotes": 1,
            "Text": "Who here actually buys things with Crypto? And what do you buy?\n\nI first got some BTC because I thought it sounded interesting and I used it to buy Huel. They stopped accepting it and I don’t think I’ve used it for a purchase since. \n\nI’m going to try out purse.io but right now I don’t need anything off Amazon and I have some vouchers to use up. \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef983rd": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef983rd",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 07:38:25",
            "Upvotes": -2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaxm0h": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "efaxm0h",
            "Author": "reddit24680",
            "Date Created": "01-29-2019 17:34:04",
            "Upvotes": -4,
            "Text": "Whales and exchange bots are trying to keep this thing alive by poking it with fake orders and pumps every time volume decreases.  Don’t let them fool you into thinking that there is ANY interest left in bitcoin.  After the ETF withdrawal news came out, I stated that Van Exk was trying to save face by blaming it on the shutdown.  He’s a smart business man and is it to make money.  He knew there was no more interest left in bitcoin so he bailed.  AND the manipulation is so rampant in this market that he gave up.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef8yma1": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef8yma1",
            "Author": "wesred",
            "Date Created": "01-29-2019 04:27:45",
            "Upvotes": -4,
            "Text": "Can't Wait For bitcoin's quarterly report to showcase it's undervaluation\nOh Wait price movement is all rainbows and unicorns #nofundamentals",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9e3tq": [
        {
            "Parent ID": "t3_akxi9h",
            "Comment ID": "ef9e3tq",
            "Author": "dwyss9",
            "Date Created": "01-29-2019 08:53:14",
            "Upvotes": -6,
            "Text": "copied text from a guy from netherland:\n\n&#x200B;\n\nhere is my 2 cent about institutional money FORGET ABOUT IT\n\n \n\nthey cannot join the game because btc is beyond their manipalative controling instruments   \n\nThat is why btc will skip institutional step \n\n&#x200B;\n\nThe next step however is around the corner\n\nThe black Swan is already born but not been spotted YET \n\nLet me explain\n\n&#x200B;\n\nThe world central banks are all connected but olso divided in different camps you have the BIG3 players and the \n\nBIG5 dependants\n\n&#x200B;\n\nControled by BIS via IMF\n\nImagene all sitting around a table looking at btc their biggest thread But also their only alvation \n\n&#x200B;\n\nBIG3 players\n\nLonden and the yews have the spider network \n\nUsa and the arabs their petro dollar\n\nChina and russia gods money\n\n&#x200B;\n\nBig 5 dependance\n\nYapan\n\nEurope\n\nBrics\n\nSouth Amerika\n\nAfrika\n\n&#x200B;\n\nThe dependent 5 are up til now controlled by big 3 and \n\nWHEN not if the viat bullshit run its final course  \n\nMore printing will happen the big 3 players wil be defending their position and during that fight \n\n&#x200B;\n\nSouth Amerika will be the first that ambrace btc out off NEED\n\nAnd than the shit will hit the fan and every country  with some wealth LEFT  will be jumping on the reamaining scraps off btc",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbmtbt": [
        {
            "Parent ID": "t1_ef9njko",
            "Comment ID": "efbmtbt",
            "Author": "MrRGnome",
            "Date Created": "01-29-2019 21:48:32",
            "Upvotes": 2,
            "Text": "You don't need to convince anyone, just do it. There is the entire metric prefixed table of bitcoin units, you can change the display in most applications including Core. I do the exact opposite of you, I have been increasingly using sats and millisats. Culture spreads from use, not decree.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9o7le": [
        {
            "Parent ID": "t1_ef9njko",
            "Comment ID": "ef9o7le",
            "Author": "major_tennis",
            "Date Created": "01-29-2019 10:39:58",
            "Upvotes": 2,
            "Text": "I agree if 100,000 Satoshi\t= 0.00100000 ฿. Give it a name and say 1 Nakamoto = $3.5",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efau540": [
        {
            "Parent ID": "t1_ef9njko",
            "Comment ID": "efau540",
            "Author": "Eertgggddsdfg",
            "Date Created": "01-29-2019 17:00:17",
            "Upvotes": 0,
            "Text": "People want it to be decentralized so nothing happens. The stubborn libertarians think that every centralization is bad.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9hyzf": [
        {
            "Parent ID": "t1_ef91lld",
            "Comment ID": "ef9hyzf",
            "Author": "Goose506",
            "Date Created": "01-29-2019 09:36:52",
            "Upvotes": 8,
            "Text": "Absolute bullshit cover-up. No one who could breathe and walk would be dumb enough to not have multiple contingency plans just for this possibility.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef93o11": [
        {
            "Parent ID": "t1_ef91lld",
            "Comment ID": "ef93o11",
            "Author": "BitcoinAlways",
            "Date Created": "01-29-2019 06:13:34",
            "Upvotes": 8,
            "Text": "That's got to be bullshit imo  \n\nIt would be totally retarded if he was the only person who had access to it....",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef98fgp": [
        {
            "Parent ID": "t1_ef91lld",
            "Comment ID": "ef98fgp",
            "Author": "robotsdev",
            "Date Created": "01-29-2019 07:43:03",
            "Upvotes": 4,
            "Text": "If you find out the address anybody can keep track of it. That's the point.  \nBut unless they've made them public, then there is no real way to be 100% of that address.  \nI find it hard to believe that the CEO was the only one to access to those keys and didn't leave them anywhere else to be found in case of death.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9zo8b": [
        {
            "Parent ID": "t1_ef91lld",
            "Comment ID": "ef9zo8b",
            "Author": "MrRGnome",
            "Date Created": "01-29-2019 12:26:47",
            "Upvotes": 2,
            "Text": "I miss vault of satoshi.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef8yzb4": [
        {
            "Parent ID": "t1_ef8s0c6",
            "Comment ID": "ef8yzb4",
            "Author": "vickar12",
            "Date Created": "01-29-2019 04:34:14",
            "Upvotes": 3,
            "Text": "I promise you. This morning I thought ”I wonder if someone will comment that”.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9thca": [
        {
            "Parent ID": "t1_ef9t7qu",
            "Comment ID": "ef9thca",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 11:29:31",
            "Upvotes": 7,
            "Text": "A very quick answer is that there is no universal price for mining. It heavily depends on the region (electricity costs are very different between geographical locations/jurisdictions) and other operational costs. Also there's something called \"difficulty adjustment\". If miners drop out, the mechanism adjusts downward and it becomes \"easier\" to mine again. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaifd5": [
        {
            "Parent ID": "t1_ef9t7qu",
            "Comment ID": "efaifd5",
            "Author": "racebum",
            "Date Created": "01-29-2019 15:07:56",
            "Upvotes": 5,
            "Text": "The price to mine it in some of the most efficient places in the world right now is in the low $1,000 range. As more and more unefficient miners get out of this that could actually go lower.\n\nIf you're going to look at a metric the network value to transaction is probably a better one than mining.\n\nIf we have a capitulation bottom it's going to be obvious you're going to see things sell off and you're going to see people panicking and forced to sell. It's highly possible that some large hands want to see bitmain broken and the bch project destroyed. this would land a lot of stability to Bitcoin in general as they have been the most toxic asset in the space. I said this in another post but there are literally two smart ways to play Bitcoin right now. One of them is by when we decisively close over 6,000. The other is wait for a capitulation event or capitulation bottom to actually form. You want the price to go down to a lower level on extremely high volume and then rock it back up. The chart in February 2018 is actually what capitulation looks like even though that one was not the actual bottom. Having something like that happen again really increases the odds that we have hit a bottom. You have the massive percentage decrease and you also have the technical capitulation which means people are forced to sell. I seriously think breaking roger and bitmain are likely primary goals of this bear Market. It's always going to be a thorn in the side if we recover and they are still around",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9wii4": [
        {
            "Parent ID": "t1_ef9t7qu",
            "Comment ID": "ef9wii4",
            "Author": "noneither",
            "Date Created": "01-29-2019 11:58:17",
            "Upvotes": 8,
            "Text": "It's all about cash flow.  Often times a business can operate in the red for periods as long as they have positive cash flow.  Sunk capital cost doesn't matter in the short term.  So a miner might have to sell their coins BELOW their true costs (which will include capital allocation costs.)  \n\nSo in a price down turn, some are in survival mode and since their capital costs are unrecoverable, they still mine to keep cash flow, hoping that either difficulty drops or price increases.  \n\nAs long as their cash flow is marginally positive and their debt is not being collected, they can keep going for awhile.  \n\nThis is a compounding effect to low prices.  The lower the prices, the more desperate is the need for miners to sell until enough ultimately just give up or mothball operations.  \n\nThis overall compounds the normal boom bust cycles of a speculative asset.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef94wik": [
        {
            "Parent ID": "t1_ef94p75",
            "Comment ID": "ef94wik",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 06:42:38",
            "Upvotes": 2,
            "Text": "Paper wallet is an option, although it's subject to easy loss or destruction. Another option is Opendime: https://store.coinkite.com/store/3-pack, which is a cool piece of hardware but unfortunately, too expensive to give out as a change for a couple of $",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9b2pm": [
        {
            "Parent ID": "t1_ef96zub",
            "Comment ID": "ef9b2pm",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 08:16:39",
            "Upvotes": 11,
            "Text": "Take it from a typical, every day person. I see no way bitcoin can make my life better.\n\nI pay for everything with a credit card and get thousands for doing it. I just transfer the payment from my account to the card and never pay interest. I send money via etransfer or direct transfer if they use the same bank.\n\nI've read a lot on here and bitcoin is complicated and unnecessary. People who believe in bitcoin seem to fall into two categories -\n\n1) The belief that the price is basically going to increase forever into astronomical levels and buying bitcoin is basically a get rich quick scheme.\n\n2) The belief that the whole financial system is going to fall apart and people all around the world will choose bitcoin as their currency, then it will become the world's currency. Basically, a doomsday prepper.\n\nI don't believe either will happen. This sub is filled with hilarious nonsense of pumping up bitcoin. The huge price rise in 2017 had a lot of people talking about bitcoin. Basically everyone knows what it is now. Next to nobody actually wants to use it.\n\nThe terrifying thing about this sub is that I think a lot of people have been brainwashed and are spending a lot of money investing in bitcoin. They listen to only bitcoin supporters for confirmation bias and truly believe the price can only go up in the long term.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef99fyc": [
        {
            "Parent ID": "t1_ef96zub",
            "Comment ID": "ef99fyc",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 07:57:15",
            "Upvotes": 3,
            "Text": "The problem is that the best criticisms, in my experience at least, come from people with deep knowledge of bitcoin (Matt Corallo comes to mind, and other Core developers). But although they can be quite vocal about it, I don't think they systematically wrote it out somewhere.  \n\nIn any case, I've yet to find a good criticism write up from someone who actually knows what they're talking about. They might exist, but I haven't seen one yet. Although this article comes somewhat close: [Real Bitcoin FUD](https://medium.com/@surja795/real-bitcoin-fud-9f354364563b).  \n\nThen there are some who can offer hints of somewhat valid criticisms, like David Gerard, but it is usually mixed with some downright falsehoods or misunderstandings that I cannot really recommend their writings as legit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9a3lz": [
        {
            "Parent ID": "t1_ef96zub",
            "Comment ID": "ef9a3lz",
            "Author": "ProctoKopf",
            "Date Created": "01-29-2019 08:05:05",
            "Upvotes": 1,
            "Text": "Not just BTC, but Louigi Verona's critique of blockchain is worth a read: https://louigiverona.com/?page=projects&s=writings&t=qa&a=qa_blockchain\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaimy2": [
        {
            "Parent ID": "t1_ef96zub",
            "Comment ID": "efaimy2",
            "Author": "racebum",
            "Date Created": "01-29-2019 15:09:52",
            "Upvotes": 1,
            "Text": "The most skeptical question you need to ask yourself is simply this. Why does it need to exist? That is the most powerful argument against it. Why does Bitcoin specifically need to exist. \n\nIt's one of the big reasons people sell if they don't panic over price. In fact it's a reason that's been around ever since creation.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef95l11": [
        {
            "Parent ID": "t1_ef93cke",
            "Comment ID": "ef95l11",
            "Author": "BPT242",
            "Date Created": "01-29-2019 06:56:36",
            "Upvotes": 8,
            "Text": "No end in sight. \nMight be another year of this ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef94t0v": [
        {
            "Parent ID": "t1_ef93cke",
            "Comment ID": "ef94t0v",
            "Author": "AussieBitcoiner",
            "Date Created": "01-29-2019 06:40:22",
            "Upvotes": 3,
            "Text": "I think it's committed to re-test the low here, the sooner we get down to it the better. need a strong positive reaction when we reach it, otherwise it could be a little while longer IMO (mainly guessing) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9r9s7": [
        {
            "Parent ID": "t1_ef9q82q",
            "Comment ID": "ef9r9s7",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 11:08:05",
            "Upvotes": 9,
            "Text": "MAST, Schnoor, Taproot: https://bitcoinmagazine.com/articles/taproot-coming-what-it-and-how-it-will-benefit-bitcoin/  \n\nGraftroot: https://bitcoinmagazine.com/articles/graftroot-how-delegating-signatures-allows-near-infinite-spending-variations/  \n\nAnd Lightning \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efc08eh": [
        {
            "Parent ID": "t1_efbft0m",
            "Comment ID": "efc08eh",
            "Author": "laninsterJr",
            "Date Created": "01-30-2019 00:38:22",
            "Upvotes": 1,
            "Text": "hmm I dont think bitcoin can track simply by IP.. im not an expert tho. but amazon claim to have some advance patent tech to track it. not sure about it too.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbkwjt": [
        {
            "Parent ID": "t1_efal0q3",
            "Comment ID": "efbkwjt",
            "Author": "AdamJensensCoat",
            "Date Created": "01-29-2019 21:27:55",
            "Upvotes": 3,
            "Text": "Mood is bullish!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef93pc3": [
        {
            "Parent ID": "t1_ef9146d",
            "Comment ID": "ef93pc3",
            "Author": "BitcoinAlways",
            "Date Created": "01-29-2019 06:14:23",
            "Upvotes": 1,
            "Text": "[https://pro.coinbase.com/](https://pro.coinbase.com/trade/BTC-USD)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbo47g": [
        {
            "Parent ID": "t1_efb69hw",
            "Comment ID": "efbo47g",
            "Author": "machn",
            "Date Created": "01-29-2019 22:02:42",
            "Upvotes": 3,
            "Text": "Companies usually do this to cover their case in legal disputes. \"Look we got audited by a big accounting corp!\"\n\nAudits only suggest that they have done the basic (traditional) checks. \"Guaranteeing funds security\" in crypto space seems like trying a hard sell. False audits were a reason for the 2008 financial crysis.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efc2fu0": [
        {
            "Parent ID": "t1_efc1szz",
            "Comment ID": "efc2fu0",
            "Author": "[deleted]",
            "Date Created": "01-30-2019 01:13:10",
            "Upvotes": 1,
            "Text": "Yes sir",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efalta1": [
        {
            "Parent ID": "t1_efahrba",
            "Comment ID": "efalta1",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 15:39:34",
            "Upvotes": 11,
            "Text": "The difficulty of the mining algorithm scales with the number of miners, as well as with the number of coins mined and the time taken to mine. That's the extremely simplified answer. The guys that got me interested in this space started out mining on older PCs, and it certainly did not cost 3k back then!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efahwpu": [
        {
            "Parent ID": "t1_efahrba",
            "Comment ID": "efahwpu",
            "Author": "racebum",
            "Date Created": "01-29-2019 15:03:13",
            "Upvotes": 8,
            "Text": "One word, difficulty",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb6dve": [
        {
            "Parent ID": "t1_efapit0",
            "Comment ID": "efb6dve",
            "Author": "Chroko",
            "Date Created": "01-29-2019 18:57:06",
            "Upvotes": 3,
            "Text": "No.\n\nIt would need a form of escrow, or a \"pending\" transaction state that can be cancelled for a certain length of time before it completed and the balances settle.\n\nA future cryptocurrency could build this (and it is needed), but it probably won't be Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efat9fa": [
        {
            "Parent ID": "t1_efapit0",
            "Comment ID": "efat9fa",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 16:51:37",
            "Upvotes": 2,
            "Text": "Invalid address, or incorrect recipient?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaqq5i": [
        {
            "Parent ID": "t1_efapit0",
            "Comment ID": "efaqq5i",
            "Author": "Galwoa",
            "Date Created": "01-29-2019 16:26:12",
            "Upvotes": 1,
            "Text": "There is a Base58 check implemented to prevent incorrect addresses (such as those that are a result of human error), see here: https://en.bitcoin.it/wiki/Base58Check_encoding#Creating_a_Base58Check_string",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbgp2u": [
        {
            "Parent ID": "t1_efax23g",
            "Comment ID": "efbgp2u",
            "Author": "AdamJensensCoat",
            "Date Created": "01-29-2019 20:40:09",
            "Upvotes": 3,
            "Text": "I buy online gambling.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb6ukt": [
        {
            "Parent ID": "t1_efax23g",
            "Comment ID": "efb6ukt",
            "Author": "Chroko",
            "Date Created": "01-29-2019 19:01:18",
            "Upvotes": 4,
            "Text": "Criminals use it to launder money.\n\nFor most average people, a bank account and a credit card is a better way to store your paycheck and buy groceries.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbkk71": [
        {
            "Parent ID": "t1_efax23g",
            "Comment ID": "efbkk71",
            "Author": "time_wasted504",
            "Date Created": "01-29-2019 21:24:02",
            "Upvotes": 2,
            "Text": "last thing I bought was earrings from diadem for the missus last month. All of a sudden BTC was much more interesting to her. :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbnut3": [
        {
            "Parent ID": "t1_efax23g",
            "Comment ID": "efbnut3",
            "Author": "wobble_87",
            "Date Created": "01-29-2019 21:59:49",
            "Upvotes": 4,
            "Text": "I'm buying my early retirement.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbyq5w": [
        {
            "Parent ID": "t1_efax23g",
            "Comment ID": "efbyq5w",
            "Author": "area51perp",
            "Date Created": "01-30-2019 00:16:52",
            "Upvotes": 1,
            "Text": "Saving up to buy everything. Been homeless and at the bare min for years and have had issues with several major banks. Due to student loans banks won't even let me spend more than $500 in a day. Still don't have a mailing address for a block debit but waiting until the bull market starts then I'll use Nexo to take loans on my BTC.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9zg80": [
        {
            "Parent ID": "t1_ef983rd",
            "Comment ID": "ef9zg80",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 12:24:51",
            "Upvotes": 2,
            "Text": "\"T-this is good for B-bitcoin, guys!\"",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb20iu": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efb20iu",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 18:16:57",
            "Upvotes": 9,
            "Text": "Lol. And you're taking the time to hang out in a bitcoin sub, to type this why? Funny that you feel the need to tell a community of people who are interested in bitcoin that there is no interest in bitcoin. That's priceless. What's next, headed over to the marijuana investment sub and tell them it's all hype?",
            "Edited?": "01-29-2019 22:05:03",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb6zjq": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efb6zjq",
            "Author": "QingHouFeng",
            "Date Created": "01-29-2019 19:02:29",
            "Upvotes": 3,
            "Text": "This is troll FUD account ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb9ddk": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efb9ddk",
            "Author": "MadBanker01",
            "Date Created": "01-29-2019 19:24:09",
            "Upvotes": 1,
            "Text": "You obviously have something to gain from talking bitcoin down, otherwise why do it. I guess you are shorting it, or see bitcoin as some kind of threat.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbk9gl": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efbk9gl",
            "Author": "whalecheetah",
            "Date Created": "01-29-2019 21:20:47",
            "Upvotes": 1,
            "Text": "seriously, sell it all and don't return. why even bother with this sub?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efc0ktj": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efc0ktj",
            "Author": "laninsterJr",
            "Date Created": "01-30-2019 00:43:43",
            "Upvotes": 1,
            "Text": "Hello Jamie Dimon how you doing?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efhght0": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efhght0",
            "Author": "cryptogrip",
            "Date Created": "01-31-2019 19:49:51",
            "Upvotes": 1,
            "Text": "Guess you were wrong about that hey? Since it's been resubmitted.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb6kqo": [
        {
            "Parent ID": "t1_efaxm0h",
            "Comment ID": "efb6kqo",
            "Author": "Chroko",
            "Date Created": "01-29-2019 18:58:52",
            "Upvotes": 0,
            "Text": "Agreed, there are no greater fools remaining.\n\nCurrency trading in general is a great way to get slaughtered in the markets, seems like Bitcoin is join that club. Although currencies can just go sideways forever and that's not a problem, but expectations seem unreasonable for Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef8zaeg": [
        {
            "Parent ID": "t1_ef8yma1",
            "Comment ID": "ef8zaeg",
            "Author": "MikeLittorice",
            "Date Created": "01-29-2019 04:40:25",
            "Upvotes": 5,
            "Text": "You should learn how to use punctuation, people might actually be able to read your comments. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbm35b": [
        {
            "Parent ID": "t1_ef8yma1",
            "Comment ID": "efbm35b",
            "Author": "time_wasted504",
            "Date Created": "01-29-2019 21:40:35",
            "Upvotes": 1,
            "Text": "hashtagsameshitdifferentuser\n\nIf you cant see the fundamental reasons to own bitcoin, we dont have time to explain it to you. Sorry.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa79yh": [
        {
            "Parent ID": "t1_ef9e3tq",
            "Comment ID": "efa79yh",
            "Author": "HighInLowOut",
            "Date Created": "01-29-2019 13:31:27",
            "Upvotes": 7,
            "Text": "what a pile of horse shit",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbvn2y": [
        {
            "Parent ID": "t1_efbmtbt",
            "Comment ID": "efbvn2y",
            "Author": "Takoyami",
            "Date Created": "01-29-2019 23:35:44",
            "Upvotes": 2,
            "Text": "You raise a good point there, thank you for the insight. I guess if more people think like this then the transition will be natural.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbmz7w": [
        {
            "Parent ID": "t1_ef9o7le",
            "Comment ID": "efbmz7w",
            "Author": "MrRGnome",
            "Date Created": "01-29-2019 21:50:17",
            "Upvotes": 1,
            "Text": "Millibitcoin already have a name, just use metric prefixes. You can set the display of most wallets to mBTC already.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9z1m2": [
        {
            "Parent ID": "t1_ef9o7le",
            "Comment ID": "ef9z1m2",
            "Author": "NightKnight_CZ",
            "Date Created": "01-29-2019 12:21:20",
            "Upvotes": -1,
            "Text": "Yes please!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa325z": [
        {
            "Parent ID": "t1_ef9o7le",
            "Comment ID": "efa325z",
            "Author": "MadBanker01",
            "Date Created": "01-29-2019 12:56:04",
            "Upvotes": -1,
            "Text": ">Seconded. How do we make this a thing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb3jp2": [
        {
            "Parent ID": "t1_efau540",
            "Comment ID": "efb3jp2",
            "Author": "noneither",
            "Date Created": "01-29-2019 18:31:30",
            "Upvotes": 1,
            "Text": "You can fork it anytime you like. 😀. But your comment does not relate to the one above.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9aqym": [
        {
            "Parent ID": "t1_ef93o11",
            "Comment ID": "ef9aqym",
            "Author": "toommm_",
            "Date Created": "01-29-2019 08:12:46",
            "Upvotes": 1,
            "Text": "The announcement of his death is on their official Twitter but it unfortunately links to an article on the exchanges site, which as of 15h ago, has gone \"down for maintenance\".\n\nNothing about him having exclusive access to the cold wallets.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa5zd2": [
        {
            "Parent ID": "t1_ef9thca",
            "Comment ID": "efa5zd2",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 13:20:11",
            "Upvotes": 3,
            "Text": "Right, so wouldn't we expect the cost of bitcoin to settle somewhere just above the cost of mining?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa5uxe": [
        {
            "Parent ID": "t1_ef9wii4",
            "Comment ID": "efa5uxe",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 13:19:08",
            "Upvotes": 3,
            "Text": "Why will the price go up?  Sorry, maybe these questions are too broad, but I've been interested in bitcoin for a long time, and I noticed I was confused about some basics.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9tw1k": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "ef9tw1k",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 11:33:37",
            "Upvotes": 4,
            "Text": "Just simplify it. Anyone with common sense and a basic understanding of how tech becomes implemented into society, combined with the fact that we are rapidly evolving as a digital society, is not buying bitcoin because it can make life better right now. The development efforts for bitcoin are non-stop, and it's safe to say this will continue. Your credit card and it's current features took time to become what they are today. And that was based on an already established currency. Buying bitcoin today is a long term bet on the future. You don't go all in, you simply include it as a part of your high risk investment portfolio on the chance that this thing continues to transform and integrate with a future digital economy.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb51yg": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "efb51yg",
            "Author": "noneither",
            "Date Created": "01-29-2019 18:45:06",
            "Upvotes": 2,
            "Text": "I think that you miss the point of Bitcoin.  Sure there are many who fit the profile of what you state.  \n\nBut that's not the point of Bitcoin.  Bitcoin is brilliant.  It has a verifiably perfect transaction history.  And can be used without the consent of a third party.  \n\nThis is a huge innovation relative to 16th century double entry accounting money (that is, banks).  Banks are opaque and known for fraud as much as anything else.  \n\nIt has not been about convenient payments or credit yet.  But those are emerging.  \n\nYou seem intelligent but judgemental.  It might benefit you to ask a few questions before judging because you clearly have missed something about Bitcoin in the noise you have decided to focus on. Or, just you know, go do your thing somewhere else if all you want to do here is spew   ignorant judgement.  You aren't novel.  Your analysis is common as dirt and just as valued around here.  I mean that respectfully.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9gt66": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "ef9gt66",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 09:24:08",
            "Upvotes": 4,
            "Text": "Use cases for bitcoin are: storing value in a way that can be easily transported without being confiscated, making remote payments without a middleman or border restrictions, and making anonymous payments (if done with caution).\n\nAdditional use cases will become possible with the evolution and spread of Lightning, including making instant payments with a negligible fee, including micropayments that are not feasible with a credit card.\n\nI think most typical, everyday people don't have much need for the first set of use cases, but the capabilities of Lightning will create a whole new class of payments that will see widespread use and drive the price of Bitcoin much higher.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9n938": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "ef9n938",
            "Author": "ToBitOrNotToBit",
            "Date Created": "01-29-2019 10:30:31",
            "Upvotes": 3,
            "Text": "Credit believer, you'll die poor and you'll leave your children to pay your debts.\n\n:-)\n\nYes, that's every government sponsor a.k.a. Paper money.\n\nGood luck :-)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaag5g": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "efaag5g",
            "Author": "BashCo",
            "Date Created": "01-29-2019 13:58:54",
            "Upvotes": 1,
            "Text": "Most of what you're saying here are over-generalizations. Your two categories are extremist projections. Very few people here think Bitcoin's price is going to increase forever, if any at all. The financial system ebbs and flows all the time. The past century has experienced vast amounts of monetary inflation which has debased numerous currencies. Acknowledging these facts doesn't make you a doomsday prepper. \n\nYes, there are some get-rich-quick kids trying to pump the price, but they are typically dealt with and shunned if it goes being good fun. But most of what you're saying is just flat-out wrong, and you're relying heavily on reductio ad absurdum fallacies. In short, bullshit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9fxhz": [
        {
            "Parent ID": "t1_ef9b2pm",
            "Comment ID": "ef9fxhz",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 09:14:28",
            "Upvotes": 1,
            "Text": "You are entitled to your beliefs/views, even if they don't coincide with my own observations; f.ex I don't fall in either of those two groups you mentioned, and most bitcoiners I know don't fall into them either (and this includes devs and other people who work full time in bitcoin space). Your observation might be a case of skewed perception, resulting from observing high-noise/low-signal soc media sources (although I cannot deny that group 1) and 2) exist).   \n\nAnyway, I'm curious why you are in this sub given your strong aversion to it and to bitcoin in general? Not asking as an attack or anything, genuinely curious :) \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9l1rv": [
        {
            "Parent ID": "t1_ef95l11",
            "Comment ID": "ef9l1rv",
            "Author": "BitcoinAlways",
            "Date Created": "01-29-2019 10:08:57",
            "Upvotes": 3,
            "Text": "Could very well be the case, do you feel confident that Bitcoin will in say the next 3 years get over $10k?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9l4pn": [
        {
            "Parent ID": "t1_ef94t0v",
            "Comment ID": "ef9l4pn",
            "Author": "BitcoinAlways",
            "Date Created": "01-29-2019 10:09:46",
            "Upvotes": 1,
            "Text": "We are all guessing to be fair :)  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efatsb9": [
        {
            "Parent ID": "t1_efat9fa",
            "Comment ID": "efatsb9",
            "Author": "vegueria124",
            "Date Created": "01-29-2019 16:56:44",
            "Upvotes": 2,
            "Text": "Incorrect recipient.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbbzfv": [
        {
            "Parent ID": "t1_efb6ukt",
            "Comment ID": "efbbzfv",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 19:50:43",
            "Upvotes": 0,
            "Text": ">Criminals use it to launder money.\n\nhow? they take cash and go to coinbase in exchange for bitcoins ? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb2dad": [
        {
            "Parent ID": "t1_efb20iu",
            "Comment ID": "efb2dad",
            "Author": "djulac",
            "Date Created": "01-29-2019 18:20:18",
            "Upvotes": 7,
            "Text": "Having people like him makes Hodling much more fun. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efauqoe": [
        {
            "Parent ID": "t1_efa79yh",
            "Comment ID": "efauqoe",
            "Author": "dwyss9",
            "Date Created": "01-29-2019 17:06:29",
            "Upvotes": 1,
            "Text": "muuhhhh\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaaxxm": [
        {
            "Parent ID": "t1_efa5zd2",
            "Comment ID": "efaaxxm",
            "Author": "ProctoKopf",
            "Date Created": "01-29-2019 14:02:52",
            "Upvotes": 3,
            "Text": "Yes, I believe this true. It should settle somewhere just above the *average* cost to mine a single bitcoin. Today that average cost is between $3500 - $4000. And as others have said, the difficulty adjustments impact that average cost.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa9vtb": [
        {
            "Parent ID": "t1_efa5zd2",
            "Comment ID": "efa9vtb",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 13:53:58",
            "Upvotes": 2,
            "Text": "Well there is no universal cost of mining (see my previous post), and the demand fluctuates wildly... So I don't think so. Maybe in the long-run? But I haven't thought deeply about it. So if you have thoughts, let them out :) ",
            "Edited?": "01-29-2019 17:47:07",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaw4p7": [
        {
            "Parent ID": "t1_efa5uxe",
            "Comment ID": "efaw4p7",
            "Author": "noneither",
            "Date Created": "01-29-2019 17:20:10",
            "Upvotes": 3,
            "Text": "I am not saying that the price will definitely go up.  That's unknowable.  I think it will...\n\nIn the past as the price went up, there is a lag of time before new hashrate (miners) can enter the market.  This reduced competition relative to the reward makes mining very profitable and this continues as long as the price is rising.  This attracts new hashrate.  Bitcoin has high utility potential and growing real use.  This makes for a high degree of speculation so is quite naturally prone to boom bust price cycles.  Once the speculation seems to have overdone itself, people sell off.  Both price increases and decreases are self reinforcing, positive feedback for control systems engineers.  \n\nThe economics of mining as I stated them here amplify the positive feedback and exacerbate the boom bust.    \n\nThis all ameliorates with lowered inflation as the mining rewards decrease and a utility demand floor takes hold, where people use it as a means of exchange in the short term and price doesn't matter.  \n\nAll of this stated in the context that Bitcoin could go to zero price ten minutes from now.  😉\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9vd6d": [
        {
            "Parent ID": "t1_ef9tw1k",
            "Comment ID": "ef9vd6d",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 11:47:33",
            "Upvotes": 3,
            "Text": "But how does bitcoin get a lot better? It is a digital currency. What are the big developments going to be that will make it so much better than traditional currency?\n\nI already use my currency digitally. I pay with cards and use online banking.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb7l8h": [
        {
            "Parent ID": "t1_efb51yg",
            "Comment ID": "efb7l8h",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 19:07:49",
            "Upvotes": 2,
            "Text": "Yeah you make good points and maybe I'm being too judgmental. I don't agree that it is from ignorance though.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9jj2y": [
        {
            "Parent ID": "t1_ef9gt66",
            "Comment ID": "ef9jj2y",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 09:53:13",
            "Upvotes": 5,
            "Text": "I hear the store of value argument but that only really works if the price does not continue to drop over the long term. Bitcoin could become worth next to nothing, whether people on here want to believe that or not.\n\nYou're speculating on the future use of payments with bitcoin. For this to happen that would mean that people would have to find a way to buy and use bitcoin. You're underestimating the resistance people have to change. People work for most of their lives are not going to be excited about changing their currency and figuring out the best bitcoin wallet to use when they can just buy things the same way they always have.\n\nVisa and Mastercard are huge companies with tons of money, check out their stock price history. They have made investors money for years and years. Even if there is a benefit to paying with bitcoin it faces the huge barrier of people actually adopting it, and then these gigantic companies not offering lower fees and competing to keep business going as usual.\n\nThe widespread use and bitcoin going much higher in price is not going to be nearly as easy as you think.\n\nYou have to realize you're talking about changing a currency here, that's a crazy thing to change. Traditional currency has so much behind it with banks and infrastructure. \n\nPeople taking their hard earned money (which a lot of people don't even have much to any disposable income as it is) and changing currency that is not backed by any bank or government, just to buy things when they can just buy it like they always have, is just insanity to me. \n\nYoung people with a lot of disposable income may give it a try but that's few and far between.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9i5fj": [
        {
            "Parent ID": "t1_ef9gt66",
            "Comment ID": "ef9i5fj",
            "Author": "siberianmi",
            "Date Created": "01-29-2019 09:38:49",
            "Upvotes": 2,
            "Text": "But none of those are use cases for the typical average citizen in an modern industrialized nation.  Nobody worries about easily transporting money and having it confiscated, most average citizens have little need to move money much.  When they do it's large purchases like houses, which the money is easily moved with no fear of loss.\n\nGoing back to the example, a typical credit card user who pays in full each month BENEFITS from the middle man.  The middle man gives him a cut of the profit in the form of cash back, gives him spending protections, gives him other incentives, and for the average Joe makes spending easy.  There's no incentive for him to cut out this middle man and retailers that try to see sales suffer.\n\nAnonymity of Bitcoin is highly overrated - \"with caution\" is an understatement.  To the point that it's largely a criminal reason anyone would put in that much effort.\n\nThe real benefit is possibly for retailers by shifting the costs from sellers to buyers for transactions, eliminating charge back, etc.   Buyers however have no reason to switch.   Buyers in fact have already moved away from that system (paper fiat) which had many of these features to one that doesn't (credit cards) because those features were not compelling to buyers.\n\nAnd the buyers make the rules in a competitive market.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9rpi7": [
        {
            "Parent ID": "t1_ef9n938",
            "Comment ID": "ef9rpi7",
            "Author": "starcom_magnate",
            "Date Created": "01-29-2019 11:12:12",
            "Upvotes": 8,
            "Text": "You do realize that a lot of people use credit as a way to increase the value of their spending? Not everyone loads up cards without intent to pay them off.\n\nI, for one, use my card for everything and pay it off every month. The end result has been numerous vacations paid 100% with the benefits I get from those cards.\n\nI carry no debts that my kids will have to take care of.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9nspu": [
        {
            "Parent ID": "t1_ef9n938",
            "Comment ID": "ef9nspu",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 10:35:55",
            "Upvotes": 4,
            "Text": "I don't have any debt. I'm 30 and have approximately 115000 saved. My wife is debt free and well and has a good amount of savings.\n\nI'm doing just fine financially.\n\nJust because someone uses a credit card, does not mean they are in debt :-)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efab4mt": [
        {
            "Parent ID": "t1_efaag5g",
            "Comment ID": "efab4mt",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 14:04:24",
            "Upvotes": 4,
            "Text": "Do you read this sub? People talk about the price sky rocketing all the time.\n\nIt's not very few based on the posts on here, it's definitely the majority.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9hvh0": [
        {
            "Parent ID": "t1_ef9fxhz",
            "Comment ID": "ef9hvh0",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 09:35:49",
            "Upvotes": 2,
            "Text": "I would be interested to hear why you're invested in bitcoin if you don't fall into either category. \n\nWell, I heard about bitcoin a long time ago and once I figured out what it was, I was not interested. Then, the crazy rise in price in 2017 I was reading about it a bit more, joined reddit soon after.\n\nI've always been interested in investing and the things posted on this sub have always been pretty funny to me. The talk is very similar to people who fall into groups. A lot of logic gets thrown out the window and it becomes just a big circle jerk, lol. There was a post about how a Tim Hortons location would not accept $100 bills and that's why we need bitcoin, lol. As if debit and credit cards do not exist. It was upvoted and had lots of comments supporting that \"logic\".\n\nI like to post on the sub to offer resistance because, like I said earlier, the amount of money some people are pumping into bitcoin is terrifying. It is a speculative investment, the price could fall and be worth next to nothing. \n\nSo I come for a laugh, offer resistance to the idea that bitcoin is the second coming of jesus, and hope to put doubt in the mind of someone who was going to put a lot of their money into bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb1nmu": [
        {
            "Parent ID": "t1_efatsb9",
            "Comment ID": "efb1nmu",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 18:13:27",
            "Upvotes": 2,
            "Text": "\n \nNot sure that is a feature any one would actually want.  Beyond the nonsensical chargeback systems for CC, i dont think any such mechanism really exists for any other form of payments.\n\nI could see a \"are you sure\" type of confirmation in a GUI, but once you hit GO, its on you. As it should be (in my opinion)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbvgme": [
        {
            "Parent ID": "t1_efbbzfv",
            "Comment ID": "efbvgme",
            "Author": "Takoyami",
            "Date Created": "01-29-2019 23:33:10",
            "Upvotes": 1,
            "Text": "Physical cash exchange could be a thing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efagt1q": [
        {
            "Parent ID": "t1_efaaxxm",
            "Comment ID": "efagt1q",
            "Author": "racebum",
            "Date Created": "01-29-2019 14:53:40",
            "Upvotes": 2,
            "Text": "It is substantially lower than that. 7nm on .03c kwh power has a 1 in front of it. The average honestly doesn't matter. What matters are the miners that are most efficient.\n\nIf you're looking at this from a price perspective there are literally two ways to play the market. Number one wait for a decisive break above 6000. Number two wait for a capitulation bottom to actually be put in. The signals and signs of one are very obvious if you know what you're looking for",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efay8ch": [
        {
            "Parent ID": "t1_efaaxxm",
            "Comment ID": "efay8ch",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 17:40:05",
            "Upvotes": 2,
            "Text": "So you expect Bitcoin to hover at about the current price indefinitely, then?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efayv7e": [
        {
            "Parent ID": "t1_efa9vtb",
            "Comment ID": "efayv7e",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 17:46:22",
            "Upvotes": 1,
            "Text": "Sorry, I just assumed (maybe wrongly) that you owned a significant amount of bitcoin!  Maybe a dumb assumption to make, since there seems to be a lot of interest even from people not in the market, like me.\n\nLike I said, I was confused and didn't understand what was going on.  It's one reason I sold my fractions of bitcoin last year when it was at $16k, since I was wary of a situation where I was invested in a market I didn't understand.  Not sure I have good thoughts to share.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efay3nz": [
        {
            "Parent ID": "t1_efaw4p7",
            "Comment ID": "efay3nz",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 17:38:48",
            "Upvotes": 2,
            "Text": "Well, presumably you do think it is more likely to go up than not, though, right?\n\nAs you describe it, I wonder about the inherent value that would cause the price to stay significantly above the cost of mining.  You can't use a Bitcoin for anything except as a currency, unlike a lot of assets.  Do people use Bitcoin as a medium of exchange?  To an outsider, it seems to be almost exclusively used for signaling purposes (opposing banks, being futuristic/utopian) or for illicit purposes (ransomware, drugs).   That would seem to imply a very low demand floor.\n\nI mean, if I am using bitcoin, I can't imagine a situation where I don't want to convert it to real money as soon as possible, right, \\*unless\\* I am speculating with that value, right?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9x0id": [
        {
            "Parent ID": "t1_ef9vd6d",
            "Comment ID": "ef9x0id",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 12:02:55",
            "Upvotes": 6,
            "Text": "I would need a lot more than this space to communicate it properly, but it mostly has to do with the digital transaction of money as routable content. A credit card transaction involves an enormous amount of middle men, and what may seem simple to you is way overly complicated. It also involves multiple points of failure, and protecting us from these risks costs a lot of money. Bitcoin however, is self-maintained and removes all the complications and costs of accounting, security, verification, etc. When something is more efficient, it usually gets implemented once it's tweaked to an acceptable level of production. The thing is 10 years is not long enough to see mainstream adoption, but it is long enough to establish a strong foundation that has proven to be worth building on. Now is when the real innovation begins. We're going to see a lot of layers, protocols, side chains, etc developed to improve the bitcoin network, and it's already happening as we speak. \n\nWhen in the history of technology have we ever said, \"OK the systems we have in place already work fine, let's stop improving them now.\"? Never! Yes credit cards and current systems work, but bitcoin can definitely work better on multiple fronts of accounting, cross border translations, and overall efficiencies in way too many ways to mention. User friendly interfaces and things like wallet address translations,etc. will be built and if the past decade is any indication, this thing is not slowing down.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb8bph": [
        {
            "Parent ID": "t1_efb7l8h",
            "Comment ID": "efb8bph",
            "Author": "noneither",
            "Date Created": "01-29-2019 19:14:30",
            "Upvotes": 1,
            "Text": "If you understand that the value of Bitcoin is not comparable to the convenience of a credit card, then you are not ignorant.  But I haven't seen that yet.  You are correct on one hand.  Bitcoin and the world are not quite ready for one another even if they are hurtling towards each other.  Any one who thinks Bitcoin is a sure thing homerun investment is deluded.  But honestly, the most spoken comment in this sub is literally \"do not invest more than you are willing to lose.\"\n\nPersonally I have lost private keys by destroying a hardware wallet and improperly recording keywords.  Bitcoin is tricky.  You are correct about that it is risky in many ways.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9m3zc": [
        {
            "Parent ID": "t1_ef9jj2y",
            "Comment ID": "ef9m3zc",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 10:19:24",
            "Upvotes": 1,
            "Text": "First, I never said adoption of bitcoin would be quick or easy. Second, I agree that the use cases for bitcoin are not compelling for the typical consumer today.\nI think the evolution of Lightning Network, or something like it, will propel bitcoin into the mainstream. Instant micropayments will be a game changer. I'm placing my bets accordingly.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbb12y": [
        {
            "Parent ID": "t1_ef9i5fj",
            "Comment ID": "efbb12y",
            "Author": "ColonelEngel",
            "Date Created": "01-29-2019 19:40:35",
            "Upvotes": 1,
            "Text": "You do of course realize that your 1% cash back isn't given you to reward your good character, it comes out of 3% fee that the merchant pays to the credit card company, and that fee is fully included in the price you pay.",
            "Edited?": "01-29-2019 19:45:38",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9jcyi": [
        {
            "Parent ID": "t1_ef9i5fj",
            "Comment ID": "ef9jcyi",
            "Author": "Leoforic",
            "Date Created": "01-29-2019 09:51:29",
            "Upvotes": 1,
            "Text": "Wrong. Microtransactions  will be very big, and credit cards cannot do that.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb03ah": [
        {
            "Parent ID": "t1_ef9rpi7",
            "Comment ID": "efb03ah",
            "Author": "[deleted]",
            "Date Created": "01-29-2019 17:58:20",
            "Upvotes": 1,
            "Text": "You might not be paying upfront.\n\nTransaction Fees charged to Merchants, however, end up being a cost factored into retail and sale. Therefore, SOMEONE pays at some point for your benefits. Just as you pay more for things for another persons benefits.\n\nNothing is ever for Free. You should know this!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb40t1": [
        {
            "Parent ID": "t1_efab4mt",
            "Comment ID": "efb40t1",
            "Author": "noneither",
            "Date Created": "01-29-2019 18:35:45",
            "Upvotes": 2,
            "Text": "You may want to know that the person who you are conversing with is a sub moderator for some years.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efabq53": [
        {
            "Parent ID": "t1_efab4mt",
            "Comment ID": "efabq53",
            "Author": "BashCo",
            "Date Created": "01-29-2019 14:09:29",
            "Upvotes": 2,
            "Text": "Yes, I do read this sub. O_o\n\nPeople do talk about the price pretty frequently. Often they talk about the price eventually going up to some extent. Is that the same as what you initially claimed with your absurd over-generalizations and other falsehoods? No, it is not.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9jkvx": [
        {
            "Parent ID": "t1_ef9hvh0",
            "Comment ID": "ef9jkvx",
            "Author": "TheGreatMuffin",
            "Date Created": "01-29-2019 09:53:45",
            "Upvotes": 1,
            "Text": "> I like to post on the sub to offer resistance because, like I said earlier, the amount of money some people are pumping into bitcoin is terrifying. It is a speculative investment, the price could fall and be worth next to nothing.  \n\nI see. Well, that's quite a noble reason :)  \n\nSpeaking for myself, I don't think bitcoin's price will increase \"astronomically\". But I am somewhat confident that the price in, say, ten years, will be higher than it is today. And I am also fully accepting and prepared for the price to be lower during those ten years or even forever. Nothing is impossible.     \n\nBut it is not only the price: it's also voicing of disagreement with (parts of) the banking system in general and with (parts of) the financial practices of my country, as well as monetary system as a whole. Obviously I am aware that my voice doesn't count much, but I am doing something that I find right and good, and that's all I can do as an individual: withdrawing my participation (at least as far as I can) from a system I find flawed, and transferring my time and money into a system that I find better. \n\n \nTo your second group:  \n\n> 2) The belief that the whole financial system is going to fall apart and people all around the world will choose bitcoin as their currency, then it will become the world's currency. Basically, a doomsday prepper.  \n\nI am actually hugely optimistic for the world in general. I think bitcoin will empower people in general, and it doesn't have to overthrow the banking system completely (I don't believe it will, at least probably not in my lifetime). It is enough if bitcoin offers a viable alternative as an exit from the politicized financial system, abuse of authority, and abuse of money printing press. Better to have an exit option (even if not perfect) from that system, than no option at all.  \n\nImo bitcoin will do well even without a catastrophical system failure and I am definitely not wringing my hands in joyful expectation of any kind of economical crashes.  \n\nFurthermore, it's also interesting from a research/technical point of view, and having \"skin in the game\" motivates me to learn more about it and improving my understanding, as well as OpSec (operational security) skills, such as taking care of my keys, my back ups etc.  \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efag6sr": [
        {
            "Parent ID": "t1_ef9hvh0",
            "Comment ID": "efag6sr",
            "Author": "hacksaw_dick",
            "Date Created": "01-29-2019 14:48:22",
            "Upvotes": 0,
            "Text": "Some of the things you bring up are cogent, but you have a tendency to really rely upon straw-men, reductionist logic, and wide-sweeping generalizations to paint your boogeymen archetypes. Your points would be better served if delivered with a bit more sophistication and aplomb - nothing you are arguing is actually all that novel even to BTC users. The vast majority of folks who have (or had) \"invested\" in BTC would not call it the \"second coming of jesus\" nor do they believe that BTC  (nor any other crypto) is going to destroy the international financial system or legacy monetary institutions. In fact, most BTC \"investors\" I know are highly skeptical about its future prognosis and see massive obstacles to any noteworthy level of adoption or satisfying the world as a unit of account, medium of exchange, or holder of value. Naturally gravitating to a small minority of true-believing neckbeards who think BTC will be the world's currency within the next decade, allowing you to bang on your pots and pans in order to solidify your fairly prosaic and uncontroversial point of view, does not reflect the very measured perspective that most BTC investors/users have about it. Obviously no sane person, with an IQ over 120, would take anything away from a Tim Hortons not taking $100 bills when it comes to BTC's future, surely you know that. ",
            "Edited?": "01-29-2019 14:51:50",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb89bg": [
        {
            "Parent ID": "t1_efb1nmu",
            "Comment ID": "efb89bg",
            "Author": "vegueria124",
            "Date Created": "01-29-2019 19:13:54",
            "Upvotes": 2,
            "Text": "What about a scenario where say Bitcoin gets adopted as a payment option on a e-commerce website. You buy something, pay in Bitcoin and then the seller doesn't fulfill their side of the transaction by shipping it to you. How could the transaction get disputed? There would have to be an intermediary. Is this where smart contracts come into play?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efayn1a": [
        {
            "Parent ID": "t1_efagt1q",
            "Comment ID": "efayn1a",
            "Author": "alexanderdeeb",
            "Date Created": "01-29-2019 17:44:05",
            "Upvotes": 1,
            "Text": "I read your other post and this one, but could you explain a little bit more, please?\n\nWhat is a \"decisive break above 6000?\"  That would seem to imply you think Bitcoin could rapidly appreciate to double its current value, but that seems at odds with your discussion of capitulation.  As far as I know, capitulation is when investors realize their losses by selling an asset, which usually pushes the price even lower (since supply outstrips demand).  Are you saying you're waiting for either a boom or a bust, but you're not sure which?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaz06r": [
        {
            "Parent ID": "t1_efay8ch",
            "Comment ID": "efaz06r",
            "Author": "ProctoKopf",
            "Date Created": "01-29-2019 17:47:47",
            "Upvotes": 1,
            "Text": "I don't think it'll stay that way forever, but I believe miners have more impact on price \\*today\\* than many will admit. This guy describes the relationship best:   \n\n[https://www.reddit.com/r/BitcoinMarkets/comments/978p4w/two\\_underlying\\_factors\\_in\\_the\\_bubble\\_cycle/](https://www.reddit.com/r/BitcoinMarkets/comments/978p4w/two_underlying_factors_in_the_bubble_cycle/)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb1xy8": [
        {
            "Parent ID": "t1_efay3nz",
            "Comment ID": "efb1xy8",
            "Author": "noneither",
            "Date Created": "01-29-2019 18:16:17",
            "Upvotes": 2,
            "Text": "In some ideal world, Bitcoin has a very stable price.  In that world, mining becomes very marginal as there is no fundamental barriers and no changing price feedback.  The costs must be marginally below the price or the business fails. Simple.\n\nThe value of Bitcoin is in it's permissionless nature.  To hold or to spend requires no third party, merely a functional network.  The network functions very well up to this point.  \n\nUltimately, who would prefer to require permission to spend one's own money, so we differ on which is \"real money.\"  So you may not want to hold it, but you may have a requirement that you want to be unencumbered by banks.  There is real and growing use for this.  Every week some $10s of millions are transferred into Venezuela, evading bank sanctions imposed by the international banks and by the Venezuelan banks.  That's real use demand not speculation.  \n\nI think that the speculative value sees the possibility of more and more use of the currency units.  The array of possibilities compared to banks is as potent as the Internet as compared to traditional media.  Not merely political posture.  Of course, money separated from state seems better in any aspect (not only idealogical) than money evoked by state, at least to many of us.  \n\nIllicit purposes is a real use case.  Illicit does not necessarily mean immoral.  Venezuelans are surviving from starvation by their international contacts.  Illicit but quite moral.  State prohibition of most narcotics (Opioids excepted) is far more immoral than the \"illicit\"use of the narcotics. Viagra without prescription.  Illicit, hardly immoral.  70% taxation rate so that some stupid immature moralist has spending power is immoral.... \n\nHuman dignity is greatly increased by freedom from government imposition of what is money and how it will be used.  Illicit in many contexts, not immoral and a highly valued use.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efazejh": [
        {
            "Parent ID": "t1_efay3nz",
            "Comment ID": "efazejh",
            "Author": "medatascientist",
            "Date Created": "01-29-2019 17:51:49",
            "Upvotes": 1,
            "Text": "Well most people do not keep their excess cash in checking/savings account either and convert it into something (preferably liquid) that can keep its value and perhaps further appreciate. Same can be said for Bitcoin too, though it has higher variance. It is technically not so different than converting your money into something that you hope would overperform cash (which has a 2% inflation rate average for USD). Whether you choose Bitcoin or stocks or CDs all depend on your risk tolerance and your expected rewards.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9xv7v": [
        {
            "Parent ID": "t1_ef9x0id",
            "Comment ID": "ef9xv7v",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 12:10:43",
            "Upvotes": 2,
            "Text": "I hear you, but is it possible to improve the things mentioned with traditional currency?\n\nI understand there is room for improvement with payment processing, accounting, transferring across borders etc.\n\nWhat if that is improved with traditional currency? \n\nIf you don't see mainstream adoption in he next 10 years then this bitcoin investment is a real, real long shot.\n\nThere is new technology developed around it, sure. But existing financial institutions have a lot of money. Bitcoin doesn't look good to me for such a long term bet.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9mjy0": [
        {
            "Parent ID": "t1_ef9m3zc",
            "Comment ID": "ef9mjy0",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 10:23:39",
            "Upvotes": 2,
            "Text": "You're counting on people adopting this, so difficult and taking a long time is not exactly ideal, right?\n\nPlease explain to me how instant micropayments with bitcoin are better than someone paying with a credit card.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9t9nt": [
        {
            "Parent ID": "t1_ef9jcyi",
            "Comment ID": "ef9t9nt",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 11:27:20",
            "Upvotes": 3,
            "Text": "Why will microtransactions be very big?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9nyas": [
        {
            "Parent ID": "t1_ef9jcyi",
            "Comment ID": "ef9nyas",
            "Author": "Leoforic",
            "Date Created": "01-29-2019 10:37:25",
            "Upvotes": 2,
            "Text": "Also Point of Sale services charge around 3% which is passed on to the consumer. How are you selling that as a benefit?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaf0qe": [
        {
            "Parent ID": "t1_efabq53",
            "Comment ID": "efaf0qe",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 14:38:14",
            "Upvotes": 1,
            "Text": "You are hilarious. \n\nOh yeah I'm making absurd over-generalizations and falsehoods. This sub predicts the future value of bitcoin in the hundreds of thousands of dollars consistently. Many different people, all the time.\nThey always say the price will go up, not might. \n\nYou're wrong, bud. Your defense falls short when it's clearly all over sub. Nice try to swoop in and just tell me I'm in the wrong. It's all in writing in the history of posts on this sub.\n\n\"Eventually going up to some extent\" ROFL!\nYeah, that's how people word things on this sub for sure.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb9ilu": [
        {
            "Parent ID": "t1_efb89bg",
            "Comment ID": "efb9ilu",
            "Author": "ColonelEngel",
            "Date Created": "01-29-2019 19:25:36",
            "Upvotes": 2,
            "Text": "One popular method is escrow mechanism. You deposit btc to the third-party, but only release to the merchant when you receive the product.\nIn case of an argument, you send photos,  documents and escrow agent decides.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efb2exz": [
        {
            "Parent ID": "t1_efayn1a",
            "Comment ID": "efb2exz",
            "Author": "racebum",
            "Date Created": "01-29-2019 18:20:45",
            "Upvotes": 2,
            "Text": "This whole thing is going to take years and no one is really sure. what I think is going to happen is we're probably going to have a capitulation event and Trace along the bottom. You can look for that and start buying in there or you can wait for us to decisively break above 6000 and buy that which means closing weekly candles above 6k. \n\nSo to sum it up I'm either waiting for the bust or I'm waiting for a recovery to begin. 6K is absolutely nothing. That's not a boom. That's a start. A boom is getting above 20k and sustaining it heading for 50",
            "Edited?": "01-30-2019 02:41:58",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efce6eq": [
        {
            "Parent ID": "t1_efb1xy8",
            "Comment ID": "efce6eq",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 04:36:51",
            "Upvotes": 2,
            "Text": "It sounds like you agree that right now the use is almost entirely illicit or signaling, though.  I'm not passing judgment on the morality of the various illicit or signaling uses, but that's always going to sharply limit the demand floor, right? Maybe I'm not following the train of thought very well, which is probably my fault.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcemie": [
        {
            "Parent ID": "t1_efazejh",
            "Comment ID": "efcemie",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 04:44:25",
            "Upvotes": 1,
            "Text": "This does sound right, but stocks and bonds are worth something because they represent a share of a company or its debt.  Bitcoin doesn't represent anything except pure scarcity, so far as I can figure.  Maybe that's what I don't understand.\n\nDoes this analogy express it well?\n\nIt's as though scientists have discovered a new substance.  It's expensive to produce, but hard to detect.  It has no inherent use.  Now, while smugglers might start using Bitcoinium as a medium of exchange, there's nothing about Bitcoinium that makes it worth anything.  It's not connected to any human work beyond the work required to produce it.  So the value of Bitcoinium should tend to hover slightly above the cost of that work, with an added value coming from smuggler demand.\n\nSo if I were going to try to price Bitcoin, shouldn't I pretty much just aim to guess how much that added value is going to be, plus the future cost of mining?  But no one seems to act that way, which is confusing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa0fvh": [
        {
            "Parent ID": "t1_ef9xv7v",
            "Comment ID": "efa0fvh",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 12:33:21",
            "Upvotes": 2,
            "Text": "Bitcoin and fiat would have to co-exist for a very long time. The centralized issues with our traditional currency would be addressed with the decentralization the comes with bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9q1tf": [
        {
            "Parent ID": "t1_ef9mjy0",
            "Comment ID": "ef9q1tf",
            "Author": "Poop_Shame",
            "Date Created": "01-29-2019 10:57:15",
            "Upvotes": 3,
            "Text": "That's the question they can never answer. What incentive would the average person have to go through the extra step of converting their fiat to Bitcoin when they can just spend their fiat with less hassle. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9sge2": [
        {
            "Parent ID": "t1_ef9mjy0",
            "Comment ID": "ef9sge2",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 11:19:20",
            "Upvotes": 0,
            "Text": "Sure, right after you explain how to pay someone a half-cent using your Visa card.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efafdpi": [
        {
            "Parent ID": "t1_efaf0qe",
            "Comment ID": "efafdpi",
            "Author": "BashCo",
            "Date Created": "01-29-2019 14:41:23",
            "Upvotes": 1,
            "Text": "> basically going to increase forever into astronomical levels and buying bitcoin is basically a get rich quick scheme.\n\nNo, you're moving goalposts because you're not able to defend your over-generalizations. At this point I'm trying to decide whether you're trolling or lying.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbcge9": [
        {
            "Parent ID": "t1_efb9ilu",
            "Comment ID": "efbcge9",
            "Author": "vegueria124",
            "Date Created": "01-29-2019 19:55:47",
            "Upvotes": 1,
            "Text": "I feel like that defeats the purpose as one of the attractive aspects of Bitcoin is cutting out intermediaries. I think the solution here is a smart contract that holds the funds in an intermediary address and releases it upon certain events happening (i.e. delivery of product). Even in that scenario though you will have disputes (i.e. product was damaged). Not sure how that would get solved.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbsl8p": [
        {
            "Parent ID": "t1_efb9ilu",
            "Comment ID": "efbsl8p",
            "Author": "aidanlister",
            "Date Created": "01-29-2019 22:55:31",
            "Upvotes": 1,
            "Text": "And to pay for this we could add a 2% surcharge to all transactions, oh wait that’s what we have now with VISA.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efceqzx": [
        {
            "Parent ID": "t1_efb2exz",
            "Comment ID": "efceqzx",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 04:46:53",
            "Upvotes": 1,
            "Text": "This is the sort of thing I don't understand.  You're describing how it could either double in value or else crash even more, but you only give a reason for a future slump in the price: capitulation.  Why do you think the value is going to increase?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcl44c": [
        {
            "Parent ID": "t1_efce6eq",
            "Comment ID": "efcl44c",
            "Author": "noneither",
            "Date Created": "01-30-2019 06:32:00",
            "Upvotes": 1,
            "Text": "No. Not really at all.  \n\nBoth of your notions are better expressed by the notion of \"permissionless.\" Bank money requires strong identity, contracts and a system of forceful jurisprudence.  We don't think about those things but bank money can't work without that.  Bitcoin takes care of all that in a network protocol.  \n\nBitcoin requires no identity, no legal contract and no court enforcement, yet it has never been fraudulent and has a perfect (error free to 15 decimals) transaction record.  So a twelve year old in England can send a ten year old in Zimbabwe money and no one else can prevent it or really even know what really happened.\n\nIndeed, the protocol itself can be modified and new networks can be made.  There are thousands of innovations just like that; most are failed experiments.  \n\nSo illicit is not a broad enough concept and it is a bit derogatory.  Some of the applications are indeed illicit, but that's just a subset of the freedom of permissionless.  \n\nPosturing or signalling is also an inadequate description.  The printing press, the PC, the Internet were highly \"subversive,\" not as gesture but as real movement of the locus of control from some distant authority to the individual.  Same for Bitcoin but even more powerful than the other examples.  \n\nWhat the Internet is doing to traditional media, Bitcoin will do to the banks.  Without banks, government is also radically altered.  \n\nThink of the deep sociological impact of a world where commerce happens without third party consent and little third party knowledge.  Most people are frightened by that, but like it or not, it's arriving.  This is a much deeper impact than even the Internet.  \n\nThis is hardly mere signalling and really a complete reorienting of power.  But sure, signalling happens too.  \n\nIn day to day utility already the uses are substantially broader and deeper.  Free speech platforms, microtransactions, remittance, speculative investment, programmable contracts, automated predictions markets, uncensorable apps.  All valuable, none illict.  \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcgf2o": [
        {
            "Parent ID": "t1_efcemie",
            "Comment ID": "efcgf2o",
            "Author": "medatascientist",
            "Date Created": "01-30-2019 05:16:38",
            "Upvotes": 1,
            "Text": "The way I look at it is not the digital bits your wallet represents but the infrastructure, the continuous development and the network that makes it valued.\n\nThere are literally hundreds of really smart developers constantly improving the tech. If you were to have a Silicon Valley startup with VC fund and hire these folks, that company itself would probably be worth billions in terms of “acquahire”. I guess closest equivalent I can think of as a company would be Visam its’ early days, but think of all the revenue coming out as a dividend and RSUs.\n\nThen you have the network of people who actually use, trade and exchange bitcoin. Though niche there are already few use cases it is better than its’ alternatives like sending money overseas, buying stuff online with a discount etc.\n\nFinally there is a beauty in its’ design. Proof of Work, immutable transaction chain that is decentralized is something we were not used to and even as a small variation worth keeping.\n\nNote that I only keep a very small percentage of my savings as Bitcoin so I do not advocate it as a safe or sound investment. I believe there is value in diversification though so keeping a bit of it sounds like a good idea to me.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa1d19": [
        {
            "Parent ID": "t1_efa0fvh",
            "Comment ID": "efa1d19",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 12:41:25",
            "Upvotes": 2,
            "Text": "I don't see what it is going to take for the masses to want decentralized money like bitcoin. \n\nAre the main issues the ones you already mentioned?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9ru5x": [
        {
            "Parent ID": "t1_ef9q1tf",
            "Comment ID": "ef9ru5x",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 11:13:24",
            "Upvotes": 2,
            "Text": "A lot more steps than just converting when you get started. The talks of wallets and exchanges on here makes my head spin, lol.\n\nI'm genuinely waiting for a reply, I'm really hoping for their sake the answer isn't lower fees.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9sirp": [
        {
            "Parent ID": "t1_ef9sge2",
            "Comment ID": "ef9sirp",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 11:19:58",
            "Upvotes": 3,
            "Text": "Why would I want to pay someone a half cent?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbiajq": [
        {
            "Parent ID": "t1_efbcge9",
            "Comment ID": "efbiajq",
            "Author": "Rainarrow",
            "Date Created": "01-29-2019 20:59:00",
            "Upvotes": 1,
            "Text": "And that “intermediary address” is typically called an escrow account ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcxi4x": [
        {
            "Parent ID": "t1_efbcge9",
            "Comment ID": "efcxi4x",
            "Author": "ColonelEngel",
            "Date Created": "01-30-2019 09:19:31",
            "Upvotes": 1,
            "Text": "Looks like you have no idea what smart contracts are. They do not deal with real-world events, only with crypto. To deal with real world things, like \"delivery\", \"fiat money\", \"exchange rate\", you need a trusted third-party.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbxs71": [
        {
            "Parent ID": "t1_efbsl8p",
            "Comment ID": "efbxs71",
            "Author": "[deleted]",
            "Date Created": "01-30-2019 00:03:43",
            "Upvotes": 1,
            "Text": "Mexico will pay for it ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcxwfv": [
        {
            "Parent ID": "t1_efbsl8p",
            "Comment ID": "efcxwfv",
            "Author": "ColonelEngel",
            "Date Created": "01-30-2019 09:23:57",
            "Upvotes": 1,
            "Text": "Less. Large part of visa fee is to pay for the lack of security. They sell visa card numbers by the millions on the dark web. Visa typically covers those losses, but someone has to pay for that, and it's part of that 2-4% fee.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efcyyii": [
        {
            "Parent ID": "t1_efceqzx",
            "Comment ID": "efcyyii",
            "Author": "racebum",
            "Date Created": "01-30-2019 09:35:04",
            "Upvotes": 1,
            "Text": "You're completely missing what I said. It's not the real price number it's what the price number represents. 6000 was the breakdown area. getting back above that completely changes the psychology of the market. Going lower is going to happen until the market finds the bottom. Right now the psychology of the market is the biggest problem. A lot of people don't feel comfortable because we keep trending lower. Even if we have some unusual situation like the market just kind of makes a hover bottom and begins trending higher you would see it on the moving averages and right now they are all pointing down\n\nIf you really want to educate yourself on price action. There's one guy on YouTube that's worth following and gives daily explanations of what's going on and you can kind of take it in. Krowns crypto cave. The guy was a market-maker on the NYSE that now just trades Bitcoin. Start taking that in on a daily basis. After a few months it will all start making sense",
            "Edited?": "01-30-2019 11:16:12",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdds7o": [
        {
            "Parent ID": "t1_efcl44c",
            "Comment ID": "efdds7o",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 11:57:49",
            "Upvotes": 1,
            "Text": "I am fine with any semantics, and I will use \"permissionless\" in this discussion from now on :)\n\nSo as I understand it, these permissionless uses currently seem to constitute a tiny number of transactions, right?  So you anticipate them increasing by orders of magnitude?\n\nAnd of course, literally the only Bitcoin transactions I have ever engaged in or heard about from anyone I know personally were (a) my own speculation, and (b) the demands of a piece of Chinese ransomware that bricked a computer at a former employer.  So maybe my perception is wrong.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdefys": [
        {
            "Parent ID": "t1_efcgf2o",
            "Comment ID": "efdefys",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 12:05:03",
            "Upvotes": 1,
            "Text": "So you perceive the following inherent value in Bitcoin:\n\n* Human capital invested in its use and success.  This seems speculative to me -- the presumption that it will become more useful in the future since so many people have skin in the Bitcoin game.  Is that right?\n* Actual users.  This is a tiny amount of people, and it seems to me (as an outsider) that most people regularly using bitcoin are doing so for \"permissionless\" purposes, such as selling drugs or tax evasion.\n* It's pretty.  This seems speculative as well: the idea that more people will use it because it's such a nice idea.\n\nI don't want to put words in your mouth, but that seems to be a heap of hope and only a bit of current value.  Doesn't this suggest that the value-add right now from the technology is modest and will keep the price close to mining costs?  Or is the idea that the speculation will be enough to push it back up significantly higher, anticipating widespread further adoption?\n\nThank you for telling me about these things, by the way.  I am learning a lot, even if I am a little skeptical.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa4l90": [
        {
            "Parent ID": "t1_efa1d19",
            "Comment ID": "efa4l90",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 13:08:39",
            "Upvotes": 2,
            "Text": "The ones i mentioned alone are gigantic. The world spends billions in interceptions of transactions and maintenance. But there many other advantages yes. You didn't 'want' the current version of your credit card. It showed up in the mail, as a replacement for your previous card. Technology has a way of creeping into our society. Younger tech savvy generations love the concept of crypto. Bitcoin is a push - NOT pull system. Someone has your credit card they can pull from it without you initiating the transaction. It aligns with pretty much everything else in society in terms of digital, routable content. Our music, our work, our communication, has all turned into digital routable content. The next logical step is money. \nNot to mention, Bitcoin is global and not tied to any one country or region. It's cheap to send, regardless of the amount you're sending. Currently we have many different currencies in the world, but Bitcoin is a global generic for ALL. If you want to convert from one currency to another, there is no middle step you can choose to hold the value in. Sure we have gold, but try liquidating gold in a simple click online. The potential of bitcoin is not even completely discovered, and already it looks incredible. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9xsgu": [
        {
            "Parent ID": "t1_ef9sirp",
            "Comment ID": "ef9xsgu",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 12:10:01",
            "Upvotes": 1,
            "Text": "Loot crates, in-game assets, ad suppression a-la Brave, pay-per-second porn streaming, pay-per-article content, micro tipping, etc. It's a new transaction type, get creative with it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbm0cj": [
        {
            "Parent ID": "t1_efbiajq",
            "Comment ID": "efbm0cj",
            "Author": "vegueria124",
            "Date Created": "01-29-2019 21:39:43",
            "Upvotes": 1,
            "Text": "I'm aware of what an escrow is. You mentioned a third party so it sounded like you were referring to an individual or entity, which would defeat the purpose.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efd0v4p": [
        {
            "Parent ID": "t1_efcxi4x",
            "Comment ID": "efd0v4p",
            "Author": "vegueria124",
            "Date Created": "01-30-2019 09:53:29",
            "Upvotes": 1,
            "Text": "So a smart contract couldn't read information uploaded by one of the parties (i.e. tracking number on a shipment)?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efhq9k5": [
        {
            "Parent ID": "t1_efcxwfv",
            "Comment ID": "efhq9k5",
            "Author": "aidanlister",
            "Date Created": "01-31-2019 22:01:14",
            "Upvotes": 1,
            "Text": "The merchant covers those costs, not VISA. But what's your point? That an eventual crypto solution might have the same features as VISA and charge a fraction of a percent less?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efddjgd": [
        {
            "Parent ID": "t1_efcyyii",
            "Comment ID": "efddjgd",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 11:55:10",
            "Upvotes": 1,
            "Text": "Yes, I agree that I do not understand what you are saying.  I have tried to parse it multiple times. I am doing my best, because this gets at the core of my confusion: why so many people who seem to be smart are saying that Bitcoin will increase drastically in value.  I'm not saying it won't, I'm saying I don't get it.  You *seem* to be describing what you think the market will do and a lot about the psychology of it, but I'm not following.  What mechanism is going to push the price higher?  What is the value of the asset in question that is currently undervalued by market forces?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdl6zs": [
        {
            "Parent ID": "t1_efdds7o",
            "Comment ID": "efdl6zs",
            "Author": "noneither",
            "Date Created": "01-30-2019 13:17:42",
            "Upvotes": 1,
            "Text": "There is a substantial difference between illicit and permissionless beyond a semantic one IMO.\n\nYes I expect orders of magnitude growth in Bitcoin and/ or other blockchain projects.  Number of transactions, amount of value exchanged, but more importantly in the variety of expression of commerce and human means.  \n\nSo as much as we can condemn ransomware, it does give a peak into the future.  Several years ago, WikiLeaks got its donation funding cut off by credit card companies.  Bitcoin donations saved them and the price growth gave them resources.  I think it is fair to declare that Bitcoin played a significant role in altering the course of world affairs.    \n\nMore obviously wholesome, are things like tiny payments to content creators not prone to private platform or payment company censorship.  Or, remittance of labour wage to places like the Philippines, Mexico and Africa free from predatory money transfer companies.  Or automated predictions markets, provably fair gaming, registration of facts like identity or ownership of land and paper assets.  \n\nGet past the price noise.  This is world improving stuff, very important but very unproven, hence the hype boom bust cycles.  \n\nBy the way I appreciate a good conversation with nuance.  Many skeptical people just shout and fling their ignorant bias around.  \n\nI like Bitcoin and I think it is wise to inform one's self and learn the basic mechanics, even if one does not take much stake in it.  \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdf9y5": [
        {
            "Parent ID": "t1_efdefys",
            "Comment ID": "efdf9y5",
            "Author": "medatascientist",
            "Date Created": "01-30-2019 12:14:41",
            "Upvotes": 1,
            "Text": "Ok let’s walkthrough your points, year is 2005 and Facebook is at its’ infancy. I decide to value it because:\n1. Human capital invested in its use and success, like the Harvard dropout or all the smart engineer he hired and our day and night of effort into the platform\n2. Actual users: the tiny amount of university students who simply use it for silly and insignificant reasons\n3. It’s pretty. Actually I am saying the beautiful in a design point of view, so a network where people share stuff on each other in a semi-private point of view (unlike MySpace)\n\nAll three points you make are valid, but as an investor it is not stupid for me to see value for this product either just like Peter Thiel even buying at idea stage, which is much earlier than the point I am referring to here.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa6cy7": [
        {
            "Parent ID": "t1_efa4l90",
            "Comment ID": "efa6cy7",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 13:23:29",
            "Upvotes": 2,
            "Text": "I agree with some things but don't pretend that someone is going to steal money off my credit card and get away with it. The argument could be used against bitcoin because people have lost tons of money on exchanges. Visa and Mastercard will help you out if anyone steals money from your card, who helps with the stolen bitcoin? I know, I know - proper wallets, it will be better in the future, yadda yadda. But that's why it is confusing to people now and bitcoin is not superior for folks.\n\nI've seen many young tech savvy people say they don't care about bitcoin. Don't paint a picture that the young people in the know all support bitcoin and as soon as others understand it, it will become mainstream. \n\nAs I said before money is already digital, I never use physical cash. This is something that I constantly see on this sub, you talk about bitcoin as if it's the only digital currency and traditionally currency is still just paper, physical transactions.\n\nIf traditional currency can become cheap to send to different countries then all bitcoin really has going for it is that it isn't tied to any particular country or region. \n\nBitcoin is a bet that in the future the masses will want to use it over traditionally currency. But if traditionally currency continues to be more digital and improves with transfers etc. People like you are going to have an awfully hard time convincing others to ditch what they have been using forever and to use bitcoin.\n\nWhat about major corporations and governments? If they don't support bitcoin is it the masses who are going to demand bitcoin as the currency?\n\nThere is so much that would need to happen for bitcoin as a main currency to happen. It is a long shot and a tough bet. People on this sub all talk as if it's a guarantee.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ef9y5zd": [
        {
            "Parent ID": "t1_ef9xsgu",
            "Comment ID": "ef9y5zd",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 12:13:26",
            "Upvotes": 1,
            "Text": "I don't see why those things would need to be less than a cent, lol. You could get or tip or whatever 100x before you reach a dollar, which isn't that much money.\n\nI do not see the need to cut a cent in half or more. I don't think anyone really thinks 1 cent is a significant amount of money. I would walk past pennys on the ground all the time as a kid.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efbm3dp": [
        {
            "Parent ID": "t1_efbm0cj",
            "Comment ID": "efbm3dp",
            "Author": "Rainarrow",
            "Date Created": "01-29-2019 21:40:40",
            "Upvotes": 1,
            "Text": "I agree a traditional “escrow” requires trust between the 2 parties involved in the transaction and the escrow, which defeats the trustless nature of crypto transactions. Good point. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "effcy64": [
        {
            "Parent ID": "t1_efd0v4p",
            "Comment ID": "effcy64",
            "Author": "ColonelEngel",
            "Date Created": "01-31-2019 03:39:50",
            "Upvotes": 1,
            "Text": "In that case you will have to trust the party that uploads the information. And tracking number doesn't say anything about the content of the package.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efi9ul9": [
        {
            "Parent ID": "t1_efhq9k5",
            "Comment ID": "efi9ul9",
            "Author": "ColonelEngel",
            "Date Created": "02-01-2019 04:09:23",
            "Upvotes": 1,
            "Text": "Point is that bitcoin is more secure and therefore cheaper.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efddy0j": [
        {
            "Parent ID": "t1_efddjgd",
            "Comment ID": "efddy0j",
            "Author": "racebum",
            "Date Created": "01-30-2019 11:59:33",
            "Upvotes": 1,
            "Text": "An extremely limited Supply and a lot of interested people. A lot of people like the chase price good what usually goes on or what has gone on since Bitcoin was created is people will accumulate them. that starts taking more and more Supply off the market. Eventually you get to this point where the price begins being pushed up. People take notice and then they start buying. this can feed on itself for years. Same thing happens on the downside which is what we are currently experiencing. It also happens with gold and silver. Even real estate\n\nThere is quite a lot of money on the sidelines waiting for an uptrend to begin\n\nWatch krown for a few months it will start making sense to you\n\nYou're never going to get this in a couple of Reddit comments",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdmd5b": [
        {
            "Parent ID": "t1_efdl6zs",
            "Comment ID": "efdmd5b",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 13:29:34",
            "Upvotes": 1,
            "Text": "We agree on the facts of the transactions involved, just disagree about what to call them in terms of connotation and categorization.  That's literally a semantic discussion.  If we call these transactions illicit, permissionless, or boggleroggle, it doesn't change any of the facts, only the emotional import we assign to them.  But I am seriously happy to call them whatever you want because of that.\n\nSome of the things you offer as possible in the future are interesting, and would seem to justify a higher price than would be strictly dictated by cost of production plus current utility.  But it's hard to imagine that would spike drastically higher, since very little of this is occurring despite bitcoin being widely known now for years.  At this point, some such businesses should probably already be operating.  Is there an automatic prediction market?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdn37m": [
        {
            "Parent ID": "t1_efdf9y5",
            "Comment ID": "efdn37m",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 13:36:50",
            "Upvotes": 1,
            "Text": "I agree that in its infancy, Facebook didn't have much promise in terms of inherent value.  Most of the time, it would only make sense to invest in a Facebook-like project if you can do so on terms that promise a huge payout for a relatively small investment.  Lay enough bets like that, and the few successes will cover your losses.\n\nOn the other hand, the fact that Facebook seemed very unlikely to succeed doesn't mean that all businesses that seem unlikely to succeed are a good investment, right?\n\nAs far as I can tell, wouldn't a better analogy be Google+?  A ton of people knew about it and could use it if they chose, but only a small group of people did, even with all the talent backing it?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efafx1i": [
        {
            "Parent ID": "t1_efa6cy7",
            "Comment ID": "efafx1i",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 14:46:05",
            "Upvotes": 1,
            "Text": "I don't need to convince anyone of anything. As I said, money is not digital today, you're confusing the transfer of currency over digital medium with the entity itself actually being digital. The fact is bitcoin is significantly less expensive and significantly more efficient. I work in technology with network security and have been involved with countless tech project over the years. I personally don't see how bitcoin will not continue to grow as it has done for the first 10 years. In my experience efficiency is not always obvious to the end user but implemented and synchronized with the social collective because of the savings and advantages in the back end. I grew up without internet and as it became mainstream, nobody asked for it ...it just became what it did because of it's benefit to the social collective.\nMy advice to you is to not buy crytpo because you don't seem to be onboard. So people with my perspective will buy in, people with yours will not. If it doesn't continue to evolve, then I guess it was not meant to be. I'll still have plenty of other investments and interests to focus on. All the best!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efahz6x": [
        {
            "Parent ID": "t1_efa6cy7",
            "Comment ID": "efahz6x",
            "Author": "Nursing_guy",
            "Date Created": "01-29-2019 15:03:49",
            "Upvotes": 1,
            "Text": "Yes they get away with it. Your credit card company reimburses you but much of the time they aren't going after the fraud. You are more valuable as a customer than the money that got stollen.\n\nAnd you are overestimating your role as an end-user when it comes to deciding the shape of financial systems. Your convenience with a credit card came from credit card providers developing services to compete with each other for you to be their customer, but the initial technology wasn't for the average Joe.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa0gdu": [
        {
            "Parent ID": "t1_ef9y5zd",
            "Comment ID": "efa0gdu",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 12:33:28",
            "Upvotes": 1,
            "Text": "It will make more sense when it enters mainstream usage. Stay tuned.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efidfef": [
        {
            "Parent ID": "t1_efi9ul9",
            "Comment ID": "efidfef",
            "Author": "aidanlister",
            "Date Created": "02-01-2019 05:47:35",
            "Upvotes": 1,
            "Text": "Bro VISA sponsored the olympics, you don’t think they could cut down the marketing spend a little?\n\nIt costs VISA nothing per transaction, if they wanted to make the transaction cost less than BTC they could do it overnight. Think basics- what is the energy cost of a BTC vs VISA transaction.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdnc32": [
        {
            "Parent ID": "t1_efddy0j",
            "Comment ID": "efdnc32",
            "Author": "alexanderdeeb",
            "Date Created": "01-30-2019 13:39:18",
            "Upvotes": 1,
            "Text": "You still seem to mostly be saying that people are interested in it, but not anything about its actual value (since people can be interested in things for all sorts of reasons, good or bad).  If you believe the value cannot be explained in Reddit comments, though, I respect that.  Thank you for trying! :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efdots0": [
        {
            "Parent ID": "t1_efdmd5b",
            "Comment ID": "efdots0",
            "Author": "noneither",
            "Date Created": "01-30-2019 13:54:25",
            "Upvotes": 1,
            "Text": "There are two automated predictions markets, Augur and Gnosis.  I haven't paid attention to them in awhile to be honest. \n\nI find illicit to connotate illegal or morally rejected.  Alot of financial transactions are not permitted due to other reasons than those.  \n\nPermitted, Legal and moral are not much the same.  I will go with boggleroggle.  Permissionless isn't a great term either as it still makes reference to permission.  Bitcoin has no frame of reference at all that even considers permission.  Anyway...\n\nAlso... mining cost follows price through a  process known as difficulty adjustment. The mining rewards are in Bitcoin so the value of the rewards is a direct function of current Bitcoin price.  Since it is a permissionless competition to solve the mining puzzle, mining tends to be marginal.  The network is designed to keep a fairly constant block production rate.  So as hashrate increases or decreases, the difficulty to solve the puzzle automatically adjusts with it to keep the block production rate fairly constant.  The net of all that is that the cost to produce fairly well mimics the price of the coin with difference due to price changes and the local circumstances of the miner in question.  \n\nSo the value is the demand value and mining costs follow. They are not fundamental like say gold, if that makes sense.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efe26gm": [
        {
            "Parent ID": "t1_efdn37m",
            "Comment ID": "efe26gm",
            "Author": "medatascientist",
            "Date Created": "01-30-2019 16:13:20",
            "Upvotes": 1,
            "Text": "I am not saying because they are both unlikely to succeed that they are similar. I’m saying they are similar despite both were seen unlikely to succeed.\n\nFacebook is a better example than g+. It created the new paradigm and had the network. G+ tried to add few pretty features and move the masses. Bitcoin also created a new paradigm, a decentralized exchange with a network of dedicated users. Comparing BitcoinCash to g+ is more accurate.\n\nWhat people miss is that Bitcoin is still young. 10 years might sound a lot to you, but in this domain where current banking system is established for almost half a millennia it is pretty young. Only 50million users out of potentially billions that might (a big if) be using it. Technically 20 years down the road anybody with an IoT device can use Bitcoin as a side wallet if there are enough incentives (again another big if).\n\nNow I already underlined this is a high risk investment, thus should be allocated a small part of your portfolio. If I were investing in the next Facebook I would also do the same.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efaqd3c": [
        {
            "Parent ID": "t1_efafx1i",
            "Comment ID": "efaqd3c",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 16:22:35",
            "Upvotes": 1,
            "Text": "You too!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efal7fa": [
        {
            "Parent ID": "t1_efahz6x",
            "Comment ID": "efal7fa",
            "Author": "cryptogrip",
            "Date Created": "01-29-2019 15:33:52",
            "Upvotes": 1,
            "Text": "Excellent points. Also, with bitcoin the cost of reimbursing and detecting fraudulent action is reduced to a tiny fraction of what it is with the current system. Bitcoin is a self maintaining accounting system on a network that eliminates the middlemen and is facilitated by exceptional math. Once these benefits become realized on a global level there will be no turning back in my opinion.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efau1cd": [
        {
            "Parent ID": "t1_efahz6x",
            "Comment ID": "efau1cd",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 16:59:12",
            "Upvotes": 1,
            "Text": "Get away with it in the sense that your money is gone.\n\nYour point is fair enough in the second paragraph but that really has nothing to do with bitcoin. \n\nAre you saying that bitcoin is going to reshape the financial system and we as consumers will be offered things like credit cards made simple? Except instead of traditional currency it is bitcoin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa1xkz": [
        {
            "Parent ID": "t1_efa0gdu",
            "Comment ID": "efa1xkz",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 12:46:27",
            "Upvotes": 2,
            "Text": "See this is the problem with a belief, like your belief in bitcoin. You don't have any real solid argument why people should use it. You have belief, the whole thing is pure speculation. \n\nYou're main point is that it can be broken down into tiny amounts and traditional currency can only be one cent.\n\nShow me one person in the first world who has a penny on them who isn't willing to part with it for something. Then, that same person would be willing to pay half a cent because 1 cent is just too expensive.\n\nYour point and example lacks logic. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efau9f2": [
        {
            "Parent ID": "t1_efal7fa",
            "Comment ID": "efau9f2",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 17:01:31",
            "Upvotes": 1,
            "Text": "Is there a chance that traditional currency could improve its system? Or is there no way to make it better at this point and it's only a matter of time before everyone sees how much better bitcoin is?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efc6jql": [
        {
            "Parent ID": "t1_efau1cd",
            "Comment ID": "efc6jql",
            "Author": "Nursing_guy",
            "Date Created": "01-30-2019 02:22:03",
            "Upvotes": 1,
            "Text": "That would be the jist of it. Though I suspect trying to envision the future of technology built on bitcoin is going to be about as acurate as back to the future, star trek and other sci-fi projections. Bitcoin is the technological foundation for services *yet to be imagined,* and unlike current financial systems, in which competition can only be engendered by banks and corporations within very narrowly defined margins, anyone with the skill and the vision will be able to create financial products for use globally.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa75ho": [
        {
            "Parent ID": "t1_efa1xkz",
            "Comment ID": "efa75ho",
            "Author": "mrxsdcuqr7x284k6",
            "Date Created": "01-29-2019 13:30:20",
            "Upvotes": 1,
            "Text": "You're correct, a penny is worth very little by itself and is easy to spend on a whim. Pennies can also add up to a meaningful amount when thousands or millions of people are spending them. Microtransactions make it possible to make large numbers of very small transactions that are impossible with credit cards or cash. This opens up use cases that do not exist today. Do you understand my logic?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "efa7evk": [
        {
            "Parent ID": "t1_efa75ho",
            "Comment ID": "efa7evk",
            "Author": "BuckNasty1616",
            "Date Created": "01-29-2019 13:32:37",
            "Upvotes": 1,
            "Text": "I see the logic but the point is that it's not necessary. \n\nTry inventing something that isn't necessary and see how many invest in it. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}