{
    "ecl3g1l": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecl3g1l",
            "Author": "SIT_DOWN_AND_STFU",
            "Date Created": "12-26-2018 09:00:32",
            "Upvotes": 7,
            "Text": "I'm going through Stadicus' raspibolt guide using Bitcoin core v0.17.0.1. I'm an idiot and missed the detail about setting `txindex=1`. I managed to sync the whole blockchain but do I need to resync the whole blockchain from scratch? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm6peo": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecm6peo",
            "Author": "claytonkb",
            "Date Created": "12-26-2018 17:33:51",
            "Upvotes": 14,
            "Text": "General rant about r/Bitcoin...\n\nI am an observer of Bitcoin (OK, digital currencies) from before there *was* Bitcoin (full disclosure: I do not own any Bitcoin). The only cryptos that existed in those days were in academic papers by David Chaum, or centralized schemes like e-gold, GoldMoney, or Liberty Dollar. That was the state of the Universe circa 2006 when interest in developing a new, distributed, digital currency was starting to bubble up from many corners of the Interwebz.\n\nI see a lot of posts on r/Bitcoin along the lines that, \"we (the Bitcoin community) need to do a better job popularizing Bitcoin\"... the implication being that if Bitcoin doesn't get popular, it will fail. This could not be further from the truth. The \"big idea\" behind Bitcoin is that people will naturally migrate to using higher quality money *because it is higher quality*. Fads come and go. Bitcoin is not another Cabbage Patch doll. It's not another Beanie Babies. It's a digital asset that can be instantly and (almost) trustlessly exchanged anywhere in the world, an asset that is not beholden to the policies of any government agency, nor any private entity.\n\nIn this way, Bitcoin really is the digital analogue of gold. Of course, it is not *literally* gold because a solar EMP could break the Bitcoin network but not gold. There are some important differences but the analogy is a good one. The importance of monetary gold & silver is that they are monies that rely on laws that cannot be fiddled by governments nor manipulated by private sharks. The laws of physics are immune to the fads of political movements and the schemes of con-men. Bitcoin is built on a different set of laws -- the mathematics of cryptography, the laws of distributed networks and the laws of human action (self-interested actors involved in peaceful exchange) -- but these laws share the property of the laws of physics that make gold & silver such important monetary goods: they cannot be fiddled by government agencies nor by well-resourced private actors.\n\nI am posting this rant because I feel like venting, not because it can change anything. Some people will go on characterizing Bitcoin as just the latest pump & dump scheme. So be it. But those who are using or HODLing Bitcoin because they believe it is possible for a sub-economy to emerge that is based on sound money should understand that the long-run success of Bitcoin has nothing to do with what is *popular*, any more than the laws of physics have anything to do with what is popular. Short of a solar EMP powerful enough to take down the majority of satellites and all other digital electronics, Bitcoin is going to go on being Bitcoin no matter what anybody thinks about it. *That* is why you should hold Bitcoin. The rest of the BS is just line noise.",
            "Edited?": "12-26-2018 17:37:40",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecko7gq": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecko7gq",
            "Author": "ddas244",
            "Date Created": "12-26-2018 02:33:06",
            "Upvotes": 6,
            "Text": "Has Bitcoin brought more joy or sorrow overall?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclg3rt": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eclg3rt",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 12:04:21",
            "Upvotes": 3,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclknyl": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eclknyl",
            "Author": "madmax727",
            "Date Created": "12-26-2018 13:00:18",
            "Upvotes": 3,
            "Text": "I see photos posted of bitcoin machines on here occasionally. I am not an expert on bitcoin but do believe it to possible be a currency of the future so I try to keep up with it. I have never seen these bitcoin machines and have no idea what they do. What are these bitcoin machines? What exactly do they do and how are they used? I’m sure these are elementary questions but I’d appreciate the help.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclo10w": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eclo10w",
            "Author": "RulerZod",
            "Date Created": "12-26-2018 13:40:45",
            "Upvotes": 2,
            "Text": "Anyone else get the impression the fed has already started quantitive easing with todays day after christmas stock market rally",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl410d": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecl410d",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 09:10:34",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckns3q": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eckns3q",
            "Author": "SteelDiscipline",
            "Date Created": "12-26-2018 02:22:56",
            "Upvotes": 1,
            "Text": "Down below $3500 by year's end.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn61dj": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecn61dj",
            "Author": "BoogieMcBoogerson",
            "Date Created": "12-27-2018 02:34:42",
            "Upvotes": 1,
            "Text": "Trolls is all you will find here.  See if you would have BCH you may find that the people are kinder nicer and not as douchey as these fucktards ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecli5v0": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecli5v0",
            "Author": "matthewryancase",
            "Date Created": "12-26-2018 12:29:55",
            "Upvotes": 1,
            "Text": "Hello Smart Community Members and Mods, \n\nQuestion, trying to DYOR and find out about bitcoin services inc. - My friends dad an older guy who doesn't know about crypto or BTC that much has some $ tied up and we are trying to find out how legit they are. We are firm believers in keeping our BTC off exchanges or third party custody and Nano it up. Rule 1 - Not Your Keys.... \n\n&#x200B;\n\nContinuing to source the web but I know we got some mad jedi smart folks here in the sub so any help would be appreciated. Thanks.  - Long Bitcoin Short The Banks! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclmhnp": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eclmhnp",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 13:22:19",
            "Upvotes": -7,
            "Text": "I see Japan has reinstated whaling.  Good.  Those boys don't back down because libtards on Facebook and Twatter try to force them to do so.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckvdi9": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eckvdi9",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 05:46:56",
            "Upvotes": -5,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn025q": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "ecn025q",
            "Author": "tommygunz007",
            "Date Created": "12-27-2018 00:25:28",
            "Upvotes": 0,
            "Text": "If Bitcoin never gets above $6,000 is it a success or failure? \n\nAnd what I mean by this, is that many of you look it as a way to make money. Some of you see it as an experiment. Some of you see it as a currency. \n\nWhat is the definition of failure _for you_? This means, if you buy in at $3700, and it goes to $30,000 and then back to $3700 a year later, you are net sum zero. If your money makes you no money as compared to what a stock market investment would give you (like a fund, CD, IRA, or something with a low return), is it a failure for you? And if so, how long would you hold it if you have a net sum of zero? A year? 5 years? How long would you HODL before you consider it a loss of your profit potential?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclzq2c": [
        {
            "Parent ID": "t3_a9mgdl",
            "Comment ID": "eclzq2c",
            "Author": "SorryBodybuilder1",
            "Date Created": "12-26-2018 16:06:23",
            "Upvotes": -5,
            "Text": "convince me not sell. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecliu0z": [
        {
            "Parent ID": "t1_ecl3g1l",
            "Comment ID": "ecliu0z",
            "Author": "Septem_151",
            "Date Created": "12-26-2018 12:38:06",
            "Upvotes": 4,
            "Text": "Yes. :/",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmv6y7": [
        {
            "Parent ID": "t1_ecm6peo",
            "Comment ID": "ecmv6y7",
            "Author": "gblackdragon",
            "Date Created": "12-26-2018 23:06:34",
            "Upvotes": 2,
            "Text": "Gold in addition to be a storage of value it is also a commodity. Which means it is consumed. It is bought in bulk for the electronics industry and jewellery store. There will always be demand for gold as long as electronics survives and people like wearing fancy stuff.\n\nBitcoin on the other hand. Yes U can buy it to store value but look how that went this year. U can buy it to act as payment (by the way 99% of people never spend it on shops but instead speculate and hodl). But demand for it to be used as payment is not there. There are no exclusivity case where it has to be Bitcoin, but instead your standard visa/MasterCard does it well already.\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmp5sy": [
        {
            "Parent ID": "t1_ecm6peo",
            "Comment ID": "ecmp5sy",
            "Author": "tabbouleh_rasa",
            "Date Created": "12-26-2018 21:43:18",
            "Upvotes": 2,
            "Text": "Exchange value: the potential value with which you could derive from trading/bartering said object.\n\nGold will always have exchange value because:\n\n1. It’s pretty.\n2. It’s shiny.\n3. It doesn’t corrode.\n4. It’s a really good semiconductor!! This is more important than at first appears. Gold makes your iPhone function.\n5. I mean, it’s really, really, really pretty. Have you seen that shit? It looks boss. No matter how much actual utility value it has (see: your iPhone) this is the primary reason gold has value. People will always be willing to trade shit for gold because having shit made of gold gives you social status, aesthetics notwithstanding.\n\nIf Bitcoin does not become popular, it will have exactly: zero exchange value. It will be simply what it is: a series of random numbers, just a nonce of a hash of a nonce of a hash of a nonce of a hash.\n\nYou know why it’s called a nonce right? Because it’s NONSENSE. Encryption is simply taking data and turning it into NONSENSE. It’s just that the mathematical complexity of nonsense can be used, in the form of blockchain, to decentralise secure ledger keeping.\n\nBitcoin, like fiat currency, has no value outside of socially constructed ones. Gold not only always and forever will have utility value, but that utility value (it’s pretty!) gives it, always and forever, socially constructed exchange value.\n\nBitcoin is not at all like gold.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmyrp9": [
        {
            "Parent ID": "t1_ecm6peo",
            "Comment ID": "ecmyrp9",
            "Author": "Crude_Answer",
            "Date Created": "12-27-2018 00:03:50",
            "Upvotes": 1,
            "Text": ">the implication being that if Bitcoin doesn't get popular, it will fail.\n\nThis is where we seriously need to define the word fail. If you define fail as Bitcoin hitting a flat 0, then I would agree with your points. That is almost impossible with how Bitcoin works!\n\nIf you define fail as Bitcoin's price forever being below a particular exchange value moving forward, then that is a whole nother story (i.e. sub 1 Bitcoin : $4,000 USD forever).\n\n&#x200B;\n\nIf you define fail the latter way, I would disagree with your post simply based on the point that the very strong cryptography of Bitcoin can also mean no way of recovering it if you simply lose your key in some accident or if it gets stolen. Once it's gone, it is gone forever since it is not backed by the government or insured by any third party. That alone is just huge, especially if most of your net worth is in Bitcoin. You **need** to be tech savvy to live in a world where Bitcoin is used as the main currency, or you will get exploited or hacked by the numerous cyber thieves out there. To live in a world where Bitcoin is used as the main currency is to live in a constant paranoia state of fear, having to constantly watch out for yourself because no one else can really be trusted with the key(s) to your life savings.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn0d14": [
        {
            "Parent ID": "t1_ecm6peo",
            "Comment ID": "ecn0d14",
            "Author": "tommygunz007",
            "Date Created": "12-27-2018 00:30:26",
            "Upvotes": 1,
            "Text": "Just to argue your point, I can go to China, and own printing presses, and print US Fiat, pay HSBC to fly to China and load the plane full of money (as they did with Drug Cartels) and fly back to the USA and launder that money into the bank, and then buy and dump bitcoin over and over and over. The cash is fake; printed fiat; used to alter the currency price. \n\nNow, let's remove me from the Equation. Let's say there is a duplicate press the CIA is operating in secret. Let's say the CIA is also partnering with the Winklevoss Brothers to sell faux currency to drive it lower, only to buy it back, creating a net sum of zero btc but also shorting the price and making money. It's being manipulated all.the.time. by governments and private investors. It's no different. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmm0rh": [
        {
            "Parent ID": "t1_ecm6peo",
            "Comment ID": "ecmm0rh",
            "Author": "btcoptic",
            "Date Created": "12-26-2018 20:54:16",
            "Upvotes": 0,
            "Text": "So what's your contention? That people should hold it because it is \"solid\", even if it never becomes popular and stays at the same price in perpetuity?\n\nMy contention would be that if the possibility of it being \"popular\" at some stage did not exist, it would lose 99% of its value, because I'd estimate that 99% of holders are here for the purpose of investing in something they expect to appreciate significantly.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclbm5w": [
        {
            "Parent ID": "t1_ecko7gq",
            "Comment ID": "eclbm5w",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 11:03:50",
            "Upvotes": 7,
            "Text": "Depends on the year bought. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckpddv": [
        {
            "Parent ID": "t1_ecko7gq",
            "Comment ID": "eckpddv",
            "Author": "ThatMorningAlarm",
            "Date Created": "12-26-2018 03:03:21",
            "Upvotes": 8,
            "Text": "Understanding what it is and could bring: joy.\n\nBitcoin in 2018: sorrow.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecljyqt": [
        {
            "Parent ID": "t1_eclg3rt",
            "Comment ID": "ecljyqt",
            "Author": "mtdewrulz",
            "Date Created": "12-26-2018 12:51:55",
            "Upvotes": 8,
            "Text": "Seems a bit premature to call it a sucker's rally, doesn't it?  If we hold around here, it'll be a higher-low on the daily.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmxv4u": [
        {
            "Parent ID": "t1_eclknyl",
            "Comment ID": "ecmxv4u",
            "Author": "gblackdragon",
            "Date Created": "12-26-2018 23:48:31",
            "Upvotes": 2,
            "Text": "They are ATM machine with large spreads to buy and sell bitcoin. The large spreads allows the investor of the Bitcoin machine to make money. Think of it as exchanging foreign money at airport . Just don't do it unless U really have to. U are better off selling & buying it at big exchanges which have relatively small spreads. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclra3x": [
        {
            "Parent ID": "t1_eclknyl",
            "Comment ID": "eclra3x",
            "Author": "CommunistAndy",
            "Date Created": "12-26-2018 14:20:09",
            "Upvotes": 2,
            "Text": "They are basically like bitcoin ATMs, you can buy and sell bitcoin using them... ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm9xh1": [
        {
            "Parent ID": "t1_eclknyl",
            "Comment ID": "ecm9xh1",
            "Author": "tommygunz007",
            "Date Created": "12-26-2018 18:14:15",
            "Upvotes": -1,
            "Text": "Digital Gold! And we know how many people pay with gold.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm3a3m": [
        {
            "Parent ID": "t1_eclo10w",
            "Comment ID": "ecm3a3m",
            "Author": "MonsieurReynard",
            "Date Created": "12-26-2018 16:50:40",
            "Upvotes": 3,
            "Text": "How would that work?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclo7qo": [
        {
            "Parent ID": "t1_eclo10w",
            "Comment ID": "eclo7qo",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 13:42:59",
            "Upvotes": 2,
            "Text": "I sympathise with the Fed.  They can't deal minute to minute with the sheer stupidity and randomness of Trump's late night tweets.\n\nI have never seen such incompetence and duplicity at the heart of the government of an advanced nation.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl9pw9": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "ecl9pw9",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 10:37:55",
            "Upvotes": 6,
            "Text": "It is stuck at under 0.05 BTC and is a failed project due to its shameful dishonesty and sharp practice.  It has tiny volumes \nand a low price, meaning that it may very easily and cheaply be manipulated by liars like Ver and Woo to suit their purposes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl4lb0": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "ecl4lb0",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 09:20:21",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecms07o": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "ecms07o",
            "Author": "FortuitousIdiom",
            "Date Created": "12-26-2018 22:23:08",
            "Upvotes": 2,
            "Text": "BCH/BSV are failed projects. Volumes are so low and the network so weak as to make it easily manipulable, as evidenced by the panicked last-minute addition of checkpoints to BCH that has now compromised the decentralized nature of the network and introduced new threats. Ver & CW, either intentionally or no, have created cults of personality. CW unwisely tried to strengthen his cult by claiming he is Satoshi and then naming his project Satoshi's Vision. Their creations are personal vehicles to deliver riches and fame, not a force of nature independent of a single person as Bitcoin was designed. Ultimately, this can only fail.\n\nBoth have failed to understand why Satoshi Nakamoto was pseudonymous and withdrew into obscurity once the work was done. \"The superior man acts and expects nothing, accomplishes and does not linger, has no desire to seem worthy.\" ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclaef3": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "eclaef3",
            "Author": "1561KWP",
            "Date Created": "12-26-2018 10:47:16",
            "Upvotes": 2,
            "Text": "I'll guess some pulled out of BTC and put this money into BCH.  (No link required for guessing!)\n\n\\#2 guess: There are coin-flippers out playing short-term.  To me this is known stupid.  \n\n\\#3 guess: There is not always going to be a relationship between items that seem like they should.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl56j8": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "ecl56j8",
            "Author": "silentGeneral",
            "Date Created": "12-26-2018 09:29:52",
            "Upvotes": 1,
            "Text": "Lots of various reasons, they can't act the same way:) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm5994": [
        {
            "Parent ID": "t1_ecl410d",
            "Comment ID": "ecm5994",
            "Author": "againstmethod",
            "Date Created": "12-26-2018 17:16:13",
            "Upvotes": 1,
            "Text": "Over longer terms bcash is down much more than Bitcoin. Perhaps it's just oversold. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckutrg": [
        {
            "Parent ID": "t1_eckns3q",
            "Comment ID": "eckutrg",
            "Author": "deathrollll",
            "Date Created": "12-26-2018 05:33:38",
            "Upvotes": 7,
            "Text": "You can add your BTC predictions to the price on January 31, also you can participate in other predictions:\n\n[https://www.wings.ai/project/0x4f9272d80f47e8b457a67bc31d06574bfaf6340e](https://www.wings.ai/project/0x4f9272d80f47e8b457a67bc31d06574bfaf6340e)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckpr5v": [
        {
            "Parent ID": "t1_eckns3q",
            "Comment ID": "eckpr5v",
            "Author": "FortuitousIdiom",
            "Date Created": "12-26-2018 03:13:14",
            "Upvotes": 3,
            "Text": "Exciting to watch what will happen. Feels like we may have already tested higher after yesterday's lows and have been rejected. Realistically I think in the near term 3500$ is probable if 3700s don't hold, with a chance to test lower limits again. Or maybe the stock market just has me more pessimistic than usual. Just gonna sit on some cash and wait it out.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmg1ca": [
        {
            "Parent ID": "t1_ecli5v0",
            "Comment ID": "ecmg1ca",
            "Author": "TallPaulsBigBalls",
            "Date Created": "12-26-2018 19:28:27",
            "Upvotes": 1,
            "Text": "From the lack of comments and downvotes people here don’t know about your question. My guess is if your friends Dad doesn’t have the keys, well you know.  I bought mine privately so I don’t know about this firm. Sounds sketchy, be careful ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclz7nj": [
        {
            "Parent ID": "t1_eclmhnp",
            "Comment ID": "eclz7nj",
            "Author": "Poop_Shame",
            "Date Created": "12-26-2018 15:59:55",
            "Upvotes": 7,
            "Text": "Killing whales to stick it to the libs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclrcvr": [
        {
            "Parent ID": "t1_eclmhnp",
            "Comment ID": "eclrcvr",
            "Author": "TheSqueakSquad",
            "Date Created": "12-26-2018 14:21:07",
            "Upvotes": 2,
            "Text": "/s? I have a hard time imagining that hunting whales is more productive than alternatives if you account for negative externalities. I dgaf about sob stories either, but I think reasonable economics suggests not taking out whales.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm71me": [
        {
            "Parent ID": "t1_eclmhnp",
            "Comment ID": "ecm71me",
            "Author": "LemosineRidin",
            "Date Created": "12-26-2018 17:38:00",
            "Upvotes": 2,
            "Text": "I’m a little lost by this ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckxghc": [
        {
            "Parent ID": "t1_eckvdi9",
            "Comment ID": "eckxghc",
            "Author": "AussieBitcoiner",
            "Date Created": "12-26-2018 06:42:00",
            "Upvotes": 5,
            "Text": "well I must be fucking ***nuts***. Quick, someone tie me up and send me to the funny farm  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckw2ut": [
        {
            "Parent ID": "t1_eckvdi9",
            "Comment ID": "eckw2ut",
            "Author": "damchi",
            "Date Created": "12-26-2018 06:04:33",
            "Upvotes": 8,
            "Text": ">No sane person in the entire world uses btc as a payment method.\n\nTHANK GOD THERE ARE SO MANY OF US - THE INSANE ONES - OUT THERE THEN. ",
            "Edited?": "12-26-2018 08:41:10",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckx3xa": [
        {
            "Parent ID": "t1_eckvdi9",
            "Comment ID": "eckx3xa",
            "Author": "FortuitousIdiom",
            "Date Created": "12-26-2018 06:31:59",
            "Upvotes": 1,
            "Text": "...but my Mother had me tested.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn22pm": [
        {
            "Parent ID": "t1_ecn025q",
            "Comment ID": "ecn22pm",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-27-2018 01:03:00",
            "Upvotes": 1,
            "Text": "Bitcoin’s relation to the USD is not really a great metric, is it?  I mean right away you’re framing the discussion in terms of speculation and not utility.  \n  \nIf BTC is to succeed as a currency only one thing matters: **adoption**. How many transactions is the network processing? How viable is it for day-to-day use? It will be a success when there are products **natively priced in btc**. Right now there are no real-world products or services that have a predictable, stable price in BTC.  If that emerges then BTC will be a success.  If there’s a simple, clear, and convincing use case where BTC is better because of practical reasons outside of  “teh evil government fiat” or “hodl because you’ll see”. Right now that is sorely missing. \n  \nI think we can consider BTC a failure if “real” transactions decline over an extended period. (I say real because raw transaction numbers are too easily manipulated). It’s a failure if the number of miners declines over an extended period.  If it turns out that it really is mostly used for pump-and-dumps and money laundering. Then it may find it’s niche but it will just be small-time, and there’s no reason for coins to cost more than like, 40 bucks.\n  \nAnd in my opinion it will never succeed as long as we hear stories *every week* of people being swindled due to corruption, collusion, weak passphrases or any other security weakness.  The fact that a) there are no products or services “natively” traded in BTC and b) there is a VERY LARGE AND SERIOUS RISK that you will lose your coins if you make the tiniest misstep (or even though no fault of your own) makes it hard to recommend.  \n  \nAnd finally  there is still the possibility of a “DAO attack writ large” emerging. A global seismic disruption so severe it fatally damages the world’s trust in the integrity of the whole system. This could be a mining bug, a successful 51% attack, discovery of a way to double-spend, a monstrous botnet attack or even just good old-fashioned market manipulation. Sure the probability is small, but not that small.  I’d say there’s a good 50% chance of a major integrity-test within the next five years. If BTC faces such a test and recovers then it may gain enough trust to succeed.  But having living among tech since the mid-80s, I’m not optimistic.\n",
            "Edited?": "12-27-2018 01:06:10",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm0d30": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecm0d30",
            "Author": "ChapDog",
            "Date Created": "12-26-2018 16:14:40",
            "Upvotes": 5,
            "Text": "HODL doesn't mean sell! Ok I tried ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm7g3j": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecm7g3j",
            "Author": "dabears041",
            "Date Created": "12-26-2018 17:43:01",
            "Upvotes": 4,
            "Text": "Stop being a coward. Did that work?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm3hue": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecm3hue",
            "Author": "The-Physicist",
            "Date Created": "12-26-2018 16:53:24",
            "Upvotes": 8,
            "Text": "I dunno about you but I’m buying as much as I can at these levels.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm6hi2": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecm6hi2",
            "Author": "quinsolo",
            "Date Created": "12-26-2018 17:31:13",
            "Upvotes": 2,
            "Text": "How does 15 satoshis to not sell sound? \n\n!lntip 15\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmdv8h": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecmdv8h",
            "Author": "BashCo",
            "Date Created": "12-26-2018 19:02:06",
            "Upvotes": 3,
            "Text": "Just sell if that's what you want to do.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmczq9": [
        {
            "Parent ID": "t1_eclzq2c",
            "Comment ID": "ecmczq9",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 18:51:42",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecll6jb": [
        {
            "Parent ID": "t1_ecliu0z",
            "Comment ID": "ecll6jb",
            "Author": "SIT_DOWN_AND_STFU",
            "Date Created": "12-26-2018 13:06:30",
            "Upvotes": 3,
            "Text": "ok. I set `txindex=1` in the config file. if I run `.\\bitcoin-qt.exe -reindex` should that fix the problem?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn0qub": [
        {
            "Parent ID": "t1_ecmv6y7",
            "Comment ID": "ecn0qub",
            "Author": "claytonkb",
            "Date Created": "12-27-2018 00:37:22",
            "Upvotes": 1,
            "Text": "Those are good reasons for people's concerns and I don't encourage people who don't understand technology to invest in Bitcoin. But the value of gold does not *derive* from its commodity uses. Rather, the value of gold, as a monetary good, derives from its use *as a money*. The same thing is true for Bitcoin. Bitcoin doesn't *need* to have a commodity use in order to be sound money. Bitcoin is still volatile because it is not as widely used as the major national currencies (though its market cap has peaked out at levels on a par with the money supplies of some smaller nations). It will become less volatile as it becomes more widely used. As for settlement of payments, Bitcoin *is* exclusive (modulo other cryptos) in that it is truly distributed. Visa/MasterCard are 100% plugged into the global financial surveillance system and national governments can freeze assets anywhere in that system at any time. Not so with Bitcoin. It is truly a \"permissionless\" payments settlement layer, something that no bank, credit-card or money transmission service can say.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmwrsv": [
        {
            "Parent ID": "t1_ecmv6y7",
            "Comment ID": "ecmwrsv",
            "Author": "cryptogrip",
            "Date Created": "12-26-2018 23:29:45",
            "Upvotes": -1,
            "Text": "That's why he referenced the belief believe that it is possible for a sub-economy to emerge that is based on sound money. It's pretty common during early stages for many to dismiss the potential of things that go on to become staples of everyday life. Bitcoin's integration with society has already begun.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmv7it": [
        {
            "Parent ID": "t1_ecmp5sy",
            "Comment ID": "ecmv7it",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 23:06:46",
            "Upvotes": 2,
            "Text": "I agree with all except for the \"semiconductor\" part, it is useful because it is a good conductor and doesn't oxidize easily, but not because it is a semiconductor IMHO.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn0fnb": [
        {
            "Parent ID": "t1_ecmp5sy",
            "Comment ID": "ecn0fnb",
            "Author": "claytonkb",
            "Date Created": "12-27-2018 00:31:43",
            "Upvotes": 1,
            "Text": "> Bitcoin is not at all like gold.\n\nExcept that nothing you said supports this assertion at all.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn18tj": [
        {
            "Parent ID": "t1_ecn0d14",
            "Comment ID": "ecn18tj",
            "Author": "claytonkb",
            "Date Created": "12-27-2018 00:46:45",
            "Upvotes": 1,
            "Text": "The observation you make is correct, as far as it goes, but it overlooks the fact that even expansionary money can only be printed up so fast without risk of hyper-inflation (cf Weimar republic). Bitcoin cannot claim -- not even the gold market can claim -- to be \"free of manipulation\". Of course it's manipulated, but so is everything else (by your own admission). That means that the manipulation has to be \"spread out\" -- they can only manipulate so many things at once. So, I don't think it matters that cryptos get manipulated, what matters is whether they are structurally immune to funny-business. You can't wish more Bitcoins into existence *no matter how many fiat printing presses you have*. And that's the whole point... that is the criterion for a crypto to be structurally immune to funny-business. Bitcoins will continue to be mined at the scheduled rate well past 2100 and there's not a damn thing that the Fed or the alphabet-soup agencies can do about it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmxlmi": [
        {
            "Parent ID": "t1_ecmm0rh",
            "Comment ID": "ecmxlmi",
            "Author": "gblackdragon",
            "Date Created": "12-26-2018 23:44:02",
            "Upvotes": 1,
            "Text": "He's not telling U to buy gold but pointing out the important difference between gold and bitcoin. Gold = has established use in society. Bitcoin = little value except people buying it to speculate then sell at high price. It's up to U what U want to buy. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclmvqr": [
        {
            "Parent ID": "t1_ecljyqt",
            "Comment ID": "eclmvqr",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 13:27:00",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm6lyc": [
        {
            "Parent ID": "t1_eclra3x",
            "Comment ID": "ecm6lyc",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 17:32:42",
            "Upvotes": 2,
            "Text": "Why not use an app? ATMs are archaic af.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclp3fv": [
        {
            "Parent ID": "t1_eclo7qo",
            "Comment ID": "eclp3fv",
            "Author": "RulerZod",
            "Date Created": "12-26-2018 13:53:28",
            "Upvotes": 4,
            "Text": "Which late night tweet?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclbj3l": [
        {
            "Parent ID": "t1_ecl9pw9",
            "Comment ID": "eclbj3l",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 11:02:40",
            "Upvotes": 2,
            "Text": "Scammer Ver is now saying he wants Lightning!! Just shows he wanted to team up and sell mining equipment last year and got bit by a bigger scammer last month. \nThere can be only one proof of work crypto. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl4yhp": [
        {
            "Parent ID": "t1_ecl4lb0",
            "Comment ID": "ecl4yhp",
            "Author": "JoJokwin",
            "Date Created": "12-26-2018 09:26:18",
            "Upvotes": 5,
            "Text": "Why do you think it have to be the same? In fact they are different coins. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl2h9p": [
        {
            "Parent ID": "t1_eckpr5v",
            "Comment ID": "ecl2h9p",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 08:42:40",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclsd16": [
        {
            "Parent ID": "t1_eclrcvr",
            "Comment ID": "eclsd16",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 14:33:59",
            "Upvotes": -4,
            "Text": "Sadly I am serious.  Human freedom of will outweighs the rights of animals.  Personally, I would never hurt one of these magnificent creatures.  But most whale species are no longer endangered, and the Japanese are responsible and sophisticated enough to not hunt an endangered species.\n\nThere are people outside my estate right now who are freezing in the street.  \n\nTHAT should be the concern of humanity - and there are only so many 100 dollar bills I can give to people.\n\nSo, in short, fuck the whales and look after humans first.  Libtards.\n\nMerry Christmas.\n\n:)\n\nOh, and by the way, I am an atheist.  But in the new testament there is barely a hint of hatred or violence (except Christ losing his rag in the temple and overtipping a few tables.)  There ARE religions that have violence built into their religious texts.  Why tolerate those beliefs?  Because why?  Because fashion?\n",
            "Edited?": "12-26-2018 14:41:10",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl647h": [
        {
            "Parent ID": "t1_eckxghc",
            "Comment ID": "ecl647h",
            "Author": "tbonecollion",
            "Date Created": "12-26-2018 09:45:13",
            "Upvotes": 1,
            "Text": "I like that movie with Chevy chase",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eckym7j": [
        {
            "Parent ID": "t1_eckw2ut",
            "Comment ID": "eckym7j",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 07:18:06",
            "Upvotes": 1,
            "Text": "What was that guy's use-case?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn2no0": [
        {
            "Parent ID": "t1_ecn22pm",
            "Comment ID": "ecn2no0",
            "Author": "tommygunz007",
            "Date Created": "12-27-2018 01:15:04",
            "Upvotes": 1,
            "Text": "So basically you are saying it's like a million to one odds of it succeeding as a currency, especially since nobody is using it as a currency now, but rather only HODLing it. 99% of the buyers bought it for the idea that they could make money off of it. Lambo dreamers. They are not going to spend or use it. There is no case to pay a fee to transfer to bitcoin from dollars solely for the purpose of using bitcoin. If anything it's an annoyance and there is a fee. I just love the concept, but it is based on the notion that 'too big to fail' banks will actually fail. I just don't know how that can happen on a global scale.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm6ctj": [
        {
            "Parent ID": "t1_ecm3hue",
            "Comment ID": "ecm6ctj",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 17:29:40",
            "Upvotes": 0,
            "Text": "Sounds unhealthy",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm6ims": [
        {
            "Parent ID": "t1_ecm6hi2",
            "Comment ID": "ecm6ims",
            "Author": "lntipbot",
            "Date Created": "12-26-2018 17:31:35",
            "Upvotes": 2,
            "Text": "Hi u/quinsolo, thanks for tipping u/SorryBodybuilder1 **15** satoshis!\n***\n*[^(More info)](https://www.reddit.com/r/lntipbot/wiki/index) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmm7pw": [
        {
            "Parent ID": "t1_ecmczq9",
            "Comment ID": "ecmm7pw",
            "Author": "Neo-Deo",
            "Date Created": "12-26-2018 20:57:15",
            "Upvotes": 2,
            "Text": "If 1500 is a lot of money to you and you’re not willing to hodl for a few years than yes please sell you haven’t a clue yet",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclnn84": [
        {
            "Parent ID": "t1_ecll6jb",
            "Comment ID": "eclnn84",
            "Author": "Septem_151",
            "Date Created": "12-26-2018 13:36:08",
            "Upvotes": 4,
            "Text": "Yup! That should fix your problem. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmvgjq": [
        {
            "Parent ID": "t1_ecmv7it",
            "Comment ID": "ecmvgjq",
            "Author": "tabbouleh_rasa",
            "Date Created": "12-26-2018 23:10:03",
            "Upvotes": 1,
            "Text": "Right my bad, I guess I dunno the difference between a conductor and a semiconductor",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn1tao": [
        {
            "Parent ID": "t1_ecn0fnb",
            "Comment ID": "ecn1tao",
            "Author": "tabbouleh_rasa",
            "Date Created": "12-27-2018 00:57:51",
            "Upvotes": 1,
            "Text": "Please tell me what Bitcoin looks like.  \n\n\nIs it pretty? Is it shiny? Will you gain social status if you bling out your car by plating it in Bitcoin? Can you make wires with Bitcoin that can conduct electricity efficiently? Can you make jewelery out of Bitcoin? Can you make cups, watches, forks, knives, plates, tables, statues, bracelets, eyeglasse frames out of Bitcoin? Because buddy, you can with Gold.  \n\n\nIf Bitcoin is not adapted as a socially constructed and socially accepted currency and means of exchange value, then it will have no exchange value, because no one will exchange anything for it. That is the definition of exchange value.  \n\n\nJust because a digital asset can be instantly, and trustlessly exchanged anywhere in the world, and is not beholden to any government policy... (but guess what? it kinda is. ALL economic activity touches the political system somehow, even black market trades are defined by their illegality, and in fact the lucrative nature of black market trades COMES from profiting THROUGH the artificial barriers to production and distribution created by interdiction)  \n\n\n...does not mean that you will automatically find people willing to exchange something, or indeed anything at all, for said digital asset.  \n\n\nGold on the other hand... there will always be someone willing to exchange something for Gold. Because Gold is fucking pretty.  \n\n\nSo, to CLARIFY, I am making the assertion that:  \n\n\nBitcoin is not like Gold and can never have guaranteed exchange value because it has no utility value outside of exchange value, therefore it is entirely possible that the exchange value can go to zero (capitulation, non-adoption, no one cares). Gold is not like Bitcoin because it has strong utility values (as a conductor, as a material) that are intrinsically valuable to humans (IT'S PRETTY) and therefore will NEVER lose its exchange value.  \n\n\nPlease tell me how that is wrong. Considering you don't hold any Bitcoin yourself, it seems you agree.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmhjmk": [
        {
            "Parent ID": "t1_eclmvqr",
            "Comment ID": "ecmhjmk",
            "Author": "mtdewrulz",
            "Date Created": "12-26-2018 19:47:11",
            "Upvotes": 1,
            "Text": "Hmm.  By “we” I definitely didn’t mean “Reddit”.  I meant the collective “we”.  Like... the entire market.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmxdf1": [
        {
            "Parent ID": "t1_ecm6lyc",
            "Comment ID": "ecmxdf1",
            "Author": "Fosforus",
            "Date Created": "12-26-2018 23:40:06",
            "Upvotes": 1,
            "Text": "In part because you can feed cash into an ATM. For many people it is a simpler way to get started than giving your credit card or bank info to an online exchange via the web or app.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclp8cc": [
        {
            "Parent ID": "t1_eclp3fv",
            "Comment ID": "eclp8cc",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 13:55:06",
            "Upvotes": -2,
            "Text": "How about the ones openly attacking and contradicting the Fed?  Good for business?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecli6rh": [
        {
            "Parent ID": "t1_eclbj3l",
            "Comment ID": "ecli6rh",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 12:30:14",
            "Upvotes": 7,
            "Text": "Ver was always a fan of second layer solutions like Lightning.  It is the only way to speed up a blockchain without compromising its security.\n\nOnly Ver's infinite capacity for being dishonest stopped him from saying this to his retard Bcasher acolytes - who are now looking at personal ruin.\n\nTough.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl5l23": [
        {
            "Parent ID": "t1_ecl2h9p",
            "Comment ID": "ecl5l23",
            "Author": "BitcoinAlways",
            "Date Created": "12-26-2018 09:36:30",
            "Upvotes": 2,
            "Text": "We have been hearing this same story for over a year now, what exactly are they waiting for?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl4znu": [
        {
            "Parent ID": "t1_ecl2h9p",
            "Comment ID": "ecl4znu",
            "Author": "FortuitousIdiom",
            "Date Created": "12-26-2018 09:26:49",
            "Upvotes": 2,
            "Text": "Institutional investors have more time on their side than I do and back in early November I anticipated a correction, followed by a rally with a second correction below previous lows. I also thought shitcoins would get slaughtered, and still think that will be the case, I have a few that I am fond of because they're not trying to do too much, not trying to be anything but sound money so I'm very bullish onbthem in the long term. Time will tell if all that is correct, I shouldn't try to fit shoehorn the data into my hypothesis but I'm testing it all the same without risking too much.\n\nAny institutional investors seriously interested in long term gains have been strategically accumulating since before the slaughter in November. They have the benefit of volumes and time to ignore the volatility. OTC trading is troublesome because it has little effect on the market price. As far as government endorsed cryptocurrency goes I'm exceedingly skeptical they would approve anything as legal tender that they do not have absolute control over, Trump does not care about freedom so much as he cares about his inability to dictate what the Fed does with the money supply. Otherwise said, he is upset because he doesn't control the money. That does not mean he won't do everything in his power to undermine the Fed but making public declarations of US Goverment support of Bitcoin is improbable. The most probable optimistic outcome is that the people realize that manipulation of the money supply can make or break them and place their exchangeable value in more stable/predictable forms of currency. That doesn't sound like Bitcoin right now, but there is some promise that they may more aggressively diversify into crypto if it proves a resilient asset class.\n\nWe're only.discovering how crypto will perform in a recession so all of this is conjecture, but there's just so much uncertainty and a further correction testing the 3000 limit would feel like a proper bottom to me and increase confidence in resuming buying. Regardless, a lot of sleepy conjecture in a speculative jungle. If I had a crystal ball I'd be rich.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl3wy0": [
        {
            "Parent ID": "t1_ecl2h9p",
            "Comment ID": "ecl3wy0",
            "Author": "thebarbo",
            "Date Created": "12-26-2018 09:08:39",
            "Upvotes": 2,
            "Text": "People who use the word bruh don’t give me financial advice 😂",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclupje": [
        {
            "Parent ID": "t1_eclsd16",
            "Comment ID": "eclupje",
            "Author": "Chroko",
            "Date Created": "12-26-2018 15:04:16",
            "Upvotes": 3,
            "Text": "You have a staggering capacity for self-delusion.\n\n> the Japanese are responsible\n\nLol. Why do people attribute mystical righteousness to asian culture, when they have demonstrated the same capacity for misguided groupthink as any other culture in the world?\n\n> There are people outside my estate right now who are freezing in the street\n\nAlso you: Blames liberals, does nothing,\n\n> there are only so many 100 dollar bills\n\nWho'd have thought that money isn't the solution to everything?\n\n> in the new testament\n\nYou claim to not be religious, but even you practice selective religion. Not that the New Testament is any less violent, including parables calling for one's enemies to be slaughtered in front of them.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclyz4j": [
        {
            "Parent ID": "t1_eclsd16",
            "Comment ID": "eclyz4j",
            "Author": "TheSqueakSquad",
            "Date Created": "12-26-2018 15:56:54",
            "Upvotes": 1,
            "Text": "You totally missed my point. If you prioritize human success, NOT whaling is the best strategy.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl00u0": [
        {
            "Parent ID": "t1_eckym7j",
            "Comment ID": "ecl00u0",
            "Author": "damchi",
            "Date Created": "12-26-2018 07:54:08",
            "Upvotes": 3,
            "Text": "The poster has no purpose in life and he was projecting onto bitcoin. You know.... The usual - no use case, no adoption, price going to 0. Blah, blah, blah. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn34i2": [
        {
            "Parent ID": "t1_ecn2no0",
            "Comment ID": "ecn34i2",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-27-2018 01:25:07",
            "Upvotes": 1,
            "Text": "Let’s say there is a huge liquidity crisis in the banking system next year. People by the tens of millions look to crypto to be their savior. What confidence do you have that the BTC network could cope with the resulting transaction volume? Followed shortly by people forgetting pass phrases by the tens of millions, getting swindled and hacked by the tens of millions. Accidentally sending funds to the wrong wallets by the tens of millions.\n  \nSure, prices would theoretically skyrocket in the panic but the whole system would seize up, Congress would call for investigations, it would be an absolute disaster. In such a situation hodlers who suddenly find themselves with BTC holdings worth $100MM on paper are going to be in for a rude awakening. \n  \nAll my opinion, of course.  /tips fedora",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecma9l4": [
        {
            "Parent ID": "t1_ecm6ctj",
            "Comment ID": "ecma9l4",
            "Author": "The-Physicist",
            "Date Created": "12-26-2018 18:18:29",
            "Upvotes": 4,
            "Text": "It’s not ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn4xs2": [
        {
            "Parent ID": "t1_ecn1tao",
            "Comment ID": "ecn4xs2",
            "Author": "cryptogrip",
            "Date Created": "12-27-2018 02:07:30",
            "Upvotes": 1,
            "Text": "Bitcoin will never be shiny and pretty and gold will never be digital. Which of those do you think will be more important as we move forward?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmie9m": [
        {
            "Parent ID": "t1_ecmhjmk",
            "Comment ID": "ecmie9m",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 19:59:30",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn8881": [
        {
            "Parent ID": "t1_ecmxdf1",
            "Comment ID": "ecn8881",
            "Author": "[deleted]",
            "Date Created": "12-27-2018 03:29:31",
            "Upvotes": 1,
            "Text": "I guess that makes sense in the developing world.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclppzd": [
        {
            "Parent ID": "t1_eclp8cc",
            "Comment ID": "eclppzd",
            "Author": "RulerZod",
            "Date Created": "12-26-2018 14:00:56",
            "Upvotes": 9,
            "Text": "I dont see anything wrong with that. Theres nothing good about the federal reserve.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm30vo": [
        {
            "Parent ID": "t1_eclp8cc",
            "Comment ID": "ecm30vo",
            "Author": "Enrrjjrrnrfr",
            "Date Created": "12-26-2018 16:47:35",
            "Upvotes": 2,
            "Text": "Trump has been attacking financial institutions since 2016. It wasn't a problem until august this year when everything went up, and now people claim things go down because of his tweets. Which is nonsense. Economy was overheated. This was to be expected because we deal with natural cycles. We will enter a recession within 1-2 years. That's how cycles work. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl5vp0": [
        {
            "Parent ID": "t1_ecl5l23",
            "Comment ID": "ecl5vp0",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 09:41:30",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecl551m": [
        {
            "Parent ID": "t1_ecl3wy0",
            "Comment ID": "ecl551m",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 09:29:12",
            "Upvotes": 6,
            "Text": "[deleted]",
            "Edited?": "12-26-2018 09:52:28",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclijnb": [
        {
            "Parent ID": "t1_ecl3wy0",
            "Comment ID": "eclijnb",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 12:34:31",
            "Upvotes": 1,
            "Text": "I have to agree.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclva8q": [
        {
            "Parent ID": "t1_eclupje",
            "Comment ID": "eclva8q",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 15:11:19",
            "Upvotes": 1,
            "Text": "When did your vegan God abandon you?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclzgj1": [
        {
            "Parent ID": "t1_eclyz4j",
            "Comment ID": "eclzgj1",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 16:03:00",
            "Upvotes": -4,
            "Text": "Why?  You need to expand upon that point.  Because if human endeavor is controlled by FaceFuck / Twatter and the will of the uninformed masses, there will be little progress, because there will be no means to logically prioritise that endeavor.  Think about it.  And by think about it, I mean for more than a few seconds.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmamos": [
        {
            "Parent ID": "t1_ecma9l4",
            "Comment ID": "ecmamos",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 18:22:55",
            "Upvotes": -4,
            "Text": "https://translate.google.com/translate?sl=vi&tl=en&js=y&prev=_t&hl=en&ie=UTF-8&u=http%3A%2F%2Fluatphapso.com%2Fgia-dinh-3-nguoi-treo-co-tu-tu-tai-sai-gon-vi-sap-san-bitcoin.html&edit-text=&act=url",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecn6byp": [
        {
            "Parent ID": "t1_ecn4xs2",
            "Comment ID": "ecn6byp",
            "Author": "tabbouleh_rasa",
            "Date Created": "12-27-2018 02:42:02",
            "Upvotes": 1,
            "Text": "Every shitcoin is digital too, you know?  \n\n\nThe major point I'm contesting is the OP's silly idea that how popular Bitcoin is has nothing to do with its long term validity as a means of exchange value. Of course how popular Bitcoin has to do with its long term validity as a means of exchange value, it has *everything* to do with popularity.  \n\n\nIt's purely faith based, this idea that Bitcoin won't capitulate. Now I'm not prophesizing that Bitcoin will go to zero, but it's also just as irrational to think that Bitcoin is going to the moon within the next five years. It could just end up an extremely volatile, sideways moving asset for decades and eventually no one is going to care about it but a very niche group of fringe crypto speculators and then maybe it will finally capitulate or maybe it will just be the same sideways moving gambling game for the next century. No, even at this point it still isn't zero, but it certainly will not have achieved the vision laid out by Satoshi's original white paper, at least not until it achieves widespread adoption, AKA it *becomes popular*.  \n\n\nEveryone keeps saying that cryptocurrencies are not the same as fiat because there's this mathematical formula that controls the monetary supply of cryptocurrencies. But that's it. That's the only distinguishing thing between crypto and fiat. Ultimately, they are both given value through social construction of a perceived fair rate of exchange between any commodity and the currency in question.  \n\n\nGold, on the other fucking hand, is never, ever, ever going to stop being pretty. We could nuke the entire human race back to the stone age, eliminating all language until we're back to Neanderthal-esque grunts, I'm talking about collapse on another level *beyond* some cosmic radiation frying all our satellites, I'm talking no governments, no social contract at all... and even then, Gold will still have fucking value. Because it's pretty. Gold is not just used as a currency, it is fundamentally a desired and valued commodity with many different kinds of use value.  \n\n\nCrypto is just an agreed upon way of encrypting meaningless data so that we can track who owns said pieces of encrypted meaningless data, because the fact that the data is encrypted means that anyone can reproduce it so it can't be fudged with and fucked with. But if no one gives a shit who owns what bits of encrypted meaningless data (very possible if the encrypted meaningless data is worth jack shit) then... who fucking cares?!?!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmqnyc": [
        {
            "Parent ID": "t1_ecmie9m",
            "Comment ID": "ecmqnyc",
            "Author": "mtdewrulz",
            "Date Created": "12-26-2018 22:04:45",
            "Upvotes": 1,
            "Text": "k",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclpx8a": [
        {
            "Parent ID": "t1_eclppzd",
            "Comment ID": "eclpx8a",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 14:03:15",
            "Upvotes": -5,
            "Text": "Good for America?  For the Orange one to attack them on a whim, based on zero understanding - whatever their failures?  Good for America is my question.  \n\nIf you think 'Good for America' then o.k.\n\n(are you a Bcasher?)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecletqt": [
        {
            "Parent ID": "t1_ecl5vp0",
            "Comment ID": "ecletqt",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 11:48:27",
            "Upvotes": 2,
            "Text": "there is a very interesting social phenomenon, that 'regular' western people do not see the difference between poor people that live on $10 a day and 1$ a day because the difference is $9, but really, it's 10x more. Can you imagine the difference if you had 10x more income?  \n\n\nMy point is, we will not see it coming, because we will not be able to recognize it, until it affects the richest few % of people.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm746a": [
        {
            "Parent ID": "t1_ecl551m",
            "Comment ID": "ecm746a",
            "Author": "tendrloin_aristocrat",
            "Date Created": "12-26-2018 17:38:52",
            "Upvotes": 2,
            "Text": "Hi 5 brocephus!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclh2i0": [
        {
            "Parent ID": "t1_ecl551m",
            "Comment ID": "eclh2i0",
            "Author": "Diego2196",
            "Date Created": "12-26-2018 12:16:03",
            "Upvotes": 0,
            "Text": "Opinion based on speculations nah thanks “bruh”",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecly5fy": [
        {
            "Parent ID": "t1_eclva8q",
            "Comment ID": "ecly5fy",
            "Author": "BCash_BeTrash",
            "Date Created": "12-26-2018 15:46:50",
            "Upvotes": 3,
            "Text": "Oh, btw Chroko, you wrote above:\n\n- including parables calling for one's enemies to be slaughtered in front of them.\n\nCould you point me to that parable in the New Testament?  It doesn't exist - but attempt to provide a link anyway.\n\nIf you can find it, I will send you 0.01 BCash.\n\n",
            "Edited?": "12-26-2018 15:50:43",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecm46rq": [
        {
            "Parent ID": "t1_eclzgj1",
            "Comment ID": "ecm46rq",
            "Author": "TheSqueakSquad",
            "Date Created": "12-26-2018 17:02:26",
            "Upvotes": 1,
            "Text": "Whales as a species have accrued a unique and deep knowledge/skillset via evolution. Studying whales benefits scientific discovery, and so far we barely understand how deep that knowledge goes, or how useful it may be. When facing uncertainty like that, it is best to be conservative. The conservative approach is to preserve species at least until we've learned everything there is to know about whales. The \"libtard\" approach is to assume we already know everything about whales, and that the most useful thing they can provide to us are their corpses.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmaz15": [
        {
            "Parent ID": "t1_ecmamos",
            "Comment ID": "ecmaz15",
            "Author": "The-Physicist",
            "Date Created": "12-26-2018 18:27:00",
            "Upvotes": 3,
            "Text": "If you don’t want to buy bitcoin, then don’t buy.  I’m happy to buy, and probably so will you eventually ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqfkhl": [
        {
            "Parent ID": "t1_ecn6byp",
            "Comment ID": "ecqfkhl",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 10:22:57",
            "Upvotes": 1,
            "Text": "It's about aligning with the wants, needs and convenience of a digital society. To think that future generations will prefer to dig shiny rocks out of the ground over Bitcoin seems backwards and ludicrous. There was no digital exchange or internet when gold was chosen as a value store. The world has changed and just like everything else has evolved so too, will currency. \nWe can agree to disagree and see what happens. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eclroqm": [
        {
            "Parent ID": "t1_eclpx8a",
            "Comment ID": "eclroqm",
            "Author": "RulerZod",
            "Date Created": "12-26-2018 14:25:12",
            "Upvotes": 10,
            "Text": "The federal reserve isnt good for america.  \n\nNo. I hate bcash. I hate roger ver (the weasely fuck), jihan wu and craig faketoshi. The worst of the centralized shitcoins. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmcbpd": [
        {
            "Parent ID": "t1_ecmaz15",
            "Comment ID": "ecmcbpd",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 18:43:01",
            "Upvotes": -2,
            "Text": "Hard no",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecme4j5": [
        {
            "Parent ID": "t1_ecmcbpd",
            "Comment ID": "ecme4j5",
            "Author": "The-Physicist",
            "Date Created": "12-26-2018 19:05:05",
            "Upvotes": 2,
            "Text": "Haha. Uninterested in buying bitcoin yet you waste time trolling this subreddit....what a genius. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmem98": [
        {
            "Parent ID": "t1_ecme4j5",
            "Comment ID": "ecmem98",
            "Author": "[deleted]",
            "Date Created": "12-26-2018 19:10:58",
            "Upvotes": -1,
            "Text": "I'm not trolling. And coming here is just fun sometimes 🤷🏾‍♂️",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecmfnko": [
        {
            "Parent ID": "t1_ecmem98",
            "Comment ID": "ecmfnko",
            "Author": "The-Physicist",
            "Date Created": "12-26-2018 19:23:40",
            "Upvotes": 3,
            "Text": "Kinda weird when you’re not even buying. Whatever tickles your pickle, I guess ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}