{
    "eabq4sk": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabq4sk",
            "Author": "cir2kuk",
            "Date Created": "11-23-2018 17:24:35",
            "Upvotes": 11,
            "Text": "Sell now and buy back later for a much higher price! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaajj87": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaajj87",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 06:04:42",
            "Upvotes": 24,
            "Text": "I’m just going to HODL. it can free fall all it wants. I ain’t budging. I’m going down with this fucking ship. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab4sdi": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab4sdi",
            "Author": "Manasan3010",
            "Date Created": "11-23-2018 12:29:28",
            "Upvotes": 3,
            "Text": "Am i obligated to show my bitcoin account/balance to law officials?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab602z": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab602z",
            "Author": "omega_31",
            "Date Created": "11-23-2018 12:44:59",
            "Upvotes": 5,
            "Text": "Anyone holding from $20k ?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa7tm7": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaa7tm7",
            "Author": "gretteaj",
            "Date Created": "11-23-2018 02:03:53",
            "Upvotes": 12,
            "Text": "Times are tough, no doubt about it. But I'm genuinely not worried in the long run, which is why I am confused to see how the daily discussion is mostly anti-bitcoiners talking about their assurance of btc's death. Reminds me of late 2017, when anyone skeptical of the parabola was immediately hated, and that you were an idiot if you didn't think the coin was absolutely going to take over soon. Makes me wonder how many comments come from the same individuals. Ones that hate when it's in a bear market and praise in a bull. Essentially taking the emotional path of least resistance, which has really never gotten anyone anywhere in life. \n\nI love tracking bitcoin wallet creations. Keeps me confident in the future. Sure lots of these are duplicates, lots are people that will never buy any bitcoin or have any understanding of crypto...but some are new HODLERS, some are using their bitcoin, some hate current financial structure. It makes me giggle to hear people say bitcoin will reach 100 bucks or go to zero. Look at this chart from ANY time frame. And explain how that is remotely possible when new user rate is constantly increasing. \n\n[https://www.blockchain.com/charts/my-wallet-n-users?timespan=1year](https://www.blockchain.com/charts/my-wallet-n-users?timespan=1year)\n\n50% percent more users than the ATH. All that indicates to me is the extreme overbought and oversold conditions of this market. Especially after the recovery from 3 separate \"crashes\" that were heavier than this current one. The prevailing sentiment from bearish people has been \"Yes, but this time is different, lots of people lost money, and will never get reinvolved\". This is both irrelevant and fictitious. Human history has shown people are addicted to greed, as one Redditor subtly mentioned with his casino example. The morons selling now will buy once it recovers and is approaching or exceeding ATHs. Additionally, people seem to forget how small crypto markets still are. 74 billion?? That's really nothing. 31 million users in a 7 billion person world? IMO, the hard times for crypto are over. The previous crashes were more dangerous due to the total lack of involvement and understanding. Just like how business bubbles that survive a few massive bubbles (Amazon, Microsoft, etc.) make it stronger and less likely to ultimately fail in the long run.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzos9": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabzos9",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 19:59:16",
            "Upvotes": 13,
            "Text": "No matter what time of day I check on here, the same 3 or 4 users are posting the same ridiculous negativity about bitcoin. I've never seen anyone so invested in something they think is a waste of time. \n\nThey are literally the epitome of pathetic hypocrisy. But they do provide a few laughs like the clowns at children's bday parties. Well except the clowns actually get paid lol.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabz3md": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabz3md",
            "Author": "aaj094",
            "Date Created": "11-23-2018 19:49:25",
            "Upvotes": 11,
            "Text": "One of the many great things about the Internet is that your words are preserved. I see a lot of naysayers giving all kinds of reasons about why this bubble was so different from the last and why Bitcoin had one shot to engage the global audience and lost it, etc. All these comments will be very much accessible in 2021 just as the 2015 ones are now. \n\n If Bitcoin touches 100k in 2021 (for which we believers have reasons that convince us), what new excuses will naysayers likely provide in 2021 given a written history available of their unsuccessful attempts? Would it make people even more unwilling to part with their coins than they were during the bull run to 19k? How will naysayers then show that 2021 was unlike any previous Bitcoin bubble?\n\nJust something to think about for fun, if nothing else.",
            "Edited?": "11-23-2018 19:54:16",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa83hw": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaa83hw",
            "Author": "BPT242",
            "Date Created": "11-23-2018 02:09:48",
            "Upvotes": 4,
            "Text": "So much for Black Friday gains lol.   \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaai7oj": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaai7oj",
            "Author": "James_Brayshaw_",
            "Date Created": "11-23-2018 05:39:35",
            "Upvotes": 8,
            "Text": "The two \"inputs\" for cryptocurrency mining are the rig and electricity.\n\nTo me the rig is fairly close to optimum efficiency if we take BTC for example. The marginal benefit of the newest, greatest mining rig starts to diminish against the current best rigs.\n\nTherefore in terms of profitability in mining it's a race for the cheapest electricity.\n\nWhilst we're seeing cheap electricity in Iceland and large subsidies, in the end there's still a middleman.\n\nTo source cheap electricity, you basically have to manufacture it.\n\nWhich brings me to the point why don't power plants start mining cryptocurrency?\n\nA power plant is on a microsecond level trying to achieve equilibrium between supply and demand. Over-supply means a power surge and under supply means a failure. In effect they are very rarely running at full capacity.\n\nI would have thought that power plants should use any excess capacity and redirect it towards mining cryptocurrency.\n\nThey are in the best position to profit from it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaj2so": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaj2so",
            "Author": "crayzcrinkle",
            "Date Created": "11-23-2018 05:55:03",
            "Upvotes": 5,
            "Text": "Pretty sure now,  the 2nd big drop was someone taking out masses of BTC savings to try prop the price of BCH through their little hash war. Looks like they've run out of savings and BCH is turning into an ouroboros. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaap7zb": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaap7zb",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 08:22:44",
            "Upvotes": 9,
            "Text": "Can all the trolls atleast try to be original from now on.......",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaajef": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaajef",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 03:09:45",
            "Upvotes": 7,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaabwx0": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaabwx0",
            "Author": "proficy",
            "Date Created": "11-23-2018 03:39:24",
            "Upvotes": 2,
            "Text": "can anybody smarter then me, tell me the link between Hashrate and Price?\n\n[https://bitinfocharts.com/comparison/hashrate-price-btc.html](https://bitinfocharts.com/comparison/hashrate-price-btc.html)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabcgff": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabcgff",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 14:06:45",
            "Upvotes": 2,
            "Text": "Does anyone know if the hashwar over? I read fake satoshi offered reply protection on twitter. If that’s true, aren’t their 2 separate coins and Bitcoin can gets its full hash power back? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabg1jv": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabg1jv",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 14:55:24",
            "Upvotes": 2,
            "Text": "The Jimi Hendrix Experience - All Along The Watchtower\n\nhttps://www.youtube.com/watch?v=TLV4_xaYynY",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacxnyu": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eacxnyu",
            "Author": "nonesecure",
            "Date Created": "11-24-2018 08:50:51",
            "Upvotes": 2,
            "Text": "How to face and talk to the relatives that you introduced Bitcoin to them during last Christmas dinner? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa7onu": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaa7onu",
            "Author": "LemonHerbLambChops",
            "Date Created": "11-23-2018 02:01:03",
            "Upvotes": 8,
            "Text": "The greatness of a man is not in how much wealth he acquires, but in his integrity and his ability to affect those around him positively.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa7uoq": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaa7uoq",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 02:04:28",
            "Upvotes": 5,
            "Text": "Hey guys, when moon?  When lambo?\n\n&nbsp;\n\nDoesn’t that make you feel warm and fuzzy with nostalgia?   You’re welcome. \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabujsk": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabujsk",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 18:35:02",
            "Upvotes": 16,
            "Text": "I can't remember the first time I heard of bitcoin, but I remember last fall was the first time I took a close look at it.  I spent a lot of time that fall watching with interest, then with trepidation, and finally with outright horror at the bloodbath to come. I learned what the hell it was, how it works, what it was useful for, what it wasn't useful for, what were the barriers, where were the potential pitfalls, etc.  I read all the sidebar material, and then article after article, and white paper after white paper.  I looked at youtube videos of people considered the leading authorities in bitcoin.  And I looked at the trading.  I looked at insane rise in price and I saw story after story of people selling assets to purchase bitcoin.  \n\nAfter processing it all - I identified several red flags and concluded the insane prices were based on psychology and nothing else and that bitcoin was going to crash and crash hard.  \n\nI feel pretty well vindicated a year later.  \n\nRedflag #1: Bitcoin isn't what most of the promoters say it is.  It isn't a currency.  It isn't even particularly useful as a median of exchange.  There's almost nothing it does that  the traditional banking system doesn't do better. \n\nRedflag #2: Bitcoin isn't used for much of anything.  99% of owners simply trade it.  What little use there is in commerce is mostly illicit or symbolic.\n\nRedflag #3: Bitcoin is a threat to controls on banks and money - a lot of that regulation was for a lot of good reasons.  Those reasons don't evaporate with bitcoin.  I concluded that it is almost near certainty that regulatory crackdowns will prevent the fulfillment of the vision that is promoted.  \n\nRedflag #4:  it is not nearly as secure as the promoters indicate.  There seem to be dozens of ways people can be separated from their bitcoin.  The higher the value, the more likely that is to happen.  Moreover, storage is greatly problematic - a recorded key is hackable or can be stolen.  A memorized key can be lost forever in an unexpected accident.  Exchanges are far from secure.\n\nRedflag #5 - Tether and Bitfinex are shady AF, almost certainly have contributed to bubble. The chickens haven't come home to roost on that one yet.  \n\nRedflag #6 - Bitcoin is a paradox.  The idea of a \"deflationary\" currency isn't a good one - but even if it were, it's completely contradictory.  You don't spend deflationary currency, you hoard it. But if you hoard it, there is no utility.  If there is no utility, then there is no real value.  But if there's no value then the price craters, but if the price craters you should spend it. . .etc.  \n\nRedflag #7 - it's too volatile to be a good store of value.  Best left to speculators and hedge fund operators.\n\nRedflag #8 - no one can tell you what the true value is.   There isn't a liquidation value.  \n\nRedflag #9 - no definitive path to useful transactions. \n\nRedflag #10 - the promoters of bitcoin include a lot of people who want to see systems disrupted, governments topple, banks fail, and people have complete freedom to engage in any transaction, even illicit ones, even dangerous ones, out of inference from states.  \n\nRedflag #11 - Bitcoin is cumbersome.  Every trade is a taxable event.  This is going to complicate tax filings for many users.  For that reason alone I would not expect widespread use for average taxpayers who want to file a 1040ez. That alone will greatly limit reach. \n\nEdit I'll add a 12th red flag.\n\nRedflag #12:  While the volatility makes it useless as a store of value for most people (who need some degreed of predictability in their savings - they're usually building for something - a house purchase, their kids college tuition, retirement, etc) it is great for is highly sophisticated traders with access to extraordinarily sophisticated tools and analysts who can use superior information to make money.  That's great if you're a shark.  Minnows get destroyed.  Since I'm not a hedge fund and I don't have access to quants, high speed trading equipment, and sophisticated algorithms that can spot arbitrage opportunities, I'm at a huge disadvantage - most ordinary people trading are likewise at a huge disadvantage.  And that doesn't even touch on the ability of large capital to move relatively small markets like this. \n\nThe 10th one is along the lines of \"judging you by the company you keep\". Not everyone in bitcoin is a nihilist, but nihilism and anarcho-capitalism is definitely a lively strain in the bitcoin community.  \n\nNot much has changed in a year.  It's a little less dangerous as an investment since most of the upward price swing is gone (I still wouldn't recommend it) - but longterm utility to me seems greatly suspect.  \n\nI concluded then and maintain now that bitcoin is best characterized as a synthetic digital commodity.  Its real utility is almost entirely confined to illicit trade.  And most of the value is derived from speculation.  Unlike actual commodities (metals, pork bellies, oranges, etc.) there isn't an actual consumable product that has a market. That is an inherently unstable condition.  \n\nNot in the business of predicting which way the price will go - in fact, I predict it will continue to swing wildly.  But it won't end up doing anything the promoters say it will do.  And for those reasons, I continue to stay far away.\n\n  ",
            "Edited?": "11-23-2018 20:38:13",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaw5n8": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaw5n8",
            "Author": "marlin3",
            "Date Created": "11-23-2018 10:31:01",
            "Upvotes": 3,
            "Text": "Would you say that this is a good time to buy in for beginners? Should they buy the dip or wait for a more stable time to enter? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab4c97": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab4c97",
            "Author": "bullruntime",
            "Date Created": "11-23-2018 12:23:29",
            "Upvotes": 6,
            "Text": "Looking through the daily discussion today is a great reminder why I rarely posted.  Seriously, fuck the mods.  You suck so fucking bad, allowing day old accounts to troll the fuck out of bitcoin fans in their own daily.  I'm out.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6g0l": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab6g0l",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:50:09",
            "Upvotes": 6,
            "Text": "[deleted]",
            "Edited?": "03-15-2019 12:58:29",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabcpfg": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabcpfg",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 14:10:02",
            "Upvotes": 5,
            "Text": "Hashrate has broken. Miners going bankrupt, its on news.  I think this last drop might be as unsustainable as last december spike.  New mining investments will be coming after wiping out weak miners. Competition will be lower. Money that goes in mining translates to price similarly as investing money on exchanges rise the price",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhzs3": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabhzs3",
            "Author": "rootbeerspin",
            "Date Created": "11-23-2018 15:22:28",
            "Upvotes": 2,
            "Text": "Get ready boys. 2019. Those who survived 2018 crash. And got in late. Hold and you will be rewarded. I could take profits at 18ks and holding since 500-1000-2000.\n\nYour Opportunity https://youtu.be/e6WyN4z0VGc?t=78",
            "Edited?": "11-23-2018 15:25:42",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabc1yz": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabc1yz",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 14:01:22",
            "Upvotes": 2,
            "Text": "Bonnie Tyler - Total Eclipse of the Heart \n\nhttps://www.youtube.com/watch?v=lcOxhH8N3Bo",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaci9nd": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaci9nd",
            "Author": "xelephonte",
            "Date Created": "11-24-2018 01:56:48",
            "Upvotes": 2,
            "Text": "I met somebody today who didn’t know what Bitcoin was. But of course most of the world doesn’t know what Bitcoin is. But, what was unusual with this guy is that he claims he was familiar with cryptocurrency and he proved that by talking blockchain technology and naming Ethereum, Litecoin, even Ripple. But, Bitcoin or Bitcoin Cash didn’t ring a bell to him. I thought he was joking but he was serious claiming he wasn’t familiar with every altcoin. I told him Bitcoin isn’t a fucking altcoin...it is the coin, like the top coin that started it all. He was like...sorry haven’t heard of it. And he was dead serious. I didn’t know it was possible for someone to be familiar with cryptocurrency and not know Bitcoin, I just wrote him off as a noob. I don’t think that will ever happen again.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabuamt": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabuamt",
            "Author": "PurpleCopper",
            "Date Created": "11-23-2018 18:30:57",
            "Upvotes": 3,
            "Text": "I pity the poor schmucks that bought at 20k.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaakyz2": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaakyz2",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 06:35:58",
            "Upvotes": 0,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaafteg": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaafteg",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 04:55:24",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": "08-06-2020 20:46:58",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa9ftf": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaa9ftf",
            "Author": "williammcfadden",
            "Date Created": "11-23-2018 02:43:05",
            "Upvotes": 1,
            "Text": "Not sure where to put this so I will ask this here.  Is bitcoin in a position to be the currency of a future world-data blockchain or would that spring up from a private company approach using their own cryptocurrency?  No one knows what will happen even next month, of course, but I'm just wondering the current thought in here.  I suppose a company would have to provide some killer service to the masses like eBay but I have no idea what that could possibly be at this beginning stage.",
            "Edited?": "11-23-2018 02:47:28",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabck5r": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabck5r",
            "Author": "DemonPuke",
            "Date Created": "11-23-2018 14:08:06",
            "Upvotes": 1,
            "Text": "Hello, I had a question I was hoping could be answered here I'm looking at metal card wallets with your information on the card, now here is my question.  On the card there's an option to stamp your private key onto the back side of the key and the public key is on the front, aren't we supposed to to hide the private key and not let anyone see it? By putting it on the back of the card that you carry around would that be considered a dumb thing to do? I was caught off guard by it simply asking if I wanted my private key on it cause I thought nobody was ever supposed to have them except me so why would anyone have one in the open? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadsmq9": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eadsmq9",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 15:04:32",
            "Upvotes": 1,
            "Text": "#Ive got a coin and I bought it high, and I fully expect to lose it. But that doesn’t mean this ship doesn’t turn around. Don’t listen to speculators or morons on the internet. Watch the markets, watch what the large traders do, watch what the small traders do, watch what the commercials do.. don’t listen to what trolls on reddit think is going to happen. Come of folks ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaefh90": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaefh90",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 20:15:20",
            "Upvotes": 1,
            "Text": "We finally arrived at the despair phase.\n\nLet this be my first ever price prediction :\n\n2800 bottom, followed by a quick surge back to 3400. Going sideways for a year at around 3200. By the end of 2020 : generating new fomo, around the halving and a rumored big news. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaarrbu": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaarrbu",
            "Author": "AzzX",
            "Date Created": "11-23-2018 09:14:56",
            "Upvotes": 1,
            "Text": "Asic mining, its been so awesome! Thanks Bitcoin for dictating the terms and giving us a complete shitshow in regards to Jihan Plus Craig aka Fake satoshi, \n\nIt has been great  Fuck me basically \n\nASICs for the win.... Idiots. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaau58g": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaau58g",
            "Author": "electrifyme1",
            "Date Created": "11-23-2018 09:57:33",
            "Upvotes": 1,
            "Text": "I don't know why everyone is so mad. I just bought my new lambo in bitcoin a week ago.\n\n[https://www.youtube.com/watch?v=Zj1HISsf9x0](https://www.youtube.com/watch?v=Zj1HISsf9x0)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaasmt": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaasmt",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 03:15:22",
            "Upvotes": -4,
            "Text": "It's over. The signs were there and you ignored them. The price hovered between 6 and 7k for months like an old dude who can't get his dick up anymore. \n\nYou delusional pathetic fucks didn't want to believe it but the writing was on the wall. I hope you all lost a lot of money and continue to lose until this thing goes all the way down to 0. I just checked the price today for the first time in a month and literally lol'd. Take this thing out back and shoot it with a shotgun already. \n\nAnd lol at people thinking a lost a bunch of money...I made $118: https://imgur.com/a/HcvJzpu",
            "Edited?": "11-23-2018 11:43:48",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7zpm": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab7zpm",
            "Author": "Neo-Deo",
            "Date Created": "11-23-2018 13:09:27",
            "Upvotes": 0,
            "Text": "Seriously though, mods r actually to blame for these trolls. Remove them, nothing they say in these “scenarios” are real. This is for active discussion about btc, not bickereing with the bottom of the barrel internet roaches. There’s a difference between censoring different opinions and enabling mental illness. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab5ay2": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab5ay2",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 12:36:31",
            "Upvotes": 1,
            "Text": "Dark Side of the Moon - Pink Floyd - Full album HD\n\nhttps://www.youtube.com/watch?v=BbeavlJEYrk\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaz0ve": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaz0ve",
            "Author": "Robbanbiff",
            "Date Created": "11-23-2018 11:12:10",
            "Upvotes": -1,
            "Text": "Lol no new money will enter the market for atleast a couple of months, all stocks around the world are bleednig, if u can loose the value you have go ahead but if dont, cash out, relax, have some christmas fun with family and come back when there is a confirmation.. I rather buy at 12k in a bullrun then 4xxx in a bearmarket that can fall to 3k 2k 1k or fucking 1 dollar.. \nBakkt and everything else is just bullshit, real adoption will take years, last bearmarket was like 2.5 years, who says this bearmarket wont last 5 years? Just look at the dotcom bubble, did it take months? No YEARS",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaao2z1": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaao2z1",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 07:56:42",
            "Upvotes": -3,
            "Text": "Hey all you lazy little Rollie Pollie Trolls. Have even a single one if you clueless little shits been here longer than a year? Am I the only one that messed with bitcoin when it was in the hundreds? Cause you dumb little brain dead fucks can’t do math or you can’t get your dicks out of your hands long enough to Google the price of bitcoin before last year? It’s in the thousands today. How many of your stock shares are 4K a piece? Go on take a look and let us know. Cause I play a lot of stocks and NOT ONE of em are near 4k per share. So why in the flyin fuck are you calling bitcoin dead?? If you’re calling time of death at 4K then the shit you had for brains must have ran down over your sunlight deprived little basement eyes ya?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaolok": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaolok",
            "Author": "skaska23",
            "Date Created": "11-23-2018 08:08:25",
            "Upvotes": -1,
            "Text": "To achieve bitcoin standard = world currency, we need hardcore holders who will hold through any price. Even when the price can swing wildly to realm of only 100$/BTC. Remember, its pure supply and demand. I've sold at the beginning of December - Only money what I put in during September. Rest I left in there. Iam still in 10 milion club and not selling. mybe it was stupid to not take everything out, but I will sell only in next price spike at 100-200k$+. I will put next big chunk of money in at February.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaurnp": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaurnp",
            "Author": "locke75",
            "Date Created": "11-23-2018 10:08:01",
            "Upvotes": -2,
            "Text": "Understandably there is a lot of rage and a lot of jokes here.\n\nFrom the point of view of the technology is bitcoin still valid? If it is then then we should invest and support the currency. \n\nThese spikes and dips are manipulation by media and whales.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9j7j": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab9j7j",
            "Author": "mjb5730",
            "Date Created": "11-23-2018 13:29:16",
            "Upvotes": -5,
            "Text": "bitcoin will every time rise again after a big crash and break its previous high every time it attempt it,\n\nlooking back 3 times it happened already,\n\ni think because when it start a real bull trend people all wanting a new high price(new \"ATH\" utopia) so they keep speculating and buying and push it to go further high(fomo), and institution investors come to aid to push it even higher and then in some point they want to take their profit and that's another ATH again and here we go all the way down again, this cycle may repeat again on next bull run, so we should expect a price higher than its last ALH, maybe around 30-100k, nobody knows when the exact reversal will happen so better to exit before its not too late, but i think bitcoin will be a trillion dollar capital, and it is inevitable",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaasn5u": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaasn5u",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-23-2018 09:31:34",
            "Upvotes": -2,
            "Text": "Bullrun starts tomorrow ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabid8i": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabid8i",
            "Author": "nishbot",
            "Date Created": "11-23-2018 15:27:41",
            "Upvotes": -2,
            "Text": "What I created bitcoin2, an alt bitcoin, with all the same technical properties as the original bitcoin, as well as a similar size network to support it. Would it be considered a legitcoin or shitcoin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6kgp": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab6kgp",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:51:36",
            "Upvotes": -14,
            "Text": "[deleted]",
            "Edited?": "11-23-2018 12:57:32",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab5h5s": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab5h5s",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:38:51",
            "Upvotes": -1,
            "Text": "[deleted]",
            "Edited?": "12-22-2018 17:13:26",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaa311": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaaa311",
            "Author": "SAT0SHl",
            "Date Created": "11-23-2018 02:59:00",
            "Upvotes": -3,
            "Text": "I love the smell of Bitcoin in the morning, smells like **victory!**",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacgk57": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eacgk57",
            "Author": "Sage1970",
            "Date Created": "11-24-2018 01:13:01",
            "Upvotes": -2,
            "Text": "I first heard about bitcoin when it hit $1k. I already made a profit and still have some coins. So all of you celebrating the death of bitcoin, you're in the wrong place at the wrong time. The vast majority of peeps in this sub have already bested you. And it's going to get worse for you. Get used to it or take off the tinfoil hat and do some research. Maybe it's not too late.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabxuia": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eabxuia",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 19:28:29",
            "Upvotes": -5,
            "Text": "Shhhhh. We need buyers and true believers.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaacb7d": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eaacb7d",
            "Author": "GreenPrinciple",
            "Date Created": "11-23-2018 03:48:05",
            "Upvotes": -1,
            "Text": "yes finally something damn bullish! [https://www.youtube.com/watch?v=yFLGG8yB0yE&feature=youtu.be](https://www.youtube.com/watch?v=yFLGG8yB0yE&feature=youtu.be)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab896j": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab896j",
            "Author": "Neo-Deo",
            "Date Created": "11-23-2018 13:12:43",
            "Upvotes": -1,
            "Text": "That being said....was thinking of running a full node on my old laptop now that I got a new iMac:). I heard though that mining means that you are also running a node. Is that true? Is it just part of the mining cloud?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacf3yn": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eacf3yn",
            "Author": "Neveragain646",
            "Date Created": "11-24-2018 00:39:29",
            "Upvotes": -1,
            "Text": "People asked where is the source for the 5 percent investors in crypto. Turns out it's even higher: 8 percent. Am EXTREMELY high percentage, unbelievable: [https://ethereumworldnews.com/poll-bitcoin-cryptocurrency-investing-2018/](https://ethereumworldnews.com/poll-bitcoin-cryptocurrency-investing-2018/)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1cs5": [
        {
            "Parent ID": "t3_9zm1y3",
            "Comment ID": "eab1cs5",
            "Author": "LJprank",
            "Date Created": "11-23-2018 11:43:16",
            "Upvotes": -5,
            "Text": "Higher BTC prices has led to mining frenzy. Miners compete for rewards. A lot of power is wasted. Making planet even less - \"green\".\n\nLower price leads to unprofitability of mining - well unless some few thousand miner give it up and stop consuming power.\n\nThen  mining is profitable again. Much less power is spent, and the blockchain technology is still up and running.\n\nBTC self regulation mechanism in action. Ask me - that's SAVAGE … and fascinating.\n\nDo not blame BTC technology for price swings. Blame GREED - through organic greed + mining greed combined.\n\nI can almost write equation for it lol.\n\n&#x200B;\n\nBTC is the greed proof better the ANY other financial mechanism.\n\ngot to admire it.\n\n&#x200B;\n\n4.2k for BTC. next support at 3.8k.",
            "Edited?": "11-23-2018 11:49:58",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabqkaj": [
        {
            "Parent ID": "t1_eabq4sk",
            "Comment ID": "eabqkaj",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 17:31:21",
            "Upvotes": 2,
            "Text": "Don't tell them our secret.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaocpm": [
        {
            "Parent ID": "t1_eaajj87",
            "Comment ID": "eaaocpm",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 08:02:53",
            "Upvotes": 4,
            "Text": "It’s the only ship that sinks and then eventually resurfaces at a much higher elevation than before. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaak01o": [
        {
            "Parent ID": "t1_eaajj87",
            "Comment ID": "eaak01o",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 06:14:41",
            "Upvotes": -2,
            "Text": "Yeah but you have to calculate your Net Worth Du Jour based on how the investment fared.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab50nj": [
        {
            "Parent ID": "t1_eab4sdi",
            "Comment ID": "eab50nj",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 12:32:36",
            "Upvotes": 2,
            "Text": "Depends on the jurisdiction that you live in, but in most civilized countries at least, the answer is \"no\" unless they have a search warrant or a subpoena. Of course, it doesn't take much for law enforcement to get a search warrant or a subpoena . . . .",
            "Edited?": "11-23-2018 12:37:06",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6ol7": [
        {
            "Parent ID": "t1_eab602z",
            "Comment ID": "eab6ol7",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:53:00",
            "Upvotes": 8,
            "Text": "[deleted]",
            "Edited?": "03-15-2019 12:58:25",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabw54z": [
        {
            "Parent ID": "t1_eab602z",
            "Comment ID": "eabw54z",
            "Author": "time_wasted504",
            "Date Created": "11-23-2018 19:00:21",
            "Upvotes": 2,
            "Text": "yep. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab63ds": [
        {
            "Parent ID": "t1_eab602z",
            "Comment ID": "eab63ds",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 12:46:03",
            "Upvotes": -1,
            "Text": "Please, nobody is that silly, holding through a 75% correction would be madness",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaacqw6": [
        {
            "Parent ID": "t1_eaa7tm7",
            "Comment ID": "eaacqw6",
            "Author": "Diabolicus666",
            "Date Created": "11-23-2018 03:56:31",
            "Upvotes": 9,
            "Text": ">I love tracking bitcoin wallet creations. Keeps me confident in the future. Sure lots of these are duplicates, lots are people that will never buy any bitcoin or have any understanding of crypto...but some are new HODLERS, some are using their bitcoin, some hate current financial structure. It makes me giggle to hear people say bitcoin will reach 100 bucks or go to zero. Look at this chart from ANY time frame. And explain how that is remotely possible when new user rate is constantly increasing.\n\nI don't mean to piss on your parade, but these stats here paint a little different picture:\n\n[https://bitinfocharts.com/en/bitcoin/activeaddresses-btc.html](https://bitinfocharts.com/en/bitcoin/activeaddresses-btc.html)\n\nThere are only 600-650k active addresses, down \\~half a million from 12/2017 peak of 1.1 million.\n\n[https://bitinfocharts.com/en/top-100-richest-bitcoin-addresses.html](https://bitinfocharts.com/en/top-100-richest-bitcoin-addresses.html)\n\nThere are only \\~6.5 million BTC addresses worth >$100, and thereof only \\~2.1 million addresses worth >$1000.\n\nAdoption is a myth.\n\nEdit:\n\nComparison with this *'historic'* rich list chart from 2/2018 shows only very little change:\n\n[https://web.archive.org/web/20180206125340/https://bitinfocharts.com/en/top-100-richest-bitcoin-addresses.html](https://web.archive.org/web/20180206125340/https://bitinfocharts.com/en/top-100-richest-bitcoin-addresses.html)\n\nLots of consolidation in the dust addresses (down 7%) happened, but the 0.01-0.1 range and the 0.1-1.0 range (where one would expect most new adopters who throw a couple hundred bucks into bitcoin to show up) only added 4% and 2% of new addresses respectively. Both ranges combined only grew by\\~40k BTC (from 660k to 700k BTC) over the last 9 months. And that despite the fact that price is now lower than back then (on Feb 6th price reached the 6k low after the 20k peak).",
            "Edited?": "11-23-2018 04:21:27",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa947c": [
        {
            "Parent ID": "t1_eaa7tm7",
            "Comment ID": "eaa947c",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 02:34:28",
            "Upvotes": -1,
            "Text": "You are right that it will recover but it's probably going to take a long time before reaching ath again. This drop was exceptional in that it didn't follow the market sentiment. Bitcoin was bottoming out and the lowest point of interest was reached. Because of the fork, people shifted their money to the forks. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac3nmq": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eac3nmq",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 21:06:39",
            "Upvotes": 6,
            "Text": "Well at least we positive peeps are still around to balance things out. u/bitcoinalways should chant **”comon bulls”** again just to really get under their skin. 🙃",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacjpk7": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eacjpk7",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 02:34:16",
            "Upvotes": 6,
            "Text": "Why are people being negative about my magic beans?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzy8b": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eabzy8b",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:03:37",
            "Upvotes": 16,
            "Text": "Like - is this group supposed to be a \"power of positive thinking for crypto\" circle jerk?  Or a serious discussion about bitcoin which includes skeptics.\n\nSeems in light of the events of the last year that skeptics should be welcomed in with open arms.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac20no": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eac20no",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:38:20",
            "Upvotes": 4,
            "Text": "See my post regarding OliveT .. and Shorty below.\n\nThey are the same person.\n\nI personally would like to see Shorty banned from these boards for breaking Reddit rules.",
            "Edited?": "11-23-2018 21:21:29",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac7me4": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eac7me4",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 22:15:37",
            "Upvotes": 3,
            "Text": "But these are the people that are constantly right and have been right about the price alle year long. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacbdpv": [
        {
            "Parent ID": "t1_eabzos9",
            "Comment ID": "eacbdpv",
            "Author": "Incognitoralph",
            "Date Created": "11-23-2018 23:23:03",
            "Upvotes": 1,
            "Text": "you realize how necessary disinformation is? If even one retard holds bitcoin its a waste of humanity. They are here as a service, our service. weed out the noobs, we can't let them hold it ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzazj": [
        {
            "Parent ID": "t1_eabz3md",
            "Comment ID": "eabzazj",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 19:52:51",
            "Upvotes": 2,
            "Text": "preach.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaa85y4": [
        {
            "Parent ID": "t1_eaa83hw",
            "Comment ID": "eaa85y4",
            "Author": "Craig__S__Wright",
            "Date Created": "11-23-2018 02:11:19",
            "Upvotes": 6,
            "Text": "Idk about you but my fridge is full of leftovers. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatt1m": [
        {
            "Parent ID": "t1_eaa83hw",
            "Comment ID": "eaatt1m",
            "Author": "bangohat5",
            "Date Created": "11-23-2018 09:51:55",
            "Upvotes": 0,
            "Text": "Thanks for reminding me. I love watching the black Friday animals on youtube fighting and trampling each other like wild monkeys.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaidqj": [
        {
            "Parent ID": "t1_eaai7oj",
            "Comment ID": "eaaidqj",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 05:42:29",
            "Upvotes": 1,
            "Text": "[removed]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaj406": [
        {
            "Parent ID": "t1_eaaj2so",
            "Comment ID": "eaaj406",
            "Author": "crayzcrinkle",
            "Date Created": "11-23-2018 05:55:45",
            "Upvotes": 14,
            "Text": "Let me just qualify that I am likely talking out my ass like everyone else. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaapvrx": [
        {
            "Parent ID": "t1_eaap7zb",
            "Comment ID": "eaapvrx",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 08:37:20",
            "Upvotes": 4,
            "Text": "Why should they when they have so much material from 2011, 2014 and 2015 to choose from?  You’re asking a lot from them. They’re not too bright after all. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaeu8v": [
        {
            "Parent ID": "t1_eaaajef",
            "Comment ID": "eaaeu8v",
            "Author": "machn",
            "Date Created": "11-23-2018 04:36:22",
            "Upvotes": 13,
            "Text": "Comparing Bitcoin today with what it was five or ten yrs back is one of the silliest things. Conflating just a decade old 'technology' to financial markets or currency and trying to predict how it will work in future is never gonna work. IT IS NOT THE SAME. \n\nAlso the game really changed in 2016-17, You can't mine coins on your laptop anymore. The 'democratization' was killed when these huge mining farms came into the picture. Bitcoin isn't making people in poor countries richer or bringing ethics to currency trade. The people who could afford mining rigs were (on a global scale) rich already. This was, in most parts, always a gold rush. \n\nIf this thing has to last, people have to be honest at least. \n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaay5n7": [
        {
            "Parent ID": "t1_eaaajef",
            "Comment ID": "eaay5n7",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 11:00:42",
            "Upvotes": 2,
            "Text": "You should have bought apple stocks then back in the 90´s! WHY DIDN´T you!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaac8cr": [
        {
            "Parent ID": "t1_eaaajef",
            "Comment ID": "eaac8cr",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 03:46:21",
            "Upvotes": -2,
            "Text": "It's different now that there was massive exposure in december. To reach 20k you need massive exposure, a hype that has never been seen in human history. So at 20k you really exhausted maximum exposure. Yeah, and then there is the option of institutional money but of course institutions are not going to gamble with people's money so that is excluded. Conclusion: 5 to 10 years before hitting 20k again.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaadeg2": [
        {
            "Parent ID": "t1_eaabwx0",
            "Comment ID": "eaadeg2",
            "Author": "Spykwak",
            "Date Created": "11-23-2018 04:08:34",
            "Upvotes": 4,
            "Text": "If bitcoin is overbought, miners are scaling up the network because they are making a tidy profit and have extra cash to claim a higher % of the network\n\nIf bitcoin is oversold, miners are running at a loss because they have to pay the bill. Old tech and miners running with expensive electricity have to shutdown scaling down the network.\n\nIdeally we should have a stable price and a stable hashrate (all things being equal such as technological advances in mining efficiency and electricity cost)\n\nNow we are in a situation were mining operation are hurting (hashrate is going down for 2 difficulty retarget, many/most of hobby miner are getting off the grid, some major mining operation are filling for bankruptcy) , it means that Bitcoin is oversold for the current size of te network. If the price continue to tank, only the most healthy mining operation will continue to sustain the network until the price stabilize. Then we will be able to shoot back up once we reach the bottom of the pool :-)\n\nYou also have delay in scaling up because of the lead time to deliver the hardware to the miners + deployment time.\n\nYou have delay in scaling down because miners are not shutting down until they loose hope of BTC price recovery or when the debt collector start knocking at their doors.\n\nNew advances in technology could increase the hashrate for a identical price of BTC because those miner will get a better margin over their competition. This will push older tech out of the network continuously.",
            "Edited?": "11-23-2018 04:12:45",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaahh18": [
        {
            "Parent ID": "t1_eaabwx0",
            "Comment ID": "eaahh18",
            "Author": "Diabolicus666",
            "Date Created": "11-23-2018 05:26:13",
            "Upvotes": 2,
            "Text": "That chart in logarithmic view gives a much clearer picture:\n\n[https://bitinfocharts.com/en/bitcoin/price-hashrate-btc.html#log](https://bitinfocharts.com/en/bitcoin/price-hashrate-btc.html#log)\n\nAfter each major peak you see hashrate form a plateau for the following year(s):\n\n06/2011 peak -> hash rate spend the next \\~20 months in the \\~10-25 Terahash range\n\n12/2013 peak -> hash rate levels out half a year later and stays for another 12 months in the \\~200-500 Petahash range\n\n12/2017 peak -> hash rate levels out half a year later and stays for another 12? months in the 30-50? Exahash range?\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaad72a": [
        {
            "Parent ID": "t1_eaabwx0",
            "Comment ID": "eaad72a",
            "Author": "dexX7",
            "Date Created": "11-23-2018 04:04:39",
            "Upvotes": 1,
            "Text": "The saying is usually that hash rate follows price.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzn9q": [
        {
            "Parent ID": "t1_eabg1jv",
            "Comment ID": "eabzn9q",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 19:58:34",
            "Upvotes": 1,
            "Text": "i feel confident that jimi hendrix would have been a hodler had he lived to see bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab32o9": [
        {
            "Parent ID": "t1_eaa7onu",
            "Comment ID": "eab32o9",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 12:06:17",
            "Upvotes": 3,
            "Text": "oh crap.  so i'm poor and... not great.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaes1b": [
        {
            "Parent ID": "t1_eaa7onu",
            "Comment ID": "eaaes1b",
            "Author": "d3vrandom",
            "Date Created": "11-23-2018 04:35:16",
            "Upvotes": 3,
            "Text": "nice man. i like the idea of those lamb chops too",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaim05": [
        {
            "Parent ID": "t1_eaa7uoq",
            "Comment ID": "eaaim05",
            "Author": "nonhomogeneous",
            "Date Created": "11-23-2018 05:46:32",
            "Upvotes": 3,
            "Text": "Lambo & chill?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabwjal": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabwjal",
            "Author": "sp5low",
            "Date Created": "11-23-2018 19:06:48",
            "Upvotes": 12,
            "Text": "Great review of the whole story of bitcoin. You deserve an upvote!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabuyyx": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabuyyx",
            "Author": "TractorOfTheDoom",
            "Date Created": "11-23-2018 18:41:46",
            "Upvotes": 5,
            "Text": "brb going to hang myself",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabw5u1": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabw5u1",
            "Author": "fakersdozen",
            "Date Created": "11-23-2018 19:00:40",
            "Upvotes": 3,
            "Text": "Ouch",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac70kp": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eac70kp",
            "Author": "gblackdragon",
            "Date Created": "11-23-2018 22:04:45",
            "Upvotes": 6,
            "Text": "Thanks for writing. Very insightful article u got.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac8cb3": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eac8cb3",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 22:28:25",
            "Upvotes": 2,
            "Text": "Point 6 and 10 are the most important. At minimum, Bitcoin will stay a digital online casino, with sophisticated traders trading against eachother. 90 percent of people probably lose. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabziaa": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabziaa",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 19:56:14",
            "Upvotes": 4,
            "Text": "Green flag #1 - We’ve reached peak naysayer",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ead9axp": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "ead9axp",
            "Author": "guccinho",
            "Date Created": "11-24-2018 11:28:03",
            "Upvotes": 1,
            "Text": "What’s a median of exchange?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzre4": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabzre4",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:00:28",
            "Upvotes": 1,
            "Text": "Fucking hell that was boring.\n\nDo you honestly think that people on this subreddit haven't considered all of these matters?\n\nThe arrogance and pretence behind writing a series of long, preaching, semi-considered paragraphs like that above, is frankly embarrassing.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabx2za": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabx2za",
            "Author": "Dontrun_glide",
            "Date Created": "11-23-2018 19:15:48",
            "Upvotes": -3,
            "Text": "Have you really got the spare time to write all that?\n\nIt seems very strange to me.\n\nWhy don't you go and mow your lawn, or trim a tree or something?\n\nI just don't get it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyxh1": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eabyxh1",
            "Author": "WW91ciBtb20gaXMgZ2F5",
            "Date Created": "11-23-2018 19:46:31",
            "Upvotes": -4,
            "Text": "holy shit. you actually typed that?  ewww who the fuck reads that??? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacagjh": [
        {
            "Parent ID": "t1_eabujsk",
            "Comment ID": "eacagjh",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 23:06:29",
            "Upvotes": -3,
            "Text": "You continue to stay far away?? The longest reddit post I've seen to date in a bitcoin sub is your idea of staying far away from bitcoin? I'd hate to see what an obsessive mess you'd be in if you were continuing to stay close.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxg9g": [
        {
            "Parent ID": "t1_eaaw5n8",
            "Comment ID": "eaaxg9g",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:50:59",
            "Upvotes": 9,
            "Text": "Anywhere below 6k could potentially reward you in a few years but you have to think long term, and you should NEVER invest more than you can afford to lose. The main reason there are so many trolls and non-invested people in a bitcoin sub is because they are teenagers and kids who still have not matured and enjoy schoolyard insults. BUT ... they do it because they think all crypto investors put way more money than they could afford to lose in the market and now their lives have collapsed. This is simply not true at all, but I would still offer you the above advice - don't feed the stereotype :).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxxm9": [
        {
            "Parent ID": "t1_eaaw5n8",
            "Comment ID": "eaaxxm9",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 10:57:40",
            "Upvotes": 3,
            "Text": "Yeah bro, but keep it small no selling the farm shit. It’s a fun market and the last few years have been up and down like a whore house so you won’t be bored. My advice? Know when to sell and learn how to short.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabxqn8": [
        {
            "Parent ID": "t1_eaaw5n8",
            "Comment ID": "eabxqn8",
            "Author": "BitChick",
            "Date Created": "11-23-2018 19:26:42",
            "Upvotes": 2,
            "Text": "This is a great time to buy.  Anyone who has purchased BTC and held longer than a couple years has done really well, regardless of when they purchased so keep that in mind.  But here is the best advice I have found on this investment to date.  The only regrets my husband and I have are not following it even more closely than we have (sold a greater percentage earlier on and not holding as much long term) but still thankful that we have done well with it.  It does take patience though: \n\nhttps://bitcointalk.org/index.php?topic=345065.0",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab3llj": [
        {
            "Parent ID": "t1_eaaw5n8",
            "Comment ID": "eab3llj",
            "Author": "Pickles112358",
            "Date Created": "11-23-2018 12:13:08",
            "Upvotes": 1,
            "Text": "Id certanly make first a purchase before january but id say split your buys by month or two after that (dont enter all at once)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab8whe": [
        {
            "Parent ID": "t1_eab4c97",
            "Comment ID": "eab8whe",
            "Author": "CrazyBeluga",
            "Date Created": "11-23-2018 13:20:59",
            "Upvotes": 7,
            "Text": "\"redditor for two weeks\"\n😂",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab72qz": [
        {
            "Parent ID": "t1_eab6g0l",
            "Comment ID": "eab72qz",
            "Author": "ihatemaps",
            "Date Created": "11-23-2018 12:57:57",
            "Upvotes": 3,
            "Text": "\"Redditor for 4 weeks.\" /r/quityourbullshit ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabb374": [
        {
            "Parent ID": "t1_eab6g0l",
            "Comment ID": "eabb374",
            "Author": "maxtbag",
            "Date Created": "11-23-2018 13:49:11",
            "Upvotes": 1,
            "Text": "Ah fresh accounts made solely to troll on this subreddit. Gotta give it to these guys, they are committed. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabsm4c": [
        {
            "Parent ID": "t1_eabcpfg",
            "Comment ID": "eabsm4c",
            "Author": "ToBitOrNotToBit",
            "Date Created": "11-23-2018 18:04:00",
            "Upvotes": 3,
            "Text": "I don't get what you're saying.\n\nClarify what you say about price.\n\nBeyond that, the hash power doesn't define the price. Check last months",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabe9oe": [
        {
            "Parent ID": "t1_eabcpfg",
            "Comment ID": "eabe9oe",
            "Author": "FUDGenerator",
            "Date Created": "11-23-2018 14:30:52",
            "Upvotes": 5,
            "Text": "less miners means it'll be easier to obtain a 51% majority, so expect attacks to happen that will make bitcoin unusable ending with it becoming worthless",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabgr39": [
        {
            "Parent ID": "t1_eabcpfg",
            "Comment ID": "eabgr39",
            "Author": "CONTROLurKEYS",
            "Date Created": "11-23-2018 15:04:58",
            "Upvotes": 1,
            "Text": "Don't believe everything you read ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabiexu": [
        {
            "Parent ID": "t1_eabcpfg",
            "Comment ID": "eabiexu",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:28:20",
            "Upvotes": 0,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:17:21",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eablmy2": [
        {
            "Parent ID": "t1_eabhzs3",
            "Comment ID": "eablmy2",
            "Author": "mhogue51",
            "Date Created": "11-23-2018 16:15:13",
            "Upvotes": 2,
            "Text": "Nice video lol. I stopped buying",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabia8t": [
        {
            "Parent ID": "t1_eabhzs3",
            "Comment ID": "eabia8t",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:26:34",
            "Upvotes": -5,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:17:24",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabcj51": [
        {
            "Parent ID": "t1_eabc1yz",
            "Comment ID": "eabcj51",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 14:07:45",
            "Upvotes": 1,
            "Text": ">https://www.youtube.com/watch?v=lcOxhH8N3Bo\n\n[https://www.youtube.com/watch?v=YKp-BFNIGFI](https://www.youtube.com/watch?v=YKp-BFNIGFI)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabdqsp": [
        {
            "Parent ID": "t1_eabc1yz",
            "Comment ID": "eabdqsp",
            "Author": "RulerZod",
            "Date Created": "11-23-2018 14:23:50",
            "Upvotes": 1,
            "Text": "That music video gave me goosebumps",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabvmur": [
        {
            "Parent ID": "t1_eabuamt",
            "Comment ID": "eabvmur",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 18:52:12",
            "Upvotes": -1,
            "Text": "Less sympathy for the true believers who have ridden it so far down.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaam2a4": [
        {
            "Parent ID": "t1_eaakyz2",
            "Comment ID": "eaam2a4",
            "Author": "_I_O_T_A_",
            "Date Created": "11-23-2018 07:05:26",
            "Upvotes": 5,
            "Text": "Can I pay with bitcoin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaanikp": [
        {
            "Parent ID": "t1_eaakyz2",
            "Comment ID": "eaanikp",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 07:43:29",
            "Upvotes": 3,
            "Text": "As pathetic as trolling is bro at least the other trolls put a little effort in it ya? Repeating the exact same shit that everyone was saying in 2014 is lame AF. COMON little troll put some effort into it!! Lazy little troll.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaajqhm": [
        {
            "Parent ID": "t1_eaafteg",
            "Comment ID": "eaajqhm",
            "Author": "lizardturtle",
            "Date Created": "11-23-2018 06:09:04",
            "Upvotes": 6,
            "Text": "I'm not sure why you would convert an asset with a market value of $0 to $0, but power to you brother!\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaahqhd": [
        {
            "Parent ID": "t1_eaafteg",
            "Comment ID": "eaahqhd",
            "Author": "Incognitoralph",
            "Date Created": "11-23-2018 05:30:54",
            "Upvotes": 4,
            "Text": "Fuck.... this guy knows his shit he did the math. Two ways boys we either go all the way to millions or zero!!! Choose wisely!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaak0zc": [
        {
            "Parent ID": "t1_eaafteg",
            "Comment ID": "eaak0zc",
            "Author": "trade_noob29",
            "Date Created": "11-23-2018 06:15:15",
            "Upvotes": 3,
            "Text": "The delusion of people here always amuses me! :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaanu2n": [
        {
            "Parent ID": "t1_eaafteg",
            "Comment ID": "eaanu2n",
            "Author": "Inspecta86",
            "Date Created": "11-23-2018 07:50:55",
            "Upvotes": 1,
            "Text": "Would have gave $9999999 for 1 BTC but since u aint selling so bye",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab2s1s": [
        {
            "Parent ID": "t1_eaafteg",
            "Comment ID": "eab2s1s",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 12:02:16",
            "Upvotes": 1,
            "Text": "same here.  moon or bust.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaae90b": [
        {
            "Parent ID": "t1_eaa9ftf",
            "Comment ID": "eaae90b",
            "Author": "Spykwak",
            "Date Created": "11-23-2018 04:25:41",
            "Upvotes": 6,
            "Text": "“Private company using their own crypto currency”\n\nWhy ... but why ? \n\nThe whole point of crypto currency is to not have a central authority and rely on trusting it. Then just trust someone with a spreadsheet or a traditional relational database to make the accounting for everyone. Oh wait, those are the banks? Let’s keep working with these, It has never been wrong with these guys. What could possibly go wrong with the traditional system?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaadduk": [
        {
            "Parent ID": "t1_eaa9ftf",
            "Comment ID": "eaadduk",
            "Author": "Kaslion",
            "Date Created": "11-23-2018 04:08:15",
            "Upvotes": 2,
            "Text": "Open source P2P lightning network that puts a million transactions within 1 block insertion.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabdg31": [
        {
            "Parent ID": "t1_eabck5r",
            "Comment ID": "eabdg31",
            "Author": "Dwigt_Rortugal",
            "Date Created": "11-23-2018 14:19:58",
            "Upvotes": 5,
            "Text": "Yeah that's weird. I would never do that",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabgia8": [
        {
            "Parent ID": "t1_eabck5r",
            "Comment ID": "eabgia8",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:01:33",
            "Upvotes": 2,
            "Text": "NEVER have your private key, stamped, engraved or anything. Keep it locked on your I notes or write it down and hide it only somewhere you know ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaaxe8": [
        {
            "Parent ID": "t1_eaaasmt",
            "Comment ID": "eaaaxe8",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 03:18:01",
            "Upvotes": 4,
            "Text": "The only thing pathetic here is you and your trolling.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaadync": [
        {
            "Parent ID": "t1_eaaasmt",
            "Comment ID": "eaadync",
            "Author": "Spykwak",
            "Date Created": "11-23-2018 04:19:50",
            "Upvotes": 4,
            "Text": "Dude, you are so smart, the writing were on the wall in front of your eyes! You saw it and you took your opportunity and put your money were your superior inteligence is by shorting bitcoin with 100x leverage and are now rich beyond comprehension!\n\nNo, you didn’t short bitcoin?\n\nOh nooooh what a missed opportunity...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaidwl": [
        {
            "Parent ID": "t1_eaaasmt",
            "Comment ID": "eaaidwl",
            "Author": "krom1985",
            "Date Created": "11-23-2018 05:42:34",
            "Upvotes": 2,
            "Text": "BULLISH!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaabrv1": [
        {
            "Parent ID": "t1_eaaasmt",
            "Comment ID": "eaabrv1",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 03:36:10",
            "Upvotes": 1,
            "Text": "Lol. That was funny. It is not dead. We deal with a new technology and people are too addicted to gambling. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaavyx": [
        {
            "Parent ID": "t1_eaaasmt",
            "Comment ID": "eaaavyx",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 03:17:10",
            "Upvotes": 0,
            "Text": "So how much did you lose?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab85iz": [
        {
            "Parent ID": "t1_eab7zpm",
            "Comment ID": "eab85iz",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 13:11:28",
            "Upvotes": 12,
            "Text": "Having an alternative opinion to yours is a troll?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab8dw9": [
        {
            "Parent ID": "t1_eab7zpm",
            "Comment ID": "eab8dw9",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:14:22",
            "Upvotes": 13,
            "Text": "[deleted]",
            "Edited?": "03-15-2019 12:58:10",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabn2uw": [
        {
            "Parent ID": "t1_eab7zpm",
            "Comment ID": "eabn2uw",
            "Author": "fakersdozen",
            "Date Created": "11-23-2018 16:37:18",
            "Upvotes": 3,
            "Text": "So the 12 people that question btc on this sub affect the price, but the million that lost actually money don't? You going to go asking every person how they feel and try to censor them to? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabkryb": [
        {
            "Parent ID": "t1_eab7zpm",
            "Comment ID": "eabkryb",
            "Author": "fakersdozen",
            "Date Created": "11-23-2018 16:01:46",
            "Upvotes": 2,
            "Text": "Btc sub on reddit affects the actual price of btc! They are all paid shills FUDDING on btc for the big banks!!! Its reverse manipulation. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabsfu7": [
        {
            "Parent ID": "t1_eab7zpm",
            "Comment ID": "eabsfu7",
            "Author": "urgoingdownbitch01",
            "Date Created": "11-23-2018 18:01:12",
            "Upvotes": 3,
            "Text": "Excuse me but us popcorn munchers fulfill a valuable service to this community. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1ttf": [
        {
            "Parent ID": "t1_eaaz0ve",
            "Comment ID": "eab1ttf",
            "Author": "Fredflinstone1",
            "Date Created": "11-23-2018 11:49:37",
            "Upvotes": 2,
            "Text": "I bought at 1 btc at 11k. Maybe some day I’ll see my 7k again...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1x1p": [
        {
            "Parent ID": "t1_eaaz0ve",
            "Comment ID": "eab1x1p",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 11:50:52",
            "Upvotes": 2,
            "Text": "Some good points but the dot com bubble left us with the internet and the foundational organizations that run on it. So what took 5 years back then now takes about 1 year because the internet has fast tracked progress. That's why bitcoin only took 9 years to hit last year's high point and the internet took 25 years to reach the dot com bubble.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab85s5": [
        {
            "Parent ID": "t1_eaaz0ve",
            "Comment ID": "eab85s5",
            "Author": "ToonaFish867",
            "Date Created": "11-23-2018 13:11:33",
            "Upvotes": 2,
            "Text": "What you said is the reason why dumb retail investors lose money. Buy on the green and hold through ATH thinking their several thousand dollar investment will take them to the moon and make them millionaire. Then, bear market hits. They're in the red very early during consolidation because they bought so high when the hype train was already beginning to fly. Despite many chances to buy cheap BTC on discounts during a bear market, they're to weak and scared to buy. Yeap. Whales would never get rich without dumb money to manipulate with hype and capitulation cycles.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavdqm": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaavdqm",
            "Author": "CrimsonEnigma",
            "Date Created": "11-23-2018 10:18:46",
            "Upvotes": 7,
            "Text": "> It’s in the thousands today. How many of your stock shares are 4K a piece? Go on take a look and let us know. Cause I play a lot of stocks and NOT ONE of em are near 4k per share. So why in the flyin fuck are you calling bitcoin dead?? If you’re calling time of death at 4K then the shit you had for brains must have ran down over your sunlight deprived little basement eyes ya?\n\nYou...really don’t know how the stock market works, do you?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxynl": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaaxynl",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 10:58:04",
            "Upvotes": 5,
            "Text": "You can’t compare share price to share price.  It’s called market capitalization. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatoe0": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaatoe0",
            "Author": "ExodiaTheBrazilian",
            "Date Created": "11-23-2018 09:49:31",
            "Upvotes": 2,
            "Text": "There's no need to be so triggered",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaay1kz": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaay1kz",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 10:59:11",
            "Upvotes": 2,
            "Text": "\"hurrr durr you should have seen bitcoin LAST year it was AMAZING! \"",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaolee": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaaolee",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 08:08:14",
            "Upvotes": 5,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaof2v": [
        {
            "Parent ID": "t1_eaao2z1",
            "Comment ID": "eaaof2v",
            "Author": "berningsteve",
            "Date Created": "11-23-2018 08:04:18",
            "Upvotes": 1,
            "Text": "Year over year comparisons are not good.\nNew investors are probably not born yet.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaar24s": [
        {
            "Parent ID": "t1_eaaolok",
            "Comment ID": "eaar24s",
            "Author": "sbgriffin",
            "Date Created": "11-23-2018 09:01:21",
            "Upvotes": 9,
            "Text": "Please explain to me how is it going to be a standard as a currency if you are holding it and not spending it? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxwbw": [
        {
            "Parent ID": "t1_eaaolok",
            "Comment ID": "eaaxwbw",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 10:57:10",
            "Upvotes": 4,
            "Text": "That´s dumb, so basically \"the only way for bitcoin to become a standard world currency is by NOT spending it\" genius assertion there pal",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaarxmf": [
        {
            "Parent ID": "t1_eaaolok",
            "Comment ID": "eaarxmf",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 09:18:17",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaapqdf": [
        {
            "Parent ID": "t1_eaaolok",
            "Comment ID": "eaapqdf",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 08:34:07",
            "Upvotes": 0,
            "Text": "You have to understand the following.\n\nIf something is in Demand for the sole purpose of reselling it higher, that is not an authentic, deep demand.\n\nSuppose a wealthy prisoner in jail has a stack of 1000 cigarettes (money). If the others reject his currency, he can still smoke them (intrinsic value).\n\nBut if he owned 1000 fake torrents, then if the other prisoners reject his currency, he can just throw them into the recycle bin (no intrinsic value).\n\nTldr You are deluding yourself that BTC is ever going above 4300 in the next one quadrillion thousand millennias.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabnoho": [
        {
            "Parent ID": "t1_eaaurnp",
            "Comment ID": "eabnoho",
            "Author": "Chroko",
            "Date Created": "11-23-2018 16:46:24",
            "Upvotes": 2,
            "Text": "Your conclusion is wrong.\n\nThe idea of the technology is sound, Blockchain is a distributed shared database design with some revolutionary ideas. But that's completely separate from the implementation of Bitcoin.\n\nAs a \"value token\", \"currency\" or even \"investment\", Bitcoin is the dumbest idea since Beenie Babies. It has no privacy and barely has the capacity to function. The community repeatedly tries to clone it to dillute value. Bitcoin proponents are all \"get rich quick\" pyramid schemers who are trying to fuck each other over.\n\nThe long-term legacy of Bitcoin will be Blockchain algorithms being used in niche private corporate databases that the general public will never see.\n\nSo no, you shouldn't support the \"currency\" just because there's a neat idea at the heart of it. Bitcoin uses Blockchain, but Blockchain is not Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaav5kn": [
        {
            "Parent ID": "t1_eaaurnp",
            "Comment ID": "eaav5kn",
            "Author": "ExodiaTheBrazilian",
            "Date Created": "11-23-2018 10:14:50",
            "Upvotes": -4,
            "Text": "Please do. There's a demand for foolishness in the marketplace and you guys do a great service providing it in the form of liquidity for bullshit assets like bitcoin",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9v71": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eab9v71",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 13:33:39",
            "Upvotes": 8,
            "Text": "Past performance is not a guarantee of future performance",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabdvcc": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eabdvcc",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 14:25:30",
            "Upvotes": 4,
            "Text": "Name one asset that has ever recovered from the size of the bubble you saw in 2017. Still waiting for the ATH on Tulips? How are your Cisco shares performing? Can't wait for the South Sea Company to moon? Going all in on GoPro?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabdu41": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eabdu41",
            "Author": "shamokin",
            "Date Created": "11-23-2018 14:25:03",
            "Upvotes": 2,
            "Text": "Previously the market cap was always small. The market cap was much bigger all time highs. Good luck regaining it",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaba6ed": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eaba6ed",
            "Author": "maxtbag",
            "Date Created": "11-23-2018 13:37:36",
            "Upvotes": 6,
            "Text": "You are assuming nothing has changed in the market. Things are totally different now and if you really think this crash and previous crashes are the same you are delusional. Really amazes me how naive you guys can be, defying logic to suit your beliefs. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabe3s6": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eabe3s6",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 14:28:35",
            "Upvotes": 1,
            "Text": "Pearl Jam - Alive HQ\n\nhttps://www.youtube.com/watch?v=S_wFqbC15h4",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9qun": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eab9qun",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:32:05",
            "Upvotes": 1,
            "Text": "I think I'll win the MegaMillions twice in a row before that happens.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabej26": [
        {
            "Parent ID": "t1_eab9j7j",
            "Comment ID": "eabej26",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 14:34:28",
            "Upvotes": 0,
            "Text": "Unbelievably high percentage of western world population invested in btc in december, with extreme exposure, do not forget that. 20k is extremely high at the moment. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaasy9x": [
        {
            "Parent ID": "t1_eaasn5u",
            "Comment ID": "eaasy9x",
            "Author": "LemosineRidin",
            "Date Created": "11-23-2018 09:37:14",
            "Upvotes": 7,
            "Text": "What kind of trolling do you do throughout the bull run?  Is it like your offseason? Or do you simply hibernate? How does your schedule work 😂",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatsd4": [
        {
            "Parent ID": "t1_eaasn5u",
            "Comment ID": "eaatsd4",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 09:51:35",
            "Upvotes": 2,
            "Text": "Pamplona stomping of bitcoin",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eablhtb": [
        {
            "Parent ID": "t1_eabid8i",
            "Comment ID": "eablhtb",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 16:12:57",
            "Upvotes": 5,
            "Text": "If you have thousands of miners get on board, with millions of $$ of computing equipment around the entire globe to reinforce, stabilize and secure your network, a growing community of brilliant developers contributing to the  code, improving it ongoing, with layers and protocols and side chains etc. Now if you just get 10 years in to build the foundation and confidence that it will run with 99.999% up time like Bitcoin then YEAH!! You sure could buddy, You go!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabik0k": [
        {
            "Parent ID": "t1_eabid8i",
            "Comment ID": "eabik0k",
            "Author": "damchi",
            "Date Created": "11-23-2018 15:30:18",
            "Upvotes": 2,
            "Text": "Do it and see what happens. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabpslw": [
        {
            "Parent ID": "t1_eabid8i",
            "Comment ID": "eabpslw",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 17:19:05",
            "Upvotes": 4,
            "Text": "You don't need technical support or a network. Just brand it as b2 and hold a huge event for only \"crypto elites\", but not anybody with a technical background -- old folks with fat IRAs are best. Tell them that next year's market cap will be 432.8 billion, and each unit will be worth at least 5600 but they can buy today at 10 so long as they buy a minimum of 10,000 units ($100,000 total per investor).\n\nGet 200 people to sign up and collect their money. For a few months send out some technical-sounding reports telling how great b2 is doing. Then, put out a report that events in China plus a conspiracy of the banks and the Fed have really hurt b2, but you still have faith and will buy back units at 1 each.\n\nKeep putting out reports for another couple of years until the Statute of Limitations for fraud expires, and then say with deep regrets the banks and the Fed won, so you're having to close up shop, but b2 units can be redeemed at par in Zimbabwean dollars.\n\nEasy peasy!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabjj76": [
        {
            "Parent ID": "t1_eabid8i",
            "Comment ID": "eabjj76",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 15:43:31",
            "Upvotes": 1,
            "Text": "Take my money",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eablct8": [
        {
            "Parent ID": "t1_eabid8i",
            "Comment ID": "eablct8",
            "Author": "mhogue51",
            "Date Created": "11-23-2018 16:10:46",
            "Upvotes": 1,
            "Text": "The similar size network would add the value, wouldn't it?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6svr": [
        {
            "Parent ID": "t1_eab6kgp",
            "Comment ID": "eab6svr",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:54:29",
            "Upvotes": 7,
            "Text": "Just bought more",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7opi": [
        {
            "Parent ID": "t1_eab6kgp",
            "Comment ID": "eab7opi",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:05:39",
            "Upvotes": 4,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7f6l": [
        {
            "Parent ID": "t1_eab6kgp",
            "Comment ID": "eab7f6l",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 13:02:19",
            "Upvotes": 3,
            "Text": "I bought using DCA from 13-16 and am now rich so you’re wrong.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab83bw": [
        {
            "Parent ID": "t1_eab6kgp",
            "Comment ID": "eab83bw",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:10:41",
            "Upvotes": 2,
            "Text": "and I come to laugh at posts like yours",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabiotc": [
        {
            "Parent ID": "t1_eab6kgp",
            "Comment ID": "eabiotc",
            "Author": "TrueCryptoFan",
            "Date Created": "11-23-2018 15:32:13",
            "Upvotes": 2,
            "Text": "Such weak hands. Its the people like you that will be we will be laughing at in the end",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab5ouy": [
        {
            "Parent ID": "t1_eab5h5s",
            "Comment ID": "eab5ouy",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 12:41:23",
            "Upvotes": 4,
            "Text": "When moon?\n\nLambo?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaabcz7": [
        {
            "Parent ID": "t1_eaaa311",
            "Comment ID": "eaabcz7",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 03:27:12",
            "Upvotes": -2,
            "Text": "Smells like dog shit to me!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachdyq": [
        {
            "Parent ID": "t1_eacgk57",
            "Comment ID": "eachdyq",
            "Author": "maxtbag",
            "Date Created": "11-24-2018 01:34:05",
            "Upvotes": 6,
            "Text": "What's even your point here? Is this like a \"haha I made money and you guys lost money\"? That's some low IQ sh*t right there lol",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacn1q9": [
        {
            "Parent ID": "t1_eacgk57",
            "Comment ID": "eacn1q9",
            "Author": "SuperiorExcess",
            "Date Created": "11-24-2018 04:10:50",
            "Upvotes": 3,
            "Text": "Take off the tinfoil hat? *Hahahahahahahaha*",
            "Edited?": "11-24-2018 12:06:32",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacgww3": [
        {
            "Parent ID": "t1_eacgk57",
            "Comment ID": "eacgww3",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-24-2018 01:21:52",
            "Upvotes": 1,
            "Text": "You make some very compelling arguments. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzfnu": [
        {
            "Parent ID": "t1_eabxuia",
            "Comment ID": "eabzfnu",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 19:55:00",
            "Upvotes": 6,
            "Text": "And we need bears that come out only when the price drops just so they can pretend they predicted it and feel good about otherwise achieving nothing. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaadflm": [
        {
            "Parent ID": "t1_eaacb7d",
            "Comment ID": "eaadflm",
            "Author": "skaska23",
            "Date Created": "11-23-2018 04:09:13",
            "Upvotes": 2,
            "Text": "Somethig totally bullshit",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabairs": [
        {
            "Parent ID": "t1_eab896j",
            "Comment ID": "eabairs",
            "Author": "xaxiomatic",
            "Date Created": "11-23-2018 13:41:56",
            "Upvotes": 1,
            "Text": "These days the only mining you can do is with very specialized hardware lookup ASICS if you're curious.\n\nUsed to be that way. \n\nWhat your node will do is validate the blocks with transactions. There is no reward in it but it will strengthen the network so it is useful. And you might learn a thing or two by doing it. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacgyg4": [
        {
            "Parent ID": "t1_eacf3yn",
            "Comment ID": "eacgyg4",
            "Author": "damchi",
            "Date Created": "11-24-2018 01:22:57",
            "Upvotes": 1,
            "Text": "And 25% of Europeans and 21% of Americans expect to own it in the future. Bright times ahead :) \n\n“Half Of The Remaining Non-Minted Bitcoin Supply Is ‘Spoken For…’” by Ryan Radloff https://link.medium.com/iRAqmFWa6R\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab3zy0": [
        {
            "Parent ID": "t1_eab1cs5",
            "Comment ID": "eab3zy0",
            "Author": "FUCKYOUINYOURFACE",
            "Date Created": "11-23-2018 12:18:47",
            "Upvotes": 1,
            "Text": "I do believe lower BTC prices does lead to more efficient mining. Look at the effect lower oil prices had on oil drilling. It forced organizations to lower their costs or go out of business. It will actually incentivize them to be more green and efficient.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1v9d": [
        {
            "Parent ID": "t1_eab1cs5",
            "Comment ID": "eab1v9d",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-23-2018 11:50:10",
            "Upvotes": -3,
            "Text": "But if we didn't mine for Bitcoin there would be no power wasted on it at all. Bitcoin adds no value to mankind. One could argue it is actually a net negative as all of that energy and computing power could be used to cure cancer or something else positive. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabqp1q": [
        {
            "Parent ID": "t1_eabqkaj",
            "Comment ID": "eabqp1q",
            "Author": "cir2kuk",
            "Date Created": "11-23-2018 17:33:22",
            "Upvotes": 1,
            "Text": "Lol yes don't listen to me Bitcoin is dead! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaas7pw": [
        {
            "Parent ID": "t1_eaaocpm",
            "Comment ID": "eaas7pw",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 09:23:24",
            "Upvotes": 18,
            "Text": "It’s just a pity everyone on that ship has died of drowning. So then you have a floating ship with nobody on it. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ead0j4v": [
        {
            "Parent ID": "t1_eaaocpm",
            "Comment ID": "ead0j4v",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 09:35:30",
            "Upvotes": 3,
            "Text": "> resurfaces at a much higher elevation than before    \n\nThis will not happen.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaakutu": [
        {
            "Parent ID": "t1_eaak01o",
            "Comment ID": "eaakutu",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 06:33:29",
            "Upvotes": 2,
            "Text": "It’s not looking good bois ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6zcd": [
        {
            "Parent ID": "t1_eab50nj",
            "Comment ID": "eab6zcd",
            "Author": "Manasan3010",
            "Date Created": "11-23-2018 12:56:47",
            "Upvotes": 1,
            "Text": "What if I didn't show the account details even after a subpoena. Is is considered illegal?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabeahk": [
        {
            "Parent ID": "t1_eab6ol7",
            "Comment ID": "eabeahk",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 14:31:11",
            "Upvotes": 3,
            "Text": "Wow. That’s bananas. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab83m0": [
        {
            "Parent ID": "t1_eab6ol7",
            "Comment ID": "eab83m0",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:10:47",
            "Upvotes": 4,
            "Text": "Darwinism of the Financial Kind",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaadiqt": [
        {
            "Parent ID": "t1_eaacqw6",
            "Comment ID": "eaadiqt",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 04:10:54",
            "Upvotes": 3,
            "Text": "A single address can represent millions of people and adoption is happening using exchanges where this is exactly the case so you cannot reliability measure adoption by addresses.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaex6b": [
        {
            "Parent ID": "t1_eaacqw6",
            "Comment ID": "eaaex6b",
            "Author": "gretteaj",
            "Date Created": "11-23-2018 04:37:56",
            "Upvotes": 2,
            "Text": "That's a cool website, and I will definitely look at it in the future. I appreciate the link cause it adds some needed insight. Overall I am surprised that the active address rate isn't even lower. Considering BTC is 80% down and the active user rate is only down 50%, I wouldn't consider this bad at all. Not necessarily encouraging for the near future, but far from discouraging. Also, the slow rise over the last 8 months is reminiscent of the 2014 recovery. (Yes I know past performance doesn't predict future performance...even if it is the best indicator for bitcoin). And like I said, even if those new wallets are 99% trash and worthless to bitcoins value and price, some are representative of new hodlers and adopters.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab17yl": [
        {
            "Parent ID": "t1_eaacqw6",
            "Comment ID": "eab17yl",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 11:41:29",
            "Upvotes": 1,
            "Text": "Just because it isn't filled with btc doesn't mean there is no adoption, I know people who you use BTC for drugs and they consistently deposit what they need and then pay for their product, rarely depositing or having 100$+ of BTC in their wallet",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac03e3": [
        {
            "Parent ID": "t1_eabzy8b",
            "Comment ID": "eac03e3",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 20:05:54",
            "Upvotes": 13,
            "Text": "Only \"true believers\" allowed, just like with MLMs and pyramid schemes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0kfl": [
        {
            "Parent ID": "t1_eabzy8b",
            "Comment ID": "eac0kfl",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:13:43",
            "Upvotes": 3,
            "Text": "Thank God you kept that short.  Your last post was the longest and most tedious and boring stream of paragraphed faux-intellectual bullshit since my late Aunt Fuckminster audited her late husband's jockstrap collection and released its full description in 10 volumes of a vanity publication called 'Smells of Bollocks.'",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac6edn": [
        {
            "Parent ID": "t1_eabzy8b",
            "Comment ID": "eac6edn",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 21:53:51",
            "Upvotes": 1,
            "Text": "It’s more that you appear after the fact that gives the game away.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2m2s": [
        {
            "Parent ID": "t1_eabzy8b",
            "Comment ID": "eac2m2s",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 20:48:34",
            "Upvotes": 0,
            "Text": "Of course not. Skeptics are important in any growing tech, because they challenge the curve resulting in better end results. \n\nWhat I'm referring to is mindless insults repeated over and over with no other purpose than to clearly belittle people who support bitcoin and its potential, or put a little money in the market. I agree with you, skeptics are needed and some people post great points, but the handful of users posting repetitive insults that I am referring to are not contributing constructive criticism, I assure you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacj4ot": [
        {
            "Parent ID": "t1_eac20no",
            "Comment ID": "eacj4ot",
            "Author": "-Kite-Man-",
            "Date Created": "11-24-2018 02:18:44",
            "Upvotes": 2,
            "Text": "Hey. To the uninvolved observer, you just look crazy and paranoid.\n\nNow who's alt are you going to accuse me of being?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac3efm": [
        {
            "Parent ID": "t1_eac20no",
            "Comment ID": "eac3efm",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 21:02:13",
            "Upvotes": 2,
            "Text": "Oh I know. There's actually multiple accounts and just a handful of very sad little men sitting their parents basements. I never attempted to understand it but like to pont it out once in a while. What do you think their motive could possibly be?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac35ud": [
        {
            "Parent ID": "t1_eac20no",
            "Comment ID": "eac35ud",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 20:58:12",
            "Upvotes": -1,
            "Text": "Oh sure, ban everybody who doesn't agree with you. Sounds like a plan 🙄",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac9o1s": [
        {
            "Parent ID": "t1_eac7me4",
            "Comment ID": "eac9o1s",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 22:52:40",
            "Upvotes": 0,
            "Text": "Nobody cares about who was right about   prices, nobody ever has. Everyone invested cares what the price is of course, but absolutely nobody cares about who tried to guess it. You're so defensive you didn't even process the point of my comment, because you know you're part of the subject.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac9dgh": [
        {
            "Parent ID": "t1_eabzazj",
            "Comment ID": "eac9dgh",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-23-2018 22:47:20",
            "Upvotes": -4,
            "Text": "Write it down, take a picture, I don't give a fuuuckkk",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaanpfx": [
        {
            "Parent ID": "t1_eaa85y4",
            "Comment ID": "eaanpfx",
            "Author": "JeremyDi",
            "Date Created": "11-23-2018 07:47:59",
            "Upvotes": 1,
            "Text": "Dem real gains. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab0uwl": [
        {
            "Parent ID": "t1_eaatt1m",
            "Comment ID": "eab0uwl",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 11:36:35",
            "Upvotes": 1,
            "Text": "Last year nearly 400,000 Americans died during Black Friday rampages. What a zoo.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaiq1q": [
        {
            "Parent ID": "t1_eaaidqj",
            "Comment ID": "eaaiq1q",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 05:48:29",
            "Upvotes": 1,
            "Text": "Troll harder, you’re not doing it hard enough.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaij2s": [
        {
            "Parent ID": "t1_eaaidqj",
            "Comment ID": "eaaij2s",
            "Author": "James_Brayshaw_",
            "Date Created": "11-23-2018 05:45:07",
            "Upvotes": 0,
            "Text": "It's the same with gold?\n\nI think using the term \"store of effort\" is better understood than \"store of value\".\n\nA gold bar has value because we know that 1kg of gold took $50,000 of \"effort\" to produce.\n\nSimilarly, 1 BTC has value because we know that it took $4000 of \"electricity\" to produce.\n\nIt's just a representation of a finite resource.\n\nIn that respect it's not \"wasteful\" it's just a method to store effort.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaajx7d": [
        {
            "Parent ID": "t1_eaaj406",
            "Comment ID": "eaajx7d",
            "Author": "lizardturtle",
            "Date Created": "11-23-2018 06:13:05",
            "Upvotes": -5,
            "Text": "The lower the price goes, the more you can tell all of the things people say on here is nothing but pure speculation/bs. Bitcoin had its moment — that bubble is popping. Perhaps we'll see a day where it blows up again, but the key word there is \"perhaps.\"\n\nI'm really glad I didn't chuck any money into this thing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaqp29": [
        {
            "Parent ID": "t1_eaapvrx",
            "Comment ID": "eaaqp29",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:54:07",
            "Upvotes": 6,
            "Text": "That’s an understatement bro. Trolls actually made good points in 2014. Yeah they were wrong but they understood the shit they were saying and the cheap shots they were taking. Today it’s just total garbage like they’re in kindergarten or some shit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab67j1": [
        {
            "Parent ID": "t1_eaapvrx",
            "Comment ID": "eab67j1",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 12:47:22",
            "Upvotes": 1,
            "Text": "Certainly seems that way  :) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaahudf": [
        {
            "Parent ID": "t1_eaaeu8v",
            "Comment ID": "eaahudf",
            "Author": "damchi",
            "Date Created": "11-23-2018 05:32:54",
            "Upvotes": 3,
            "Text": "CPU and GPU mining was dead in 2013 already, so the game didn't really change in 2016/2017... Get your facts straight. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaai2iz": [
        {
            "Parent ID": "t1_eaac8cr",
            "Comment ID": "eaai2iz",
            "Author": "damchi",
            "Date Created": "11-23-2018 05:37:09",
            "Upvotes": -1,
            "Text": "Maybe. But exposure to bitcoin isn't the same as participation in bitcoin. Nowadays, almost everyone has heard about bitcoin, but only a teeny, tiny circle of people actually participated. Conclusion: Next cycle with more participants will be off the charts.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadhuc1": [
        {
            "Parent ID": "t1_eabzn9q",
            "Comment ID": "eadhuc1",
            "Author": "BitcoinAlways",
            "Date Created": "11-24-2018 13:06:43",
            "Upvotes": 1,
            "Text": "No doubt my friend.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadakj8": [
        {
            "Parent ID": "t1_ead9axp",
            "Comment ID": "eadakj8",
            "Author": "OliveTBeagle",
            "Date Created": "11-24-2018 11:42:35",
            "Upvotes": 1,
            "Text": "Should have said medium.  Sorry for the typo. \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac03pu": [
        {
            "Parent ID": "t1_eabzre4",
            "Comment ID": "eac03pu",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:06:03",
            "Upvotes": 12,
            "Text": "I mean, feel free to comment on my style, or take pot shots at the excitement level if you like.\n\nFrankly, it would be more interesting to me if you addressed the substantive points with some insight that I don't have.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac47r4": [
        {
            "Parent ID": "t1_eabzre4",
            "Comment ID": "eac47r4",
            "Author": "nishbot",
            "Date Created": "11-23-2018 21:16:16",
            "Upvotes": 4,
            "Text": "Don’t hate, critically analyze.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ead232j": [
        {
            "Parent ID": "t1_eabzre4",
            "Comment ID": "ead232j",
            "Author": "100_Percent_not_homo",
            "Date Created": "11-24-2018 09:58:22",
            "Upvotes": 1,
            "Text": "found the internet money \"investor\"",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabx5ii": [
        {
            "Parent ID": "t1_eabx2za",
            "Comment ID": "eabx5ii",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:16:56",
            "Upvotes": 10,
            "Text": "20 minutes after dark on a holiday weekend?  \n\nYeah, I have that kind of time.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyzfm": [
        {
            "Parent ID": "t1_eabyxh1",
            "Comment ID": "eabyzfm",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:47:26",
            "Upvotes": 6,
            "Text": "You did I guess.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9ntw": [
        {
            "Parent ID": "t1_eab8whe",
            "Comment ID": "eab9ntw",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:30:59",
            "Upvotes": 3,
            "Text": "Well, he rarely posted in those two weeks!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9nah": [
        {
            "Parent ID": "t1_eab8whe",
            "Comment ID": "eab9nah",
            "Author": "bullruntime",
            "Date Created": "11-23-2018 13:30:48",
            "Upvotes": 0,
            "Text": "Who's dick did you have to suck to get your reddit account?  Because last time I checked you can make them all day long for free.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7h84": [
        {
            "Parent ID": "t1_eab72qz",
            "Comment ID": "eab7h84",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:03:02",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": "03-15-2019 12:58:21",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab76y8": [
        {
            "Parent ID": "t1_eab72qz",
            "Comment ID": "eab76y8",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 12:59:26",
            "Upvotes": -1,
            "Text": "It says I'm a Redditor for 3 months despite being a member for 9 months so make if it what you will.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabt4qx": [
        {
            "Parent ID": "t1_eabsm4c",
            "Comment ID": "eabt4qx",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 18:12:07",
            "Upvotes": 1,
            "Text": "If you are mining with your own money and not borrowing, you are not willing to sell bitcoin lower than your break even. that means, the more you invest in same amount of coin, bigger the price, at least for you.  All miners together influence price with their investment in mining",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhd0g": [
        {
            "Parent ID": "t1_eabe9oe",
            "Comment ID": "eabhd0g",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 15:13:30",
            "Upvotes": 8,
            "Text": "You need to learn what a 51% attack is. Ultimately it's hype news. It would also need to be executed by a mining outfit that requires immense resources and investment to build. So becoming that invested in something to destroy it would be irrational on a serious scale.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabewe7": [
        {
            "Parent ID": "t1_eabe9oe",
            "Comment ID": "eabewe7",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 14:39:38",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabm6bp": [
        {
            "Parent ID": "t1_eabe9oe",
            "Comment ID": "eabm6bp",
            "Author": "Toezy_Weezer",
            "Date Created": "11-23-2018 16:23:33",
            "Upvotes": 2,
            "Text": "51% is bullshit. You need to solve blocks 100 times before you can forge a transaction.",
            "Edited?": "11-23-2018 17:33:24",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzqbe": [
        {
            "Parent ID": "t1_eabe9oe",
            "Comment ID": "eabzqbe",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 19:59:59",
            "Upvotes": 2,
            "Text": "user name checks out.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabgk9x": [
        {
            "Parent ID": "t1_eabe9oe",
            "Comment ID": "eabgk9x",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 15:02:21",
            "Upvotes": 1,
            "Text": "Nice name btw.  And no, attack on bitcoin will lower its dominance in long term. Other coins will try to take over but fail. Or if bitcoing fails something else will become main coin. As I understand you cant attack litecoin with bitcoin ASICS is that correct?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabsp4m": [
        {
            "Parent ID": "t1_eabiexu",
            "Comment ID": "eabsp4m",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 18:05:18",
            "Upvotes": -1,
            "Text": "just trying to convince myself to make another investment in right moment",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabih9k": [
        {
            "Parent ID": "t1_eabia8t",
            "Comment ID": "eabih9k",
            "Author": "rootbeerspin",
            "Date Created": "11-23-2018 15:29:13",
            "Upvotes": 2,
            "Text": "I'm holding 50 BTC now and now as of today about 15000 GBTC.\n\nEdit: got few spam messages. This account is only for Bitcoin sub ",
            "Edited?": "11-23-2018 16:52:06",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabd5jb": [
        {
            "Parent ID": "t1_eabcj51",
            "Comment ID": "eabd5jb",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 14:16:02",
            "Upvotes": 1,
            "Text": "Tracy Chapman - Fast car\n\nhttps://www.youtube.com/watch?v=DwrHwZyFN7M",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabev2g": [
        {
            "Parent ID": "t1_eabdqsp",
            "Comment ID": "eabev2g",
            "Author": "BitcoinAlways",
            "Date Created": "11-23-2018 14:39:08",
            "Upvotes": 1,
            "Text": "It's a great song and video  :) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabx1m2": [
        {
            "Parent ID": "t1_eabvmur",
            "Comment ID": "eabx1m2",
            "Author": "aaj094",
            "Date Created": "11-23-2018 19:15:12",
            "Upvotes": 6,
            "Text": "We will talk in 2021 my friend, and decide who is worthy of sympathy. Not that I need much sympathy even today having been in the market since 2016. You, on the other hand seem to believe in your genius by virtue of your username so unless by then you appear with a new handle called LongietheBullTrader, you will be deserving of sympathy.",
            "Edited?": "11-23-2018 19:19:23",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzj5g": [
        {
            "Parent ID": "t1_eabvmur",
            "Comment ID": "eabzj5g",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 19:56:38",
            "Upvotes": 2,
            "Text": "Shorty! You joker ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaam23z": [
        {
            "Parent ID": "t1_eaajqhm",
            "Comment ID": "eaam23z",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 07:05:18",
            "Upvotes": 2,
            "Text": "That is some four dimensional mind fuckery, sir. Glad you picked up on it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaam1fw": [
        {
            "Parent ID": "t1_eaak0zc",
            "Comment ID": "eaam1fw",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 07:04:46",
            "Upvotes": 1,
            "Text": "Which part? the 0 or the 10mil part?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab2ty0": [
        {
            "Parent ID": "t1_eaanu2n",
            "Comment ID": "eab2ty0",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 12:02:57",
            "Upvotes": 3,
            "Text": "> Would have gave\n\nwould have given.  it has been observed that the trolls in this sub stand out for their poor grammar.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaanvkj": [
        {
            "Parent ID": "t1_eaanu2n",
            "Comment ID": "eaanvkj",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 07:51:52",
            "Upvotes": 2,
            "Text": "thats okay. by that time hyperinflation will have destroyed fiat around the world. that will be a great day for some, a horrible day for many more. regardless, cant make an omelette without cracking a few eggs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaai7s9": [
        {
            "Parent ID": "t1_eaae90b",
            "Comment ID": "eaai7s9",
            "Author": "damchi",
            "Date Created": "11-23-2018 05:39:38",
            "Upvotes": 2,
            "Text": "Exactly. \n\n>“Private company using their own crypto currency”\n\nis basically a paradox. \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaao3hq": [
        {
            "Parent ID": "t1_eaae90b",
            "Comment ID": "eaao3hq",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 07:57:02",
            "Upvotes": 0,
            "Text": "Because in the last bubble the ico's and forked shitcoins\n\nsaw the biggest returns, it was nice for btc to to go like 20x\n\nbut some of these others have 1000x'd, coins with ceo's teams and\n\nroadmaps, companies basically and worse versions of bitcoin where if you wanted to get in you were just given a link to download their blockchain.\n\nWell, compared to that bitcoin looks like the holy grail, but the truth is the \n\nmajority of people feel safer knowing someone that's better organized and better equipped is doing\n\nall the work.\n\n&#x200B;\n\nP2p is also already proved to be a failed experiment all p2p networks that were very popular in the early 2000's with hundreds of thoussands of users\n\nare now either dead or populated by a handful of users; google, amazon and facebook have\n\nbrought all major communities under their law and rule. \n\n&#x200B;\n\nThe question is fair because that's how the world works.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzsse": [
        {
            "Parent ID": "t1_eabdg31",
            "Comment ID": "eabzsse",
            "Author": "user_name_checks_out",
            "Date Created": "11-23-2018 20:01:07",
            "Upvotes": 1,
            "Text": "me neither and i would nope out of any site that prompted me to do that.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaabaz0": [
        {
            "Parent ID": "t1_eaaavyx",
            "Comment ID": "eaabaz0",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 03:26:03",
            "Upvotes": -3,
            "Text": "I made a few hundred when it was at 10k about a year ago and then pulled out at 11k. Too bad you bums can't say the same.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab974v": [
        {
            "Parent ID": "t1_eab85iz",
            "Comment ID": "eab974v",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:24:49",
            "Upvotes": 11,
            "Text": "It's the same with pyramid schemes and MLM. The \"true believers\" don't want to hear anything but good news.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabarg2": [
        {
            "Parent ID": "t1_eab8dw9",
            "Comment ID": "eabarg2",
            "Author": "maxtbag",
            "Date Created": "11-23-2018 13:45:01",
            "Upvotes": 2,
            "Text": "This troll was actually pretty funny ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabawks": [
        {
            "Parent ID": "t1_eab8dw9",
            "Comment ID": "eabawks",
            "Author": "rrssh",
            "Date Created": "11-23-2018 13:46:51",
            "Upvotes": -2,
            "Text": "I agree with the part where you yell REEEEE but the rest is garbage and you should rethink your life.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxznn": [
        {
            "Parent ID": "t1_eaavdqm",
            "Comment ID": "eaaxznn",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 10:58:27",
            "Upvotes": 6,
            "Text": "he has bitcoin so no",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaayry5": [
        {
            "Parent ID": "t1_eaay1kz",
            "Comment ID": "eaayry5",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 11:08:52",
            "Upvotes": 0,
            "Text": "Well bro you can’t go back past last year cause you’re clearly fucking a child. Last year was great but years before were shit years and little nut jobs with small dicks like you said the exact same shit then too.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaoznv": [
        {
            "Parent ID": "t1_eaaolee",
            "Comment ID": "eaaoznv",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:17:27",
            "Upvotes": -3,
            "Text": "Bro comon you CAN’T be that stupid. How many of ‘YOUR’ stock shares are 4K a piece? How many different stock option have you invested in that are 4K a share? You say 1000s and expect to fucking make it through natural selection? 1000s???? Get your little ass back in school boy comon.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaap6p4": [
        {
            "Parent ID": "t1_eaaof2v",
            "Comment ID": "eaap6p4",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:21:55",
            "Upvotes": 1,
            "Text": "So 4K a bitcoin is dead bro? When we were all scramblin on The drop from 1k back to a few hundred a few years back was it dead then? Cause the stupid little trolls were on here then spittin out garbage then too but then it ramped up to 20k and now we been shorting it all the way down and still making cash. This ride dead now bro? At 4K? Fucking brains are rare in this sub ya?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaw1w7": [
        {
            "Parent ID": "t1_eaar24s",
            "Comment ID": "eaaw1w7",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 10:29:22",
            "Upvotes": 0,
            "Text": "It's not a currency. It's money. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatvy9": [
        {
            "Parent ID": "t1_eaarxmf",
            "Comment ID": "eaatvy9",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 09:53:23",
            "Upvotes": 1,
            "Text": "Excuse me? This is who you sound like:\n\n **1961:** *\"There is practically no chance communications space satellites will be used to provide better telephone, telegraph, television or radio service inside the United States.\"* — T.A.M. Craven, Federal Communications Commission (FCC) commissioner. \n\nThe biggest mistake people make is to evaluate the potential of any technology based ONLY on its current state. You can't imagine bitcoin in use with taxes and pension funds because you picture it as it is today. You imagine a volatile asset crashing and bubbling injecting chaos into the system. Why don't you consider what it is very likely to become? The developers are not slacking off - there are more of them and you must know they are going to continue improving the bitcoin blockchain.  We are in very early days here. So before you ridicule bitcoin, consider the incredible intellect of those involved with building it. Consider how far it's already come in only 10 years, and then consider where you think it can be in another 10.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaasu78": [
        {
            "Parent ID": "t1_eaarxmf",
            "Comment ID": "eaasu78",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 09:35:16",
            "Upvotes": 0,
            "Text": "It's just a mistake, a confusion. Sort of like people today are happy if Exports are up, not realizing that if you exported the whole country, everyone would die. \n\nPeople forgot Why they wanted to export. The knowledge was lost and forgotten.\n\nSo anyway, people somehow got into US Dollar, and then forgot why, and later they switched to BTC and forgot why.\n\nHowever if you sit down and do the analysis, the whole Bitcoin thing is a mistake and a bunch of nonsense that contains nothing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaqe4b": [
        {
            "Parent ID": "t1_eaapqdf",
            "Comment ID": "eaaqe4b",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:48:07",
            "Upvotes": 1,
            "Text": "Torrents lol. So technologically you’re stuck in 2010. Which explains your desperate attempts to apply financial logic to bitcoin ya? You have this basic understanding of finances an dumb as a stump with tech.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaqssq": [
        {
            "Parent ID": "t1_eaapqdf",
            "Comment ID": "eaaqssq",
            "Author": "crayzcrinkle",
            "Date Created": "11-23-2018 08:56:10",
            "Upvotes": 2,
            "Text": "The cigarettes only have intrinsic value if the prisoner is a smoker. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaudna": [
        {
            "Parent ID": "t1_eaapqdf",
            "Comment ID": "eaaudna",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:01:18",
            "Upvotes": 2,
            "Text": "I was just reading down through the comments and saw this. Was that a typo? Above 4300? It's over that price now and has recovered from far worse devastation over the years. This recent decline is simply a pull back to reality after the hype of last year catapulted the price into levels that could not be sustained with the current technical knowledge level of the average investor. It's getting much easier to buy bitcoin, and the technical level of entry required is lowering. Add to that an entire new generation of tech savvy investors about to come online. The only one who is delusional is he who can't see what is coming through the fog of what currently is right now.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eag5pm8": [
        {
            "Parent ID": "t1_eabnoho",
            "Comment ID": "eag5pm8",
            "Author": "locke75",
            "Date Created": "11-25-2018 13:21:50",
            "Upvotes": 1,
            "Text": "If that is the case it will crash to nothing. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavvkz": [
        {
            "Parent ID": "t1_eaav5kn",
            "Comment ID": "eaavvkz",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 10:26:37",
            "Upvotes": 2,
            "Text": "Do you have nothing better to do? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaawezh": [
        {
            "Parent ID": "t1_eaav5kn",
            "Comment ID": "eaawezh",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:35:17",
            "Upvotes": 1,
            "Text": "You are so ignorant. Ignorant regarding bitcoin, and even more ignorant to post in a bitcoin sub as though you have some special insight that the rest of the posters in here lack. I'm guessing you wouldn't be able to provide a basic explanation of what bitcoin even is. Well I suppose you can Google and copy/paste but most of you people who enjoy bashing bitcoin have very little insight on what you're even taking about. It was bad 4 or 5 years ago when the price dropped and the oh so sad people gathered some sort of self validation by telling us all that bitcoin was a 'fad'. A 'fad' they said! Oh now it's been 10 years and there is no definition of a fad that exceeds weeks or months. So you want to call Bitcoin bullshit hey? Do you feel better? Because I tell you what sir, in another 5 years you can come back and tell us again. You guys are hilarious!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabbjlo": [
        {
            "Parent ID": "t1_eab9v71",
            "Comment ID": "eabbjlo",
            "Author": "mjb5730",
            "Date Created": "11-23-2018 13:54:48",
            "Upvotes": -2,
            "Text": "There is no past or future, price of this, is poised to go up, and it is inevitable, because new people always buy it and keep buying and supply can't connect with demand and thus increase price ...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabfskj": [
        {
            "Parent ID": "t1_eabdvcc",
            "Comment ID": "eabfskj",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 14:52:03",
            "Upvotes": 1,
            "Text": "Tech 2000",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyijp": [
        {
            "Parent ID": "t1_eabdvcc",
            "Comment ID": "eabyijp",
            "Author": "aaj094",
            "Date Created": "11-23-2018 19:39:23",
            "Upvotes": 1,
            "Text": "Bitcoin itself 3 times if by size you mean % dip from ATH.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhd8f": [
        {
            "Parent ID": "t1_eaba6ed",
            "Comment ID": "eabhd8f",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:13:35",
            "Upvotes": 1,
            "Text": "Plus there's strong evidence that every major bull run was accomplished using some pretty severe market manipulation. \n\nAt the very least, wait until the DoJ's probe concludes and see what happens from there.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabb8mj": [
        {
            "Parent ID": "t1_eaba6ed",
            "Comment ID": "eabb8mj",
            "Author": "mjb5730",
            "Date Created": "11-23-2018 13:51:00",
            "Upvotes": 0,
            "Text": "So you say market will never recover and you think price never reach 20k or more? In 2014 people also saying that this time is different, time and price will do its job despite we like it or not",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhgvk": [
        {
            "Parent ID": "t1_eabej26",
            "Comment ID": "eabhgvk",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 15:15:04",
            "Upvotes": 8,
            "Text": "Tiny percentage of a tiny percentage out of a big world. The world is far bigger than the US.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabrnf4": [
        {
            "Parent ID": "t1_eabej26",
            "Comment ID": "eabrnf4",
            "Author": "aaj094",
            "Date Created": "11-23-2018 17:48:32",
            "Upvotes": 3,
            "Text": "I don't know about the US but I just never seem to find people in real life who bought any significant amount of crypto. Either not at all or token amounts at best. Looks far from 'zillions lost billions' that some on this forum claim. I am in a major western country too.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzmas": [
        {
            "Parent ID": "t1_eabej26",
            "Comment ID": "eabzmas",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 19:58:05",
            "Upvotes": 1,
            "Text": "Source for any of this fabrication? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaat1cn": [
        {
            "Parent ID": "t1_eaasy9x",
            "Comment ID": "eaat1cn",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-23-2018 09:38:41",
            "Upvotes": 0,
            "Text": "I go troll the USD subreddit. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaau8tq": [
        {
            "Parent ID": "t1_eaatsd4",
            "Comment ID": "eaau8tq",
            "Author": "LemosineRidin",
            "Date Created": "11-23-2018 09:59:03",
            "Upvotes": 2,
            "Text": "See. You ruined it ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabndpr": [
        {
            "Parent ID": "t1_eablhtb",
            "Comment ID": "eabndpr",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 16:41:51",
            "Upvotes": 0,
            "Text": "So fixed supply is just based on names?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabwcu8": [
        {
            "Parent ID": "t1_eabpslw",
            "Comment ID": "eabwcu8",
            "Author": "fakersdozen",
            "Date Created": "11-23-2018 19:03:50",
            "Upvotes": 1,
            "Text": "This guy works for bakkt",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab74kd": [
        {
            "Parent ID": "t1_eab6svr",
            "Comment ID": "eab74kd",
            "Author": "kopchaidee",
            "Date Created": "11-23-2018 12:58:35",
            "Upvotes": 1,
            "Text": "enjoy",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab81qx": [
        {
            "Parent ID": "t1_eab7opi",
            "Comment ID": "eab81qx",
            "Author": "kopchaidee",
            "Date Created": "11-23-2018 13:10:09",
            "Upvotes": 1,
            "Text": "sure, sure. I also lost some that I got from the faucet when it was giving away 5 BTC at the time. Later it was only 1 I think. Ofc you wouldn't know what that was. It was a good scam, probably the biggest the world has ever seen",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7jw2": [
        {
            "Parent ID": "t1_eab7f6l",
            "Comment ID": "eab7jw2",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:03:58",
            "Upvotes": 2,
            "Text": "Did you sell or are you hodling?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab87ew": [
        {
            "Parent ID": "t1_eab83bw",
            "Comment ID": "eab87ew",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 13:12:07",
            "Upvotes": 0,
            "Text": "Laughing through tears as you read a bank statement?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab612y": [
        {
            "Parent ID": "t1_eab5ouy",
            "Comment ID": "eab612y",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:45:19",
            "Upvotes": -1,
            "Text": "[deleted]",
            "Edited?": "12-22-2018 17:13:32",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaal1j5": [
        {
            "Parent ID": "t1_eaabcz7",
            "Comment ID": "eaal1j5",
            "Author": "SAT0SHl",
            "Date Created": "11-23-2018 06:37:41",
            "Upvotes": 2,
            "Text": "That's just your upper lip. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachkiv": [
        {
            "Parent ID": "t1_eachdyq",
            "Comment ID": "eachkiv",
            "Author": "Sage1970",
            "Date Created": "11-24-2018 01:38:31",
            "Upvotes": -2,
            "Text": "Oh that \"Lol\" and IQ\" really burned! Man you're clever!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "each2na": [
        {
            "Parent ID": "t1_eacgww3",
            "Comment ID": "each2na",
            "Author": "Sage1970",
            "Date Created": "11-24-2018 01:25:57",
            "Upvotes": 1,
            "Text": "Thank you. And you make none, just like how much you've made of crypto.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzp9r": [
        {
            "Parent ID": "t1_eabzfnu",
            "Comment ID": "eabzp9r",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 19:59:30",
            "Upvotes": -1,
            "Text": "Grouchy today, eh.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "each9gv": [
        {
            "Parent ID": "t1_eacgyg4",
            "Comment ID": "each9gv",
            "Author": "ekhasm88",
            "Date Created": "11-24-2018 01:30:50",
            "Upvotes": 0,
            "Text": "Tons of bagholders about to lose the little money they have. The rich will get richer, the plebs will pleb.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0zu9": [
        {
            "Parent ID": "t1_eab3zy0",
            "Comment ID": "eac0zu9",
            "Author": "aidanlister",
            "Date Created": "11-23-2018 20:20:51",
            "Upvotes": 1,
            "Text": "So ... you don’t actually understand mining?\n\nThe profits from mining = BitcoinReward - ElectricityCosts - LoanOnEquipment\n\nThere is not added incentive to be more efficient, that has been the only incentive the whole time. There is no way to make Bitcoin greener, if they made rigs twice as efficient miners would buy 2x rigs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab2v3m": [
        {
            "Parent ID": "t1_eab1v9d",
            "Comment ID": "eab2v3m",
            "Author": "ForeverDutch92",
            "Date Created": "11-23-2018 12:03:23",
            "Upvotes": 3,
            "Text": "Pls, troll harder.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab21eh": [
        {
            "Parent ID": "t1_eab1v9d",
            "Comment ID": "eab21eh",
            "Author": "jagbot",
            "Date Created": "11-23-2018 11:52:30",
            "Upvotes": 2,
            "Text": "there's billions of $ of transactions already done with btc. it sure adds value to personkind.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab4103": [
        {
            "Parent ID": "t1_eab1v9d",
            "Comment ID": "eab4103",
            "Author": "xaxiomatic",
            "Date Created": "11-23-2018 12:19:13",
            "Upvotes": 2,
            "Text": "Being able to transact 200 bil. annually without a need for a central authority is value.  Depends on your perspective if the energy expenditure is worth it or not. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaazjef": [
        {
            "Parent ID": "t1_eaas7pw",
            "Comment ID": "eaazjef",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 11:18:52",
            "Upvotes": -1,
            "Text": "The smart ones have found the waterproof emergency capsule inside the ship labeled “long term thinking” and always survive each time. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadcdtq": [
        {
            "Parent ID": "t1_ead0j4v",
            "Comment ID": "eadcdtq",
            "Author": "The-Physicist",
            "Date Created": "11-24-2018 12:04:16",
            "Upvotes": 0,
            "Text": "Sure it won’t 🙄🙄🙄",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7wdk": [
        {
            "Parent ID": "t1_eab6zcd",
            "Comment ID": "eab7wdk",
            "Author": "RIMS_REAL_BIG",
            "Date Created": "11-23-2018 13:08:20",
            "Upvotes": 5,
            "Text": "I'm no lawyer, but if the court subpoenas something and you don't provide it I'm gonna guess that's illegal. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab9luy": [
        {
            "Parent ID": "t1_eab6zcd",
            "Comment ID": "eab9luy",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 13:30:16",
            "Upvotes": 2,
            "Text": "Well, it would be contempt of court. They would throw you in jail until you complied, which could be for years quite literally. If you still didn't comply, then they could hit you with criminal contempt and then it would be for more years in jail, whether you complied or not.\n\n\n\nOne generally can't take the Fifth as to providing documents, just ask anybody hit with an SEC subpoena.\n\n\n\nSounds like you need to talk with a lawyer sooner rather than later.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7u4u": [
        {
            "Parent ID": "t1_eab6zcd",
            "Comment ID": "eab7u4u",
            "Author": "elitistasshole",
            "Date Created": "11-23-2018 13:07:32",
            "Upvotes": 1,
            "Text": "You should consult a lawyer. You could take the fifth. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacztgh": [
        {
            "Parent ID": "t1_eab6zcd",
            "Comment ID": "eacztgh",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 09:25:02",
            "Upvotes": 1,
            "Text": "are you fuckin stupid, though i guess it's par of the course for the magiccoins",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaebfp": [
        {
            "Parent ID": "t1_eaadiqt",
            "Comment ID": "eaaebfp",
            "Author": "Diabolicus666",
            "Date Created": "11-23-2018 04:27:00",
            "Upvotes": 10,
            "Text": "A single person can control thousands of addresses and adoption *happening* only on exchanges is no true adoption at all, it is speculation, induced by greed and get-rich-quick-mentality.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaeqnb": [
        {
            "Parent ID": "t1_eaadiqt",
            "Comment ID": "eaaeqnb",
            "Author": "Spykwak",
            "Date Created": "11-23-2018 04:34:34",
            "Upvotes": 3,
            "Text": "Yeah that’s like estimating the world wealth by how much people have in their wallet (the one holding your fiat) and not how much is their balance at the bank.\n\nFor some people there is more security to hold their funds on coinbase than in using an unencrypted wallet on a compromised PC.\n\nOr maybe I’m wrong and everyone is a techno elite and expert in data security. (And no a hardware wallet isn’t enough to secure your funds (e.g robbery, house fire, negligence of a family member, death and inheritage, ...)",
            "Edited?": "11-23-2018 04:39:18",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaazgnh": [
        {
            "Parent ID": "t1_eaaex6b",
            "Comment ID": "eaazgnh",
            "Author": "deader2000",
            "Date Created": "11-23-2018 11:17:54",
            "Upvotes": 2,
            "Text": "Counting active addresses is stupid. Between me and my friends there are about 20 addresses with balance that became inactive when the market crashed almost 1 year ago",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac25pq": [
        {
            "Parent ID": "t1_eac03e3",
            "Comment ID": "eac25pq",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 20:40:43",
            "Upvotes": 0,
            "Text": "Ha ha you post like 100 times a day to say bitcoin is bad. That's disfunctional no matter how you look at it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0s4n": [
        {
            "Parent ID": "t1_eac03e3",
            "Comment ID": "eac0s4n",
            "Author": "aaj094",
            "Date Created": "11-23-2018 20:17:19",
            "Upvotes": 0,
            "Text": "Pyramid schemes rely on investors being ignorant of the truth that their returns are being generated by the proceeds from a second line of investors who do not know that their returns come from a third line of investors. Ultimately there is no real benefit to anyone in the scheme other than the above way so the chain breaks at some point. \n\nWith Bitcoin, the asset in question has an immediate benefit of giving you a defined proportion of a fixed supply that cannot be manipulated, a secure way of making trustless payments and an asset that cannot be confiscated. Knowing all these benefits, you also gain by virtue of adoption of this fixed supply by increasing number of people and thus causing appreciation of your holding. \n\nSo unlike a pyramid scheme, there is an immediate gain of holding Bitcoin and also a justified reason to expect appreciation. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0pzr": [
        {
            "Parent ID": "t1_eac03e3",
            "Comment ID": "eac0pzr",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:16:17",
            "Upvotes": -1,
            "Text": "You only know about 6 buzzwords - don't you.  :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0tdz": [
        {
            "Parent ID": "t1_eac0kfl",
            "Comment ID": "eac0tdz",
            "Author": "LobsterThief",
            "Date Created": "11-23-2018 20:17:54",
            "Upvotes": 5,
            "Text": "What’s happening",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac3yk1": [
        {
            "Parent ID": "t1_eac0kfl",
            "Comment ID": "eac3yk1",
            "Author": "nishbot",
            "Date Created": "11-23-2018 21:11:53",
            "Upvotes": -1,
            "Text": "Speaking of mindless insults",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac726c": [
        {
            "Parent ID": "t1_eac6edn",
            "Comment ID": "eac726c",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 22:05:33",
            "Upvotes": 2,
            "Text": "After the fact?  \n\nAll my criticisms of bitcoin are remain relevant and applicable going forward.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacu6w5": [
        {
            "Parent ID": "t1_eacj4ot",
            "Comment ID": "eacu6w5",
            "Author": "BCash_BeTrash",
            "Date Created": "11-24-2018 07:44:08",
            "Upvotes": 1,
            "Text": "TittieCoin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac69i1": [
        {
            "Parent ID": "t1_eac35ud",
            "Comment ID": "eac69i1",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 21:51:29",
            "Upvotes": 3,
            "Text": "No bans. We need the retroactive bears in order to gauge peak fud. Btw, How many accounts do you run, shorty? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadmhu0": [
        {
            "Parent ID": "t1_eab0uwl",
            "Comment ID": "eadmhu0",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 13:58:10",
            "Upvotes": 1,
            "Text": "America would be a better place if that was a true story",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaamnon": [
        {
            "Parent ID": "t1_eaaiq1q",
            "Comment ID": "eaamnon",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 07:21:33",
            "Upvotes": -3,
            "Text": "I've been bashing bitcoin since 2017\n\nThen it quasi-mooned to 10,000+ and this guy told me \"Time to sui\"\n\nBut as an experienced economist and Wall Street maven, I knew it was headed back down to prices like $4250 and $0\n\nPossibly lower",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaajil3": [
        {
            "Parent ID": "t1_eaaij2s",
            "Comment ID": "eaajil3",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 06:04:18",
            "Upvotes": 3,
            "Text": "This goes back to the question in economics: If you sink a bunch of money into some project, does that prove that the project is worthwhile.\n\nIn a way, your own case as bitcoin buyers proves that Marxist claim wrong. Namely you sunk $14,000 into BTC and now is it fetching that much",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaairj5": [
        {
            "Parent ID": "t1_eaaij2s",
            "Comment ID": "eaairj5",
            "Author": "aidanlister",
            "Date Created": "11-23-2018 05:49:12",
            "Upvotes": -4,
            "Text": "Can our planet afford either of these then? It is like Easter Island, we are such a dumb species :(",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaali8x": [
        {
            "Parent ID": "t1_eaajx7d",
            "Comment ID": "eaali8x",
            "Author": "xaxiomatic",
            "Date Created": "11-23-2018 06:49:37",
            "Upvotes": 2,
            "Text": "Not necessarily. This would actually make some semblance of sense. Electricity costs and running expenses could have been one of the reasons for the dump. \n\n&#x200B;\n\nIt could have been the trigger then the rest followed. Some parties are all in on BCH they can't afford for it to fail. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaau6ki": [
        {
            "Parent ID": "t1_eaaqp29",
            "Comment ID": "eaau6ki",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 09:58:08",
            "Upvotes": -1,
            "Text": "Says a poster whose vernacular includes \"bro\".",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaoexw": [
        {
            "Parent ID": "t1_eaahudf",
            "Comment ID": "eaaoexw",
            "Author": "machn",
            "Date Created": "11-23-2018 08:04:14",
            "Upvotes": 2,
            "Text": "What! You're objectively wrong. GPU prices were on fire uptil just a few months back due to demand from mining. \n\nThere's also a correlation between mining difficulty and cryptocurrency pricing; it's unprofitable now cause the BTC price ain't reaching sustainable levels. There's no particular date in 2013 where it stopped becoming profitable. That's not how it works.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac1c23": [
        {
            "Parent ID": "t1_eac03pu",
            "Comment ID": "eac1c23",
            "Author": "LobsterThief",
            "Date Created": "11-23-2018 20:26:32",
            "Upvotes": 4,
            "Text": "I thought what you wrote was interesting and thoughtful; thanks for taking the time to write it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac15qx": [
        {
            "Parent ID": "t1_eac03pu",
            "Comment ID": "eac15qx",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:23:34",
            "Upvotes": 1,
            "Text": "I think that, at heart, you are probably better suited to the Bcash community.  \n\nGo and post lengthily over there.\n\nTheir coin is doing very nicely as well!\n\n.\n\n^(Shhh)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac4vdy": [
        {
            "Parent ID": "t1_eac47r4",
            "Comment ID": "eac4vdy",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 21:27:34",
            "Upvotes": -2,
            "Text": "Don't be so pompous.  What was written was rubbish, by any critical standard.\n\nAlmost all of the theses are either obvious, or debatable.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabxqta": [
        {
            "Parent ID": "t1_eabx5ii",
            "Comment ID": "eabxqta",
            "Author": "Dontrun_glide",
            "Date Created": "11-23-2018 19:26:46",
            "Upvotes": -6,
            "Text": "Does anyone ever stop lying?\n\nThat was about 800 words of trolling.\n\nYou're claiming to have composed that entire pile of boring and obvious shite at under one second per word.\n\nIt was well constructed, but your punctuation is poor.\n\nWhat's your motive for writing all of that, and then claiming you knocked it off in a spare few minutes?\n\nJust stop lying please.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabz3g7": [
        {
            "Parent ID": "t1_eabyzfm",
            "Comment ID": "eabz3g7",
            "Author": "WW91ciBtb20gaXMgZ2F5",
            "Date Created": "11-23-2018 19:49:20",
            "Upvotes": -3,
            "Text": "definitely did not read that gigantic wall of text. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabajl6": [
        {
            "Parent ID": "t1_eab7h84",
            "Comment ID": "eabajl6",
            "Author": "ihatemaps",
            "Date Created": "11-23-2018 13:42:13",
            "Upvotes": 2,
            "Text": "Sure you do. Every new redditor with a two week old account says the same thing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7jg7": [
        {
            "Parent ID": "t1_eab76y8",
            "Comment ID": "eab7jg7",
            "Author": "ihatemaps",
            "Date Created": "11-23-2018 13:03:49",
            "Upvotes": 4,
            "Text": "I don't need to make anything of it, because his profile says his account was created October 24, 2018.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabfdkj": [
        {
            "Parent ID": "t1_eabewe7",
            "Comment ID": "eabfdkj",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 14:46:23",
            "Upvotes": 3,
            "Text": "Judo Chop!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabtck3": [
        {
            "Parent ID": "t1_eabsp4m",
            "Comment ID": "eabtck3",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 18:15:37",
            "Upvotes": 3,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:17:06",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabnpus": [
        {
            "Parent ID": "t1_eabih9k",
            "Comment ID": "eabnpus",
            "Author": "sirbozlington",
            "Date Created": "11-23-2018 16:47:00",
            "Upvotes": 2,
            "Text": "So you’ve lost like $100k in the last month?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eablyqz": [
        {
            "Parent ID": "t1_eabih9k",
            "Comment ID": "eablyqz",
            "Author": "ChapDog",
            "Date Created": "11-23-2018 16:20:16",
            "Upvotes": 1,
            "Text": "Damn you're a big baller, nice.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabraok": [
        {
            "Parent ID": "t1_eabih9k",
            "Comment ID": "eabraok",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 17:43:01",
            "Upvotes": 0,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:17:11",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabecl7": [
        {
            "Parent ID": "t1_eabd5jb",
            "Comment ID": "eabecl7",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 14:31:59",
            "Upvotes": 1,
            "Text": "Hard knock life\n\n[https://www.youtube.com/watch?v=YBBpMpJAwjQ](https://www.youtube.com/watch?v=YBBpMpJAwjQ)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac00fl": [
        {
            "Parent ID": "t1_eabx1m2",
            "Comment ID": "eac00fl",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 20:04:37",
            "Upvotes": 3,
            "Text": "Did you not sell at 19000 and ride it all the way down to 4500? Genius!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaao264": [
        {
            "Parent ID": "t1_eaam1fw",
            "Comment ID": "eaao264",
            "Author": "trade_noob29",
            "Date Created": "11-23-2018 07:56:11",
            "Upvotes": 1,
            "Text": "Which one do you think? :D",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaartqj": [
        {
            "Parent ID": "t1_eaanvkj",
            "Comment ID": "eaartqj",
            "Author": "bangohat5",
            "Date Created": "11-23-2018 09:16:14",
            "Upvotes": 2,
            "Text": "If fiat dies so does bitcoin. We cash out our bitcoin for fiat so if fiat is worthless then so is bitcoin. You don't want the dollar to collapse. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaag4rj": [
        {
            "Parent ID": "t1_eaabaz0",
            "Comment ID": "eaag4rj",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 05:01:08",
            "Upvotes": 5,
            "Text": "Your hate message says otherwise. My guess is you bought in at 15k+ and are just showing your frustration. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaig8v": [
        {
            "Parent ID": "t1_eaabaz0",
            "Comment ID": "eaaig8v",
            "Author": "krom1985",
            "Date Created": "11-23-2018 05:43:43",
            "Upvotes": 2,
            "Text": ":-D a few hundred, lol\n\n#baller",
            "Edited?": "11-23-2018 06:07:46",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaad8bo": [
        {
            "Parent ID": "t1_eaabaz0",
            "Comment ID": "eaad8bo",
            "Author": "Kaslion",
            "Date Created": "11-23-2018 04:05:17",
            "Upvotes": 1,
            "Text": "Grats on your gains.\n\nBrave of you to gamble when it was in such bubble territory.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaayx45": [
        {
            "Parent ID": "t1_eaayry5",
            "Comment ID": "eaayx45",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 11:10:47",
            "Upvotes": 3,
            "Text": "Why is everyone fascinated with dicks in this thread",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab0i72": [
        {
            "Parent ID": "t1_eaayry5",
            "Comment ID": "eab0i72",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 11:31:44",
            "Upvotes": 3,
            "Text": "I'm curious, at what age did your penis fixation begin to manifest? Do you think it's linked with your lack of a father figure growing up?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaap5pb": [
        {
            "Parent ID": "t1_eaaoznv",
            "Comment ID": "eaap5pb",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 08:21:18",
            "Upvotes": 13,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxxt7": [
        {
            "Parent ID": "t1_eaaw1w7",
            "Comment ID": "eaaxxt7",
            "Author": "ivanoski-007",
            "Date Created": "11-23-2018 10:57:45",
            "Upvotes": 1,
            "Text": "You´d be better off buying gold then",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaauqkt": [
        {
            "Parent ID": "t1_eaatvy9",
            "Comment ID": "eaauqkt",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:07:30",
            "Upvotes": 4,
            "Text": "You can't really claim that just because some Past technology succeeded, then whatever you propose today is also valid.\n\n\"They laughed at Edison, they laughed at Tesla, but they also laughed at Bozo the Clown.\"",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab7720": [
        {
            "Parent ID": "t1_eaatvy9",
            "Comment ID": "eab7720",
            "Author": "lhy2209",
            "Date Created": "11-23-2018 12:59:28",
            "Upvotes": 1,
            "Text": "There's also plenty of tech that has failed. Cherry picking from the past is about as convincing as saying \"I believe the tech will work, trust me\".",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaau9xl": [
        {
            "Parent ID": "t1_eaatvy9",
            "Comment ID": "eaau9xl",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 09:59:30",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaar2sc": [
        {
            "Parent ID": "t1_eaaqe4b",
            "Comment ID": "eaar2sc",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 09:01:42",
            "Upvotes": 2,
            "Text": "A torrent is a way to Verify that something is the same.\n\nSo it's exactly like bitcoin.\n\nNow the trouble for bitcoiners is that those Torrents that contain no media are in fact worthless.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaawq5b": [
        {
            "Parent ID": "t1_eaawezh",
            "Comment ID": "eaawq5b",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:40:10",
            "Upvotes": 1,
            "Text": "Bitcoin is a fake torrent. It means that it used technology to verify that the file is copied well, but then you opened it up to find nothing of interest.\n\nHowever we live in times of Post-Truth, so it is often heard that \"earth is flat with an ice wall,\" \"putin is a jolly good fellow who would never use chem weapons,\" \"bitcoin is valuable,\" and other fake news.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxh7m": [
        {
            "Parent ID": "t1_eaawezh",
            "Comment ID": "eaaxh7m",
            "Author": "ExodiaTheBrazilian",
            "Date Created": "11-23-2018 10:51:21",
            "Upvotes": -5,
            "Text": ">  I'm guessing you wouldn't be able to provide a basic explanation of what bitcoin even is.\n\nBullshit. Bitcoin is bullshit. I would also define it as a scam. Beanie babies for IT type guys is also a good description",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabfasf": [
        {
            "Parent ID": "t1_eabbjlo",
            "Comment ID": "eabfasf",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 14:45:16",
            "Upvotes": 2,
            "Text": "Why is it inevitable exactly?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabg7il": [
        {
            "Parent ID": "t1_eabbjlo",
            "Comment ID": "eabg7il",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 14:57:35",
            "Upvotes": 2,
            "Text": "What demand?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhwnu": [
        {
            "Parent ID": "t1_eabfskj",
            "Comment ID": "eabhwnu",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 15:21:15",
            "Upvotes": 4,
            "Text": "Really? Of the companies that still exist from that time, the one's that lead the charge, like Cisco and Yahoo!, have never recovered. Microsoft didn't boom as much but it still took them 17 years to get back to their ATH. Apple doesn't count because it didn't boom at all and Alphabet (Google) didn't exist. Amazon got caught up in the hype at the time but the chances of you picking that stock and holding it from 2000 are pretty slim.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabcfm1": [
        {
            "Parent ID": "t1_eabb8mj",
            "Comment ID": "eabcfm1",
            "Author": "maxtbag",
            "Date Created": "11-23-2018 14:06:27",
            "Upvotes": 0,
            "Text": "Just think about it for one second before you get all salty and downvote. Btc had one shot to engage the global public, society has a short attention span. It failed, the people who came in got burned and everyone else laughed. To return to new ath's there would need to be massive wave of new buyers, much bigger than anything you saw in any of the rallys in btc's history. That's not going to happen, therefore, we will never see 20k again. You probably know this already, you seem like a shill trying to trick people into hodling. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabuwdp": [
        {
            "Parent ID": "t1_eabrnf4",
            "Comment ID": "eabuwdp",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 18:40:39",
            "Upvotes": 2,
            "Text": "4 percent = 1 in 25 people. Of course you won't find people who invested that easily. Doesn't mean 4 percent isn't high. But let's put the percentage aside. Look at how much exposure there was in december. Extreme exposure all over the net and in msm. That's what you need to get back at ath. It's huge. Extremely difficult to get that amount of exposure. \n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaccqft": [
        {
            "Parent ID": "t1_eabzmas",
            "Comment ID": "eaccqft",
            "Author": "Neveragain646",
            "Date Created": "11-23-2018 23:48:57",
            "Upvotes": 2,
            "Text": "Source? Haven't you seen how much hype it caused in december? It was all over the news, all over the net, all over Facebook. People believed in something special. To attract that amount of investors, bitcoin needs to be useful. For example, if fiat money depreciates in value, there might be a reason for people to invest in it. But now that the hype is over, and people start seeing Bitcoin's true value at the moment, there's absolutely no reason to invest, that's why it's declining all the time. You need major economic shock for people to move their money into crypto. It might happen some day in the future, but it could take a very very long time. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatcwr": [
        {
            "Parent ID": "t1_eaat1cn",
            "Comment ID": "eaatcwr",
            "Author": "LemosineRidin",
            "Date Created": "11-23-2018 09:44:00",
            "Upvotes": 3,
            "Text": "Nice. I like your tenacity ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac4e71": [
        {
            "Parent ID": "t1_eabndpr",
            "Comment ID": "eac4e71",
            "Author": "nishbot",
            "Date Created": "11-23-2018 21:19:20",
            "Upvotes": 2,
            "Text": "Exactly",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabq49z": [
        {
            "Parent ID": "t1_eabndpr",
            "Comment ID": "eabq49z",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 17:24:21",
            "Upvotes": 1,
            "Text": "That's not what it's based on but do you see this as an issue? Your computing device is identified by it's name/IP and so is your home on your street by its address. It's more about math that ensures a working system. Bitcoin is a decentralized accounting system, and the limited supply is a part of of the finely tuned configuration that allows it to function by retaining value as a deflationary currency.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabp4xp": [
        {
            "Parent ID": "t1_eabndpr",
            "Comment ID": "eabp4xp",
            "Author": "aaj094",
            "Date Created": "11-23-2018 17:08:46",
            "Upvotes": 1,
            "Text": "Fixed supply on the one blockchain that is objectively the most secure blockchain and has the best ecosystem of developers and has the most network advantage. This blockchain has a certain genesis block and consensus rules which distinguish it from others.  Yes it does have a name but why should it not? You are called by a certain name too. Someone else could have a similar sounding name as you but you are still you and retain a unique personality, right?\n\nSimilarly another blockchain can objectively be distinguished from the one that has until now been called Bitcoin. There is no confusion or lack of distinction between coins of different blockchains. And there cannot be more than one 'most secure cryptoasset'.",
            "Edited?": "11-23-2018 17:13:17",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzujg": [
        {
            "Parent ID": "t1_eabwcu8",
            "Comment ID": "eabzujg",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 20:01:56",
            "Upvotes": 1,
            "Text": " BAKKT is coming online no later than December 31 . . . 2023. I really promise this time. Trust me. Lightning network right behind it!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab937n": [
        {
            "Parent ID": "t1_eab81qx",
            "Comment ID": "eab937n",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:23:25",
            "Upvotes": 3,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab8o85": [
        {
            "Parent ID": "t1_eab7jw2",
            "Comment ID": "eab8o85",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 13:18:01",
            "Upvotes": 3,
            "Text": "Both.  I sold a large chunk in January and quit my shitty job.  Looking to buy it back if it goes low enough.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabbv4i": [
        {
            "Parent ID": "t1_eab87ew",
            "Comment ID": "eabbv4i",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 13:58:47",
            "Upvotes": 4,
            "Text": "My bank statement looks just fine, same as my crypto bags, and my real estate hlodings.\n\nEvery time the market drops ya'll thinking it is finally the end. \"This time is different\", you say. It's only because you are scared of uncertainty. In reality this is the perfect time to buy more. If it drops more, buy even more. Do you remember that video games lasted 10 years before they crashed in 1984 never to come back? What about Ebay, Google, Amazon after the dot com bubble? Of course we were going to have a bubble to purge a lot of the bullshit that's out there. That is just the way of nature. However digital decentralized currency is here to stay. It's a gamble to know which ones will triumph in the end, but that is the game we signed up for.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab8aqm": [
        {
            "Parent ID": "t1_eab612y",
            "Comment ID": "eab8aqm",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 13:13:15",
            "Upvotes": 2,
            "Text": "I'll find Lambo under bridge?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachyzx": [
        {
            "Parent ID": "t1_eachkiv",
            "Comment ID": "eachyzx",
            "Author": "maxtbag",
            "Date Created": "11-24-2018 01:48:59",
            "Upvotes": 2,
            "Text": "By your response it sounds like it kinda did burn you...  :D ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzrx1": [
        {
            "Parent ID": "t1_eabzp9r",
            "Comment ID": "eabzrx1",
            "Author": "vidaru-x",
            "Date Created": "11-23-2018 20:00:43",
            "Upvotes": 3,
            "Text": "It’s always a good day seeing your logic shine through. I worry when you disappear. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachsc8": [
        {
            "Parent ID": "t1_each9gv",
            "Comment ID": "eachsc8",
            "Author": "damchi",
            "Date Created": "11-24-2018 01:44:09",
            "Upvotes": 1,
            "Text": "Bigger market, with more participants, more liquidity = stabler price. We're currently in the process of price discovery and ups and downs are to be expected. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab2zut": [
        {
            "Parent ID": "t1_eab2v3m",
            "Comment ID": "eab2zut",
            "Author": "LemosineRidin",
            "Date Created": "11-23-2018 12:05:10",
            "Upvotes": 3,
            "Text": "Trolls take no days off. One could say they produce a net negative their entire lives. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab4sdn": [
        {
            "Parent ID": "t1_eab4103",
            "Comment ID": "eab4sdn",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 12:29:28",
            "Upvotes": 1,
            "Text": "You're talking to arguably the biggest bitcoin fan, lambo moon boy in here. He says he thinks bitcoin has no value but hangs out in a bitcon reddit sub all day every day. I've heard of identity confusion but that's extreme.\nBut to your point yes of course that is value. That one aspect alone brings enormous value.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac1ag4": [
        {
            "Parent ID": "t1_eab4103",
            "Comment ID": "eac1ag4",
            "Author": "aidanlister",
            "Date Created": "11-23-2018 20:25:47",
            "Upvotes": 1,
            "Text": "But $200B worth of bots trading with bots, is that valuable to society?\n\nOnly a tiny sliver of this Bitcoin volume are exchanges of BTC for goods and services, and for this we use the energy of a small country.\n\nWhen you really think about it, it is disgusting.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab041j": [
        {
            "Parent ID": "t1_eaazjef",
            "Comment ID": "eab041j",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 11:26:11",
            "Upvotes": 6,
            "Text": "Does this capsule have finite oxygen? Cos I’m choking big time. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaek6v": [
        {
            "Parent ID": "t1_eaaebfp",
            "Comment ID": "eaaek6v",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 04:31:22",
            "Upvotes": 1,
            "Text": "Adoption is adoption and you haven’t presented a reliable way to measure it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0zeb": [
        {
            "Parent ID": "t1_eac0s4n",
            "Comment ID": "eac0zeb",
            "Author": "AbsolutPower81",
            "Date Created": "11-23-2018 20:20:38",
            "Upvotes": 8,
            "Text": "The only way you can make money buying Bitcoin is if someone pays you more for it later.  It won't pay you dividends.  You aren't  entitled to a share of the profits  of a productive enterprise.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac1nbc": [
        {
            "Parent ID": "t1_eac0pzr",
            "Comment ID": "eac1nbc",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:31:55",
            "Upvotes": 2,
            "Text": "**Please note my fellow Bitcoiners:**\n\nOliveTBeagle replied to my post above to ShortyTheBearTrader, with: \n\n'7 if I need them.'\n\nAs I responded to this, pointing out that he had blown his sockpuppet cover - breaking all Reddit rules - the message was deleted.\n\nOliveTBeagle and ShortyTheBearTrader are the same person, here to spread some message.\n\nReported to mods.\n\nYou can easily spot them, both masquerade as wankers.",
            "Edited?": "11-23-2018 21:20:20",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacuaiz": [
        {
            "Parent ID": "t1_eacu6w5",
            "Comment ID": "eacuaiz",
            "Author": "-Kite-Man-",
            "Date Created": "11-24-2018 07:46:33",
            "Upvotes": 1,
            "Text": "You know, I don't actually know enough about cryptocurrency to tell if you're referring to a user or a bitcoin competitor. \n\nIs that like dogecoin? Using a /u/ might've helped.\n\nEither way...no?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaccawg": [
        {
            "Parent ID": "t1_eac69i1",
            "Comment ID": "eaccawg",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 23:40:29",
            "Upvotes": -1,
            "Text": "Only my own. Paranoid much?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaajeqg": [
        {
            "Parent ID": "t1_eaairj5",
            "Comment ID": "eaajeqg",
            "Author": "Yumlick",
            "Date Created": "11-23-2018 06:02:06",
            "Upvotes": 3,
            "Text": "The problem is dirty energy not bitcoin.  If anything bitcoin is helping to raise awareness and is making some more financially invested in changing from dirty energy to clean energy.  Coal is still the majority of energy generated.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0o7b": [
        {
            "Parent ID": "t1_eaali8x",
            "Comment ID": "eac0o7b",
            "Author": "LobsterThief",
            "Date Created": "11-23-2018 20:15:28",
            "Upvotes": 1,
            "Text": "Except that they could trade it for another crypto or fiat currency at a moment’s notice, so they can afford for it to fail",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavfki": [
        {
            "Parent ID": "t1_eaau6ki",
            "Comment ID": "eaavfki",
            "Author": "thelazarusledd",
            "Date Created": "11-23-2018 10:19:38",
            "Upvotes": 0,
            "Text": "Haha I was thinking the same, there is nothing smart thats coming after word bro. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaay5h2": [
        {
            "Parent ID": "t1_eaau6ki",
            "Comment ID": "eaay5h2",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 11:00:39",
            "Upvotes": -1,
            "Text": "You still here bro? Still losing all your money being a little bitcoin fanboy as always hey? I never saw a closet bitcoin fanboy who had it bad as you before. Nobody as bad as you.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaapq3n": [
        {
            "Parent ID": "t1_eaaoexw",
            "Comment ID": "eaapq3n",
            "Author": "damchi",
            "Date Created": "11-23-2018 08:33:57",
            "Upvotes": 2,
            "Text": "I know what I mined with my 3x280x and 4x270x rigs in 2013-2014 and it wasn't bitcoin (directly). **Bitcoin** GPU mining wasn't profitable anymore back then so you'd mine litecoin or some XY altcoin and convert those to bitcoin (either manually or automatically via one of the many multipools) as you'd get many more bitcoin than if you'd mined bitcoin directly.  GPUs have been completely useless for bitcoin mining for more than 4 years now. \n\n&#x200B;\n\nDon't believe me? [https://www.tomshardware.com/reviews/bitcoin-mining-make-money,3514-10.html](https://www.tomshardware.com/reviews/bitcoin-mining-make-money,3514-10.html)\n\n&#x200B;\n\n \n\n&#x200B;\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadmlcq": [
        {
            "Parent ID": "t1_eaaoexw",
            "Comment ID": "eadmlcq",
            "Author": "[deleted]",
            "Date Created": "11-24-2018 13:59:10",
            "Upvotes": 1,
            "Text": "no one has mined bitcoin with a GPU in years, it's been 100x more profitable to mine altcoins for several years now",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac580t": [
        {
            "Parent ID": "t1_eac1c23",
            "Comment ID": "eac580t",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 21:33:32",
            "Upvotes": -8,
            "Text": "Shorty, stop appraising your own work.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacrr60": [
        {
            "Parent ID": "t1_eac4vdy",
            "Comment ID": "eacrr60",
            "Author": "QinEmperor",
            "Date Created": "11-24-2018 06:37:26",
            "Upvotes": 3,
            "Text": "Yet you can’t debate or refute any of his points lmao\n\nJust admit you’re butthurt he’s telling the truth.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabxzx0": [
        {
            "Parent ID": "t1_eabxqta",
            "Comment ID": "eabxzx0",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:30:52",
            "Upvotes": 7,
            "Text": "Math is hard. . .I know.  But if it isn't your strong suit, why play that card?  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzezx": [
        {
            "Parent ID": "t1_eabz3g7",
            "Comment ID": "eabzezx",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:54:42",
            "Upvotes": 8,
            "Text": "Give it a read.  Maybe you'll like it.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab83ne": [
        {
            "Parent ID": "t1_eab7jg7",
            "Comment ID": "eab83ne",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 13:10:48",
            "Upvotes": -1,
            "Text": "I'm talking about my case",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabtguz": [
        {
            "Parent ID": "t1_eabtck3",
            "Comment ID": "eabtguz",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 18:17:34",
            "Upvotes": 0,
            "Text": "lets drink to those poor souls",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabsbzi": [
        {
            "Parent ID": "t1_eabraok",
            "Comment ID": "eabsbzi",
            "Author": "ToBitOrNotToBit",
            "Date Created": "11-23-2018 17:59:27",
            "Upvotes": 2,
            "Text": "Is that so?? \n\nLook who's talking, the poor creature from the lake :-)\n\nLast i checked my x bitcoin are still x bitcoin and haven't run away :-)\n\nHaters gonna hate....suckers gonna.... spam :-)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac13jr": [
        {
            "Parent ID": "t1_eac00fl",
            "Comment ID": "eac13jr",
            "Author": "aaj094",
            "Date Created": "11-23-2018 20:22:34",
            "Upvotes": 3,
            "Text": " Let's see how well you are able to buy at 4k or maybe even 3k and then ride it to 100k.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaoh4n": [
        {
            "Parent ID": "t1_eaao264",
            "Comment ID": "eaaoh4n",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 08:05:36",
            "Upvotes": 0,
            "Text": "i think the 10mil is more likely than the 0. the only way we go to zero is if there is an exploit found that somehow destroys the entire network. Or, the only other way we go to zero is if bitcoin stops being valued in fiat all together, which is more likely that the former.   ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaarwg8": [
        {
            "Parent ID": "t1_eaartqj",
            "Comment ID": "eaarwg8",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 09:17:42",
            "Upvotes": 1,
            "Text": "HAHAAHAHA epic 10/10 trolling, man. good job. hahaha",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1lwk": [
        {
            "Parent ID": "t1_eaag4rj",
            "Comment ID": "eab1lwk",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 11:46:35",
            "Upvotes": 2,
            "Text": "[https://imgur.com/a/HcvJzpu](https://imgur.com/a/HcvJzpu)  \n\n\nWrong. Made $118 off you clowns who are still holding LMFAO. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab0um9": [
        {
            "Parent ID": "t1_eaaig8v",
            "Comment ID": "eab0um9",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 11:36:28",
            "Upvotes": 1,
            "Text": "Luckily for me, I make $150k a year and am not dumb enough to continuously gamble (yes gamble, not invest) in some garbage pyramid scheme",
            "Edited?": "11-23-2018 11:45:18",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxfsl": [
        {
            "Parent ID": "t1_eaap5pb",
            "Comment ID": "eaaxfsl",
            "Author": "Rheticule",
            "Date Created": "11-23-2018 10:50:48",
            "Upvotes": 1,
            "Text": "It's amazing, because I have a corporation registered with all the stocks in my hands (I think have like 100 stocks). By that principle, my corporation is probably worth more than $4000 per share using my business profitability as the metric for valuation! Boom, my business is now big time, stand aside Apple, I'm coming for you. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaapis9": [
        {
            "Parent ID": "t1_eaap5pb",
            "Comment ID": "eaapis9",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:29:25",
            "Upvotes": -2,
            "Text": "Seriously you just fucking pounded your own stupid little troll face with that comment bro. My post was about bitcoin not being dead. See when I owned BTC at 1k and it dropped back to 200 bucks we lost the same amount as if it dropped from 20k back to 4k. It wasn’t dead at 200 buck and it isn’t dead now at 4K. So I’m saying if stock shares were 4K each would you call that company fucking dead? Catch up little troll comon your hampster is falling asleep at the wheel. Yeah trolls are fucking dimwits but you could pretend to be smarter than a little shit who comes to a bitcoin forum to spew verbal diarrhea about tulips ha ha. Broke ass basement dwelling neck beard dweeb.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavky4": [
        {
            "Parent ID": "t1_eaauqkt",
            "Comment ID": "eaavky4",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:22:04",
            "Upvotes": 1,
            "Text": "Of course not. Although Bitcoin has made some impressive progress in the past 10 years compared to many other technologies that failed. My point, if you had taken the time to process what I wrote, as that many people evaluate future potential only on current state of a technology. This has been a big mistake multiple times throughout history, and it could very well end up being a mistake with some people's complacent stance on technologies like bitcoin. This whole market price thing has led people away from the fact that Bitcoin is an exceptionally secure and stable netork that maintains itself via perfect math. Maybe you don't see the value in that for potential future applications, but I believe it holds much value. We shall see over the next decade or so. Perhaps I am wrong, but at least open your mind.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabkamd": [
        {
            "Parent ID": "t1_eab7720",
            "Comment ID": "eabkamd",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 15:54:34",
            "Upvotes": 1,
            "Text": "This is absolutely true, but a 10 year stable network with loads of potential for future application and a growing development team is hardly shooting in the dark. Bitcoin has a built a great foundation over the past decade and and as someone who works with IT and Network security, I believe it has a very bright future. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaut36": [
        {
            "Parent ID": "t1_eaau9xl",
            "Comment ID": "eaaut36",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:08:45",
            "Upvotes": 4,
            "Text": "Bitcoin IS blockchain. PERIOD. If you don't realize this then you are not informed. All the efforts, all the node computing power, all the potential...lies within Bitcoin. All the altcoins, all the ICOs that failed, the entire crypto market.. is because of Bitcoin.\n\nRemember back in the dot com days, when everyone would attach dot com to their business names to see their share price soar, only to crash and burn within the same year? Well that's EXACTLY what happened with blockchain. Businesses over this past year attached the buzzword blcokchain to their name and watched their share prices soar only to crash soon after. But Bitcoin ..like the internet ..is still here and the bitcoin blockchain grows stronger and stronger. Lightning network, side chains, growing dev community etc. I have no intention of being rude here, I simply want to correct you because you are after all, on a bitcoin Reddit sub. I'm sure there are many things I don't know, like all of us. But I can tell you this: Bitcoin is what will survive all of this, and all of us.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaarltf": [
        {
            "Parent ID": "t1_eaar2sc",
            "Comment ID": "eaarltf",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 09:12:00",
            "Upvotes": 1,
            "Text": "You should have stayed quiet bro at least you could pretend you had half a clue ya? A peer to peer torrent system gives us the redundancy needed to fast track file sharing and verify the file wasn’t tampered with. So if you’re transferring a file that represents a placeholder for an amount of wealth on a global ledger that is (in the opinion of many who are way the fuck smarter than you) likely to become the accounting system of the future then ya it hold value. But the complacent troll type will not see that value don’t pop a blood vessel trying to understand it bro. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaayd59": [
        {
            "Parent ID": "t1_eaawq5b",
            "Comment ID": "eaayd59",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 11:03:26",
            "Upvotes": 1,
            "Text": "You believe that shit too that’s what makes it fucked. Must be awkward for you ya?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaax4j2": [
        {
            "Parent ID": "t1_eaawq5b",
            "Comment ID": "eaax4j2",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:46:17",
            "Upvotes": 1,
            "Text": "I don't think bitcoin or this sub is for you sir. I wonder why you are are here, but truly I don't really care. Nor I am sure do you care why I am here. But your understanding of Bitcoin is completely wrong. Many atheists take the time to learn about several religions because they enjoy the conversations. you are currently not equipped to have a conversation about bitcoin, yet you are here trying to contribute to the discussion. You don't see how strange that might seem to me?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaax7do": [
        {
            "Parent ID": "t1_eaawq5b",
            "Comment ID": "eaax7do",
            "Author": "Terrance021",
            "Date Created": "11-23-2018 10:47:29",
            "Upvotes": 0,
            "Text": "So shit coin?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaxn6f": [
        {
            "Parent ID": "t1_eaaxh7m",
            "Comment ID": "eaaxn6f",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:53:39",
            "Upvotes": 2,
            "Text": "I rest my case. You have zero insight and nothing to offer. Run along now.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaayiv6": [
        {
            "Parent ID": "t1_eaaxh7m",
            "Comment ID": "eaayiv6",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 11:05:31",
            "Upvotes": 1,
            "Text": "So if the world was full of peeps like you we’d have nothing. No tech nothing. Know what we’d have bro? Bullshit. Everything would be bullshit. And you be eaten cause you’d be the stupid slow one the rest of us would outrun ya?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac57w7": [
        {
            "Parent ID": "t1_eabfasf",
            "Comment ID": "eac57w7",
            "Author": "mjb5730",
            "Date Created": "11-23-2018 21:33:28",
            "Upvotes": 1,
            "Text": "Then why it is so many years is growing? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhpo7": [
        {
            "Parent ID": "t1_eabg7il",
            "Comment ID": "eabhpo7",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:18:37",
            "Upvotes": 1,
            "Text": "Institutional Investors**™**",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabjdo2": [
        {
            "Parent ID": "t1_eabhwnu",
            "Comment ID": "eabjdo2",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 15:41:27",
            "Upvotes": 1,
            "Text": "I'm taking about the Nasdaq",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabp2hs": [
        {
            "Parent ID": "t1_eabhwnu",
            "Comment ID": "eabp2hs",
            "Author": "ddmnyc",
            "Date Created": "11-23-2018 17:07:43",
            "Upvotes": 0,
            "Text": "Bitcoin isn’t a company. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabdwwx": [
        {
            "Parent ID": "t1_eabcfm1",
            "Comment ID": "eabdwwx",
            "Author": "mjb5730",
            "Date Created": "11-23-2018 14:26:03",
            "Upvotes": 1,
            "Text": "People is free to hold or sell, but they would not out at loss most probably, they have open mind and will not react with our comments, see if anyone in 2014 in loss if they have exited how huge they lost few month later, things can happen again or maybe not, anyone enter this era knows the risk, things can change, this is tough call indeed I agree",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabvqku": [
        {
            "Parent ID": "t1_eabuwdp",
            "Comment ID": "eabvqku",
            "Author": "aaj094",
            "Date Created": "11-23-2018 18:53:52",
            "Upvotes": 4,
            "Text": "Ok so that exposure made people aware of Bitcoin. So now what? Why do we need hype again? People can now calm down, take their time to understand what they had heard of, let themselves mull over thoughts and then enter the market when comfortable. Slowly but surely, the price inches back up because the number of bitcoins is fixed. No more insane hype needed nor desired. The hype has done its work of spreading awareness of the existence of a thing called Bitcoin. \n\nSomeone please provide anecdotal experience of America. It certainly isn't 4% by any stretch where I live. Not even 1%.",
            "Edited?": "11-23-2018 19:30:41",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacdy5m": [
        {
            "Parent ID": "t1_eaccqft",
            "Comment ID": "eacdy5m",
            "Author": "vidaru-x",
            "Date Created": "11-24-2018 00:13:34",
            "Upvotes": 1,
            "Text": "Programmable money has no value. 😂\n\nSources are needed otherwise it’s just outlandish statements",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac4h0t": [
        {
            "Parent ID": "t1_eabp4xp",
            "Comment ID": "eac4h0t",
            "Author": "nishbot",
            "Date Created": "11-23-2018 21:20:41",
            "Upvotes": 1,
            "Text": "But if b2 got a bigger network with the same blockchain technology, would you switch?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabfw7d": [
        {
            "Parent ID": "t1_eab937n",
            "Comment ID": "eabfw7d",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 14:53:25",
            "Upvotes": 2,
            "Text": "Except for when you buy it... Or sell it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabfchd": [
        {
            "Parent ID": "t1_eabbv4i",
            "Comment ID": "eabfchd",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 14:45:57",
            "Upvotes": 2,
            "Text": "I love when people tell me what I think :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaci9dq": [
        {
            "Parent ID": "t1_eachyzx",
            "Comment ID": "eaci9dq",
            "Author": "Sage1970",
            "Date Created": "11-24-2018 01:56:35",
            "Upvotes": -2,
            "Text": "Yea because I downvoted you. Oh wait, no that was you who downvoted me. Get over it kid. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab0lrj": [
        {
            "Parent ID": "t1_eab041j",
            "Comment ID": "eab0lrj",
            "Author": "The-Physicist",
            "Date Created": "11-23-2018 11:33:09",
            "Upvotes": 0,
            "Text": "It has a 3 year supply of oxygen which is more than bitcoin has ever needed \n\nFind us if you can. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaafllp": [
        {
            "Parent ID": "t1_eaaek6v",
            "Comment ID": "eaafllp",
            "Author": "Diabolicus666",
            "Date Created": "11-23-2018 04:51:32",
            "Upvotes": 2,
            "Text": "Neither have you ;-)\n\nWe can agree that we clearly have divergent definitions of adoption.\n\nCounting addresses doesn't do the trick, but simply adding up exchange user accounts doesn't really cut it either.\n\nWhile the number of exchanges has grown over the past year merchant adoption is stalling at best, and what worth is it to the bitcoin eco system to have funds merely sit on exchanges without seeing them being used for any transactions?\n\nEdit:\n\nAnd one thing to keep in mind: there are more than 2000 coins and tokens listed on coinmarketcap - what makes you so confident that new exchange user accounts were created to adopt only BTC?",
            "Edited?": "11-23-2018 05:05:35",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac1jx2": [
        {
            "Parent ID": "t1_eac0zeb",
            "Comment ID": "eac1jx2",
            "Author": "aaj094",
            "Date Created": "11-23-2018 20:30:17",
            "Upvotes": 4,
            "Text": "When Bitcoin gains say a multiple of 10, the mechanism by which this happens is not that you will need to find one person paying you 10 times the amount. If this were the case, Bitcoin would be like an indivisible Mona Lisa for which you need the entire appreciated amount to come from one buyer. But Bitcoin is infinitely divisible so the sustainable gains come due to adoption by growing number of people buying a smaller and smaller proportion of the supply for the same fiat amount. So this doesn't require you to be in search of people with higher and higher amounts of fiat in their pockets. \n\nAnd you talk of dividend being the benefit of a stock. Here it is a different benefit - that of being an unconfiscateable asset that can be transferred trustlessly and whose total supply won't change. Why insist that fiat is worth exchanging only for one type of benefit?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachvyy": [
        {
            "Parent ID": "t1_eac0zeb",
            "Comment ID": "eachvyy",
            "Author": "whalecheetah",
            "Date Created": "11-24-2018 01:46:49",
            "Upvotes": 2,
            "Text": "That's literally the same way any finite resource works",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2qn3": [
        {
            "Parent ID": "t1_eac0zeb",
            "Comment ID": "eac2qn3",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 20:50:49",
            "Upvotes": 1,
            "Text": "But nobody forced crypto market participation. Some people actually enjoy it. A lot of people enjoy many things. What's the issue with that?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "each46m": [
        {
            "Parent ID": "t1_eac0zeb",
            "Comment ID": "each46m",
            "Author": "damchi",
            "Date Created": "11-24-2018 01:27:05",
            "Upvotes": 1,
            "Text": "Dividends and other shareholder rights don't aren't the main factor in stock trading. Speculation is what drives most of the stock markets. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac4052": [
        {
            "Parent ID": "t1_eac1nbc",
            "Comment ID": "eac4052",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 21:12:38",
            "Upvotes": 3,
            "Text": "The biggest kick I get from all that is they think we don't know ha ha.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac277h": [
        {
            "Parent ID": "t1_eac1nbc",
            "Comment ID": "eac277h",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:41:26",
            "Upvotes": 2,
            "Text": "LOL - You should probably delete your 3 month old account. \n\nI'm not STBT.  I merely got lost in the thread and realized his reply was to someone else, and deleted it.  But if you like, I'll repost it because I thought it was funny.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac37w9": [
        {
            "Parent ID": "t1_eac1nbc",
            "Comment ID": "eac37w9",
            "Author": "fakersdozen",
            "Date Created": "11-23-2018 20:59:09",
            "Upvotes": 0,
            "Text": "Oh no. You are going to delete your account, again. And come back, again. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacw7lp": [
        {
            "Parent ID": "t1_eacuaiz",
            "Comment ID": "eacw7lp",
            "Author": "BCash_BeTrash",
            "Date Created": "11-24-2018 08:24:14",
            "Upvotes": 1,
            "Text": "TittieCoin is a genuine shitcoin.  Ticker is TTC :)  \n\nProbably be worth about 1 Bcash in a week's time - so a possible investment opportunity there :)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacdvkx": [
        {
            "Parent ID": "t1_eaccawg",
            "Comment ID": "eacdvkx",
            "Author": "vidaru-x",
            "Date Created": "11-24-2018 00:11:59",
            "Upvotes": 2,
            "Text": "Didn’t you accidentally reply as another account and then delete it? I’d say that’s a smoking gun if I ever saw one. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachuly": [
        {
            "Parent ID": "t1_eaccawg",
            "Comment ID": "eachuly",
            "Author": "whalecheetah",
            "Date Created": "11-24-2018 01:45:50",
            "Upvotes": 1,
            "Text": "That's kind of hard to believe. You magically appear whenever the price Falls and go away whenever it rallies",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacqvj4": [
        {
            "Parent ID": "t1_eaajeqg",
            "Comment ID": "eacqvj4",
            "Author": "aidanlister",
            "Date Created": "11-24-2018 06:11:05",
            "Upvotes": 0,
            "Text": "But given we can't suddenly swap the whole world to renewables, the problem is still Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaawcoj": [
        {
            "Parent ID": "t1_eaavfki",
            "Comment ID": "eaawcoj",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 10:34:13",
            "Upvotes": 1,
            "Text": "Probably plays well over at Doublewide Village.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyg1u": [
        {
            "Parent ID": "t1_eabxzx0",
            "Comment ID": "eabyg1u",
            "Author": "Dontrun_glide",
            "Date Created": "11-23-2018 19:38:13",
            "Upvotes": 0,
            "Text": "Is there anything else but misdirection and lying from trolls on this board?\n\n800 words in 20 minutes?  0.67 words per second.  Under one word per second.\n\nWhy all the lying?  \n\nWhat is your motivation?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzw6m": [
        {
            "Parent ID": "t1_eabzezx",
            "Comment ID": "eabzw6m",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:02:41",
            "Upvotes": -4,
            "Text": "It is recycled rubbish.\n\nStop bumping so many electrons around the internet with your inane and obvious conjectures.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabtil3": [
        {
            "Parent ID": "t1_eabsbzi",
            "Comment ID": "eabtil3",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 18:18:22",
            "Upvotes": 0,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:17:03",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac30vl": [
        {
            "Parent ID": "t1_eac13jr",
            "Comment ID": "eac30vl",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 20:55:48",
            "Upvotes": 0,
            "Text": "Have bought a MegaMillions ticket. Much higher chance of the ticket winning than BTC even clawing back to 8000.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaau964": [
        {
            "Parent ID": "t1_eaarwg8",
            "Comment ID": "eaau964",
            "Author": "ExodiaTheBrazilian",
            "Date Created": "11-23-2018 09:59:10",
            "Upvotes": 0,
            "Text": "You couldn't satisfactorily refute his claim. I guess the truth sank in, hm?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab6lnr": [
        {
            "Parent ID": "t1_eab1lwk",
            "Comment ID": "eab6lnr",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 12:52:00",
            "Upvotes": 1,
            "Text": "118 LMFAO now I know not to take people like you serious. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaf3zjn": [
        {
            "Parent ID": "t1_eab0um9",
            "Comment ID": "eaf3zjn",
            "Author": "krom1985",
            "Date Created": "11-25-2018 04:04:50",
            "Upvotes": 1,
            "Text": "Nobody gives a fuck what you earn pal. Look forward to the stocks and bonds bonfire that will ensue next year...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaq758": [
        {
            "Parent ID": "t1_eaapis9",
            "Comment ID": "eaaq758",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 08:44:05",
            "Upvotes": 7,
            "Text": "Dear fool, \n\nThe price per share is not important. Kuwaiti dinar is probably 500+ yen, and it doesn't prove that Kuwait is 600 times richer than Japan.\n\nIn other words Unit Size is not crucial. You could have a million:1 reverse stock split of Enron and it would trade at 10,000 bitcoins.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaapr8s": [
        {
            "Parent ID": "t1_eaapis9",
            "Comment ID": "eaapr8s",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 08:34:39",
            "Upvotes": 3,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaqsa1": [
        {
            "Parent ID": "t1_eaapis9",
            "Comment ID": "eaaqsa1",
            "Author": "bangohat5",
            "Date Created": "11-23-2018 08:55:53",
            "Upvotes": 4,
            "Text": "Sounds like you lost a ton, so angry. I'll wait until it hits 200 and buy some.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaw7f6": [
        {
            "Parent ID": "t1_eaavky4",
            "Comment ID": "eaaw7f6",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:31:49",
            "Upvotes": -1,
            "Text": "I don't see any value in \"solving unspecified math problems for nobody.\" \n\nAlso computers function with 1s and 0s, so it's impossible to \"limit\" anything to 21 million. More 1s and 0s can always come in.\n\nNot that scarcity matters in light of valuelessness.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaav37e": [
        {
            "Parent ID": "t1_eaaut36",
            "Comment ID": "eaav37e",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 10:13:38",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaav3yg": [
        {
            "Parent ID": "t1_eaaut36",
            "Comment ID": "eaav3yg",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:14:02",
            "Upvotes": -3,
            "Text": "Here's how blockchain would behave if it was a useful technology.\n\nYou would read on the news \"A bunch of 20 year olds that invented blockchain, have sold the patent to JPMorgan Chase for $25 million.\"\n\nAnd this would mean that your banking fees drop from 1% to 0.2%.\n\nHowever none of this has taken place, so Nouriel Roubini has concluded that blockchain is worthless.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaasagc": [
        {
            "Parent ID": "t1_eaarltf",
            "Comment ID": "eaasagc",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 09:24:50",
            "Upvotes": 2,
            "Text": "If you suddenly declared 100 Bitcoins redeemable for 1 ounce of gold, then one bitcoin should trade at $12. \n\nHowever you don't even have that declaration, so the fair value is actually $0.\n\nI'm not sure what Ledger means, but I will assume it's like a piece of paper, but not suitable for toilet tissue.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabaiqg": [
        {
            "Parent ID": "t1_eaax4j2",
            "Comment ID": "eabaiqg",
            "Author": "sp5low",
            "Date Created": "11-23-2018 13:41:55",
            "Upvotes": 1,
            "Text": "How much are you down?\n\nI lost 12k but still hodling",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaboybv": [
        {
            "Parent ID": "t1_eabhpo7",
            "Comment ID": "eaboybv",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 17:05:56",
            "Upvotes": 1,
            "Text": "Must be why the price went up so much in 2018.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabjxx5": [
        {
            "Parent ID": "t1_eabjdo2",
            "Comment ID": "eabjxx5",
            "Author": "peacockypeacock",
            "Date Created": "11-23-2018 15:49:17",
            "Upvotes": 1,
            "Text": "The companies driving the Nasdaq to new highs in recent years largely didn't exist in 2000.  FB, AAPL, NFLX, GOOGL, etc.  are newer (or in the case of AAPL were nothing before 2000).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabjyhm": [
        {
            "Parent ID": "t1_eabjdo2",
            "Comment ID": "eabjyhm",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 15:49:31",
            "Upvotes": 1,
            "Text": "You don't invest in the Nasdaq, you can invest in companies on the Nasdaq (eg Cisco). Also, it took the Nasdaq Composite Index 15 years to recover so not a great investment and again, that was driven by different companies to 2000.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabper7": [
        {
            "Parent ID": "t1_eabp2hs",
            "Comment ID": "eabper7",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 17:13:06",
            "Upvotes": 3,
            "Text": "Bitcoin is to cryptocurrency what Cisco is to tech. Bitcoin is not an asset class or even subclass, it is a specific asset that people invest in just like buying shares of Cisco.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabez3n": [
        {
            "Parent ID": "t1_eabdwwx",
            "Comment ID": "eabez3n",
            "Author": "maxtbag",
            "Date Created": "11-23-2018 14:40:41",
            "Upvotes": 2,
            "Text": "Yet again you refer to 2014 as an example to apply to now. You really can't do that. And yes it's everyones choice to leave at a loss or not. It really isn't a bad decision though. Risky to do now though If you've held down to this point. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabhoid": [
        {
            "Parent ID": "t1_eabdwwx",
            "Comment ID": "eabhoid",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 15:18:08",
            "Upvotes": 1,
            "Text": "Bitcoin's climb up to $1,000 was total market manipulation. There's also some compelling evidence that the climb to $20,000 was just a continuation of that.\n\nAt the very least, wait until the DoJ probe concludes and see what happens from there. If they can't find evidence that Tether inflated the markets, I'd feel much better buying at these prices. Otherwise, bitcoin is probably truly worth... $100? $20?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacpdx1": [
        {
            "Parent ID": "t1_eac4h0t",
            "Comment ID": "eacpdx1",
            "Author": "aaj094",
            "Date Created": "11-24-2018 05:26:12",
            "Upvotes": 1,
            "Text": "If bigger network, more decentralised, more secure then yes. But why will that happen? Most Bitcoin forks happen, in the first place, due to egos and hidden objectives of a few so that takes away the possibility of what you are saying or at least makes the possibility very negligible. I am not here to tell you that Bitcoin is a zero risk vehicle but rather telling you my view on some of the supposed risks. I do have some alt coins though BTC is lion's share and M is lion's share of the remaining. The proportion I have in alt coins is based on my assessment of the probability that they may end up with a valuable network. I don't claim it is absolute zero for other coins but at the same time it is not that any new coin or fork starts on an equal footing and immediately dilutes Bitcoin.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacjajs": [
        {
            "Parent ID": "t1_eaci9dq",
            "Comment ID": "eacjajs",
            "Author": "maxtbag",
            "Date Created": "11-24-2018 02:23:20",
            "Upvotes": 3,
            "Text": "Triggered! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eab1are": [
        {
            "Parent ID": "t1_eab0lrj",
            "Comment ID": "eab1are",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 11:42:31",
            "Upvotes": 1,
            "Text": "I’m looking ...",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eactw8n": [
        {
            "Parent ID": "t1_eac1jx2",
            "Comment ID": "eactw8n",
            "Author": "Foxehh3",
            "Date Created": "11-24-2018 07:37:08",
            "Upvotes": 2,
            "Text": "> When Bitcoin gains say a multiple of 10\n\n>> whose total supply won't change. \n\nMLM.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacsweh": [
        {
            "Parent ID": "t1_eachvyy",
            "Comment ID": "eacsweh",
            "Author": "AbsolutPower81",
            "Date Created": "11-24-2018 07:12:19",
            "Upvotes": 2,
            "Text": "\"resources\" are by definition things that you can actually use directly, e.g. oil",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacszr6": [
        {
            "Parent ID": "t1_each46m",
            "Comment ID": "eacszr6",
            "Author": "AbsolutPower81",
            "Date Created": "11-24-2018 07:14:49",
            "Upvotes": 1,
            "Text": "But it's speculation about how much profit the underlying company will generate in the future,vnot speculation about how much fomo'ers will pay in the future.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2ddy": [
        {
            "Parent ID": "t1_eac277h",
            "Comment ID": "eac2ddy",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:44:25",
            "Upvotes": 2,
            "Text": "OK Shorty.\n\nYou need to understand that you can't manipulate BTC prices on these boards.   There are greater forces at work.\n\nYour asinine comments won't help you to recover all the money you have lost attempting to predict BTC prices, and through investing in shitcoins and altcoins.",
            "Edited?": "11-23-2018 20:48:17",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadfzvi": [
        {
            "Parent ID": "t1_eacw7lp",
            "Comment ID": "eadfzvi",
            "Author": "-Kite-Man-",
            "Date Created": "11-24-2018 12:45:08",
            "Upvotes": 1,
            "Text": "So you were implying I'm secretly...a piece of cryptocurrency?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacfwj6": [
        {
            "Parent ID": "t1_eacdvkx",
            "Comment ID": "eacfwj6",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-24-2018 00:57:25",
            "Upvotes": 0,
            "Text": "No.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacrdjc": [
        {
            "Parent ID": "t1_eacdvkx",
            "Comment ID": "eacrdjc",
            "Author": "Kelkymcdouble",
            "Date Created": "11-24-2018 06:26:09",
            "Upvotes": 0,
            "Text": "No",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyo4x": [
        {
            "Parent ID": "t1_eabyg1u",
            "Comment ID": "eabyo4x",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:42:05",
            "Upvotes": 5,
            "Text": "Mods: can you buy this man some math lessons?  Maybe there's some crash course online that can be paid for with bitcoin?  \n\n20 minutes X 60 seconds/minute = 1200 seconds\n\nLet's not even get into the weird hangup over whether I spent 20 or 25 minutes and what possible difference that makes in. . .well, anything at all.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabyrby": [
        {
            "Parent ID": "t1_eabyg1u",
            "Comment ID": "eabyrby",
            "Author": "AJMGuitar",
            "Date Created": "11-23-2018 19:43:37",
            "Upvotes": 5,
            "Text": "Are you going to counter the points or calculate their typing speed? Based on yours and previous answers to the post I will assume you have nothing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac08o9": [
        {
            "Parent ID": "t1_eabzw6m",
            "Comment ID": "eac08o9",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:08:22",
            "Upvotes": 11,
            "Text": "So you did read it.  Any specific responses beyond you think it's inane and obvious.\n\nBecause I'm thinking a lot of people missed it last year, and got badly hurt.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabtxol": [
        {
            "Parent ID": "t1_eabtil3",
            "Comment ID": "eabtxol",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 18:25:01",
            "Upvotes": 0,
            "Text": "if air you breathe would cost you that wouldnt make it more or less valuable. if you see btc, cryptomoney as future, what you can exchange it for now is not its value",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaueo7": [
        {
            "Parent ID": "t1_eaau964",
            "Comment ID": "eaaueo7",
            "Author": "bluethunder1985",
            "Date Created": "11-23-2018 10:01:47",
            "Upvotes": 2,
            "Text": "There is nothing to refute. The poor guy is ignorant of reality.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabbjvs": [
        {
            "Parent ID": "t1_eab6lnr",
            "Comment ID": "eabbjvs",
            "Author": "lonzosabust",
            "Date Created": "11-23-2018 13:54:53",
            "Upvotes": 1,
            "Text": "Yeah it's literally pocket change to me, but I pulled out before it was too late rather than holding on and losing thousands like some of you. Are you saying you're net positive still? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaar9l3": [
        {
            "Parent ID": "t1_eaaq758",
            "Comment ID": "eaar9l3",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 09:05:28",
            "Upvotes": 0,
            "Text": "Wow you must be another brainless troll. Ok so let’s talk slow. How about you read it slow. Empty your mind (should be easy). Now repeat after me: A 4k bitcoin is not a good time to call bitcoin dead. Bitcoin was 200 bucks a very short time ago and now it’s 4k. So if it hits 200 bucks again you can troll some more and maybe even feel better ya? But for now bitcoin is a healthy 4K.\nSo you trade stocks often big shot? Tell me this. Have you ever seen a stock shoot up 2x 3x and then fall back to where it was 3 years ago and still the company is doing just fine? So let’s forget about your limited ability to evaluate 0s and 1s you’ve already shown us your as technical as a wooden leg but think about what qualifies a company as dead. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaq9bi": [
        {
            "Parent ID": "t1_eaapr8s",
            "Comment ID": "eaaq9bi",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 08:45:19",
            "Upvotes": -1,
            "Text": "Oh “that’s” why you’re here ya? Why didn’t you say? I just thought you were a loser with no life who was throwing out the ol tired tulips comments cause you were a noob who thought that insult was still fresh! Sorry bro, I was underwater a few years back too. I thought trading bitcoin worked like trading stocks son it took a few years to learn the market. Short it down and ride it up baby. Sorry for your loss bro but you should never invest more than you can lose right? You should never have been a little bitcoin blockchain fanboy, that was a bad decision.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaawv6t": [
        {
            "Parent ID": "t1_eaaw7f6",
            "Comment ID": "eaawv6t",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:42:22",
            "Upvotes": 2,
            "Text": "It's called network value, and if you've ever ran a business or know someone who does, consider what they pay for a secure computer network. Now apply that value to a global network. Decentralized and not bound to any one country or region. Its accuracy impeccable, its stability more impressive than any other network on the globe. Its tamper proof features make other cyber security options pale in comparison.\nThe benefit of the options it provides to allow people to own a currency that is not ruled by any one country are endless. Speak with miners and investors that have been involved for at least 5+ years. Don't rely on these click-bait articles and statements from bankers and people heavily invested in the traditional system for your insight...OF COURSE they are going to down-play Bitcoin!\nAt the very least keep an open mind because the road ahead is a long one.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavtjz": [
        {
            "Parent ID": "t1_eaav37e",
            "Comment ID": "eaavtjz",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 10:25:45",
            "Upvotes": 1,
            "Text": "Well that's why the terms subjective and objective exist correct? It's very easy to allow your ego to trick you into believing that you couldn't possibly be wrong. Particularly if you're acquiring your knowledge of bitcoin and blockchain from clickbait articles written primarily to capture traffic to generate revenue from ad clicks. I actually work in the field. Even though I feel I am a credible source of information in this vertical, I am willing to admit that of course I may be wrong about Bitcoin's future. Are you willing to admit that I may be right?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaasxhz": [
        {
            "Parent ID": "t1_eaasagc",
            "Comment ID": "eaasxhz",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 09:36:52",
            "Upvotes": 1,
            "Text": "The very bare bone basics of at least having the slightest of a clue what bitcoin is would be to understand that it is a ledger. Bro if you don’t have that then you got no right to be poking your bullshit in this sub. Now that ain’t being a bitcoin fanboy or any of that crap, that was the most fair statement I’ve probably made in here. It’s an accounting system. It’s digital currency ya but that will take generations and we’ll be old and gray by then. So for now it’s a market and it’s a fun as shit one of you can get your head out of your ass. If you really think bitcoin will keep sinking short it on BitMex we’ve made a killing there. Or you can stay in this thread pretending to know the future of bitcoin without even knowing what a ledger is ya? Come back down to earth bro.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabjy1x": [
        {
            "Parent ID": "t1_eabaiqg",
            "Comment ID": "eabjy1x",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 15:49:20",
            "Upvotes": 1,
            "Text": "I was up a lot, but then the past 12 months cut into my gains. I'm not doing bad but I did average down with new $$ since February, so that portion is a bust. Bottom line it's approx 5% of my investment dollars, so my stocks and real estate are doing great lol.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabp62v": [
        {
            "Parent ID": "t1_eaboybv",
            "Comment ID": "eabp62v",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 17:09:15",
            "Upvotes": 1,
            "Text": "Duh, they're just suppressing the price while they accumulate.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabmdrc": [
        {
            "Parent ID": "t1_eabjxx5",
            "Comment ID": "eabmdrc",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 16:26:41",
            "Upvotes": 1,
            "Text": "Yes but the Nasdaq broke through the highs created in the previous bubble, that was the question",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabmep9": [
        {
            "Parent ID": "t1_eabjyhm",
            "Comment ID": "eabmep9",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 16:27:04",
            "Upvotes": 1,
            "Text": "I invest in the Nasdaq all the time",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabms9z": [
        {
            "Parent ID": "t1_eabhoid",
            "Comment ID": "eabms9z",
            "Author": "BotWithfeelings",
            "Date Created": "11-23-2018 16:32:50",
            "Upvotes": 1,
            "Text": "You keep saying it was total market manipulation and that there is proof but yet i have seen not one sigle source.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eachdct": [
        {
            "Parent ID": "t1_eab1are",
            "Comment ID": "eachdct",
            "Author": "srock2012",
            "Date Created": "11-24-2018 01:33:41",
            "Upvotes": 3,
            "Text": "I'm just over here buying the dip...and buying the dip....and buying the dip...until people realize that a currency backed by burning energy and wearing computer parts is even stupider than faith in a fiat currency and the dip turns into a crash.\n\nI really have no skin in the game, I just thought it was stupid when it hit a thousand then stupid when it hit 3 then 10 then 15.  Had to crash down to something reasonable eventually.  I hope for the people invested that it doesn't crash.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eacu14u": [
        {
            "Parent ID": "t1_eactw8n",
            "Comment ID": "eacu14u",
            "Author": "aaj094",
            "Date Created": "11-24-2018 07:40:23",
            "Upvotes": 1,
            "Text": "Was there something you did not understand here?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eadhipk": [
        {
            "Parent ID": "t1_eacsweh",
            "Comment ID": "eadhipk",
            "Author": "whalecheetah",
            "Date Created": "11-24-2018 13:02:51",
            "Upvotes": 1,
            "Text": "re·source\n\n/ˈrēˌsôrs,rəˈsôrs/\n\nnoun\n\n1.\n\na stock or supply of money, materials, staff, and other assets that can be drawn on by a person or organization in order to function effectively.\n\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac414w": [
        {
            "Parent ID": "t1_eac2ddy",
            "Comment ID": "eac414w",
            "Author": "nishbot",
            "Date Created": "11-23-2018 21:13:06",
            "Upvotes": 7,
            "Text": "If one person can manipulate the price of bitcoin on a subreddit, people should be rethinking the asset as a whole.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2m7z": [
        {
            "Parent ID": "t1_eac2ddy",
            "Comment ID": "eac2m7z",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:48:39",
            "Upvotes": 0,
            "Text": "You want to talk about anything substantive about my post?  If so, I'm game to continue. \n\nIf not, believe what you like and have a great night.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabz0zk": [
        {
            "Parent ID": "t1_eabyo4x",
            "Comment ID": "eabz0zk",
            "Author": "Dontrun_glide",
            "Date Created": "11-23-2018 19:48:10",
            "Upvotes": 0,
            "Text": ".. and 800 words / 1200 seconds = 0.067 words / second.\n\n1.  Why are you appealing to the mods to support your poor understanding of basic arithmetic, after tl;dr-ing on this board?\n\n2.  Why are you arguing with a postgraduate in mathematics? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabu5ay": [
        {
            "Parent ID": "t1_eabtxol",
            "Comment ID": "eabu5ay",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 18:28:31",
            "Upvotes": 1,
            "Text": "[removed]",
            "Edited?": "01-02-2020 14:16:58",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabg9rr": [
        {
            "Parent ID": "t1_eabbjvs",
            "Comment ID": "eabg9rr",
            "Author": "perkia",
            "Date Created": "11-23-2018 14:58:25",
            "Upvotes": 2,
            "Text": "*crickets*",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaufe0": [
        {
            "Parent ID": "t1_eaar9l3",
            "Comment ID": "eaaufe0",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:02:09",
            "Upvotes": 2,
            "Text": "No earnings expected = company is dead\n\nBitcoin's announced dividends:\n\n2018 $0\n\n2019 $0\n\n2020 $0\n\n2021 $0\n\n2030 $0\n\n2200 $0\n\n3000 $0",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaarawy": [
        {
            "Parent ID": "t1_eaaq9bi",
            "Comment ID": "eaarawy",
            "Author": "bangohat5",
            "Date Created": "11-23-2018 09:06:11",
            "Upvotes": 3,
            "Text": "Bitcoin is a great store of value. Pretty sure just putting money in the bank would be better. Say you had 20k in bitcoin and decided to take 10k out to buy something then woke up the next day and only had 10k left because it crashed. That's not a store of value. Crypto is not different then the stock market, the more money invested the higher the price moves up. Now a smart person I know is some old lady that lives near me and she invested over 50 years ago and only invested in companies that gave dividends and has been living off them for who knows how long. Can't even imagine what here stocks are worth today if she sold them all.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatia0": [
        {
            "Parent ID": "t1_eaasxhz",
            "Comment ID": "eaatia0",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 09:46:30",
            "Upvotes": 1,
            "Text": "One doesn't have to be an expert in a particular field, in order to grasp its value.\n\nFor example if I'm 9 years old, I can be convinced that a VCR is useful, because I can record cartoons.\n\nSo I will pay $ for the VCR and I don't have to be an electrical engineer and understand the device's inner workings.\n\nSo, it's just a copout to say: \"You don't understand why this homeless bum's used toothpick is worth $10,000,000 and you only consider it $0 because you aren't a biologist with a deep understanding of the DNA of saliva.\"\n\nThat is your argument about bitcoin, that I would see its value if I studied at Geek University of Flat Earth",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabonbn": [
        {
            "Parent ID": "t1_eabmdrc",
            "Comment ID": "eabonbn",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 17:01:14",
            "Upvotes": 1,
            "Text": "Nasdaq Inc wasn't publicly listed until 2002 so can't be used as a reference. If you're talking about the Nasdaq Index then you're comparing Apples and Apache Attack Helicopters.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabop4f": [
        {
            "Parent ID": "t1_eabmep9",
            "Comment ID": "eabop4f",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 17:01:58",
            "Upvotes": 1,
            "Text": "Nasdaq Inc didn't float until 2002 so how can it be used as a reference?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabnpxz": [
        {
            "Parent ID": "t1_eabms9z",
            "Comment ID": "eabnpxz",
            "Author": "[deleted]",
            "Date Created": "11-23-2018 16:47:02",
            "Upvotes": 1,
            "Text": "[https://techcrunch.com/2018/01/15/researchers-finds-that-one-person-likely-drove-bitcoin-from-150-to-1000/](https://techcrunch.com/2018/01/15/researchers-finds-that-one-person-likely-drove-bitcoin-from-150-to-1000/)\n\n[https://www.cnbc.com/2018/06/13/much-of-bitcoins-2017-boom-was-market-manipulation-researcher-says.html](https://www.cnbc.com/2018/06/13/much-of-bitcoins-2017-boom-was-market-manipulation-researcher-says.html)\n\nYou're probably going to say these aren't legit sources - which is fine - believe what you want. We'll find out either way once the DoJ probe is concluded, I think.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac45dm": [
        {
            "Parent ID": "t1_eac414w",
            "Comment ID": "eac45dm",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 21:15:08",
            "Upvotes": 2,
            "Text": "Another false argument.\n\nI was saying that you couldn't.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac42y0": [
        {
            "Parent ID": "t1_eac2m7z",
            "Comment ID": "eac42y0",
            "Author": "cryptogrip",
            "Date Created": "11-23-2018 21:13:57",
            "Upvotes": 1,
            "Text": "Owned ...burrrrnnn",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2wr8": [
        {
            "Parent ID": "t1_eac2m7z",
            "Comment ID": "eac2wr8",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 20:53:47",
            "Upvotes": 0,
            "Text": "That is not a graceful departure, it is a retreat.\n\nYou have been caught out.\n\nDon't come back.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabz44g": [
        {
            "Parent ID": "t1_eabz0zk",
            "Comment ID": "eabz44g",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 19:49:41",
            "Upvotes": 8,
            "Text": "Oof. . .I mean, this is just downright embarrassing now.\n\n1200/800 is the calculation you seek.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabzkfl": [
        {
            "Parent ID": "t1_eabz0zk",
            "Comment ID": "eabzkfl",
            "Author": "ShortyTheBearTrader",
            "Date Created": "11-23-2018 19:57:13",
            "Upvotes": 3,
            "Text": "Because BTC investing is based on naked hope, not hard financial calculus.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eabvpg7": [
        {
            "Parent ID": "t1_eabu5ay",
            "Comment ID": "eabvpg7",
            "Author": "ExpensiveDepartment",
            "Date Created": "11-23-2018 18:53:20",
            "Upvotes": 2,
            "Text": "I think that crypto has a future if it can prove itself to be safe against different challenges, like resilient against hacking, mining exploits etc. If it is what it advertises itself to be there is no way that it has no future. Think about future social networks. Are they going to be willing to live with value system sanctioned by some other parties, or with self sustainable system that treat everyone fairly and cannot be cheated even if everyone wanted to.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaav9gw": [
        {
            "Parent ID": "t1_eaaufe0",
            "Comment ID": "eaav9gw",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 10:16:44",
            "Upvotes": 1,
            "Text": "Does it hurt your brain trying to understand how to value something that you never had to value before bro? New and innovative are not your wheelhouse ya? And so you know that exact post you just made was made in 2014 so you copied the idea and changed he numbers ... to make them HIGHER by the way, geeees it grew over the past 4 years imagine that ya? Or you just have the same mindset bitcoin bashers had back then. Either way it was stupid then and still means nothing.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaatbox": [
        {
            "Parent ID": "t1_eaarawy",
            "Comment ID": "eaatbox",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 09:43:28",
            "Upvotes": 0,
            "Text": "Bro I actually enjoyed that comment. No bullshit no trolling. Good on ya!! I love dividend stocks and I’ll probably not sell mine until I’m old and gray. But bitcoin has the potential to be the future of accounting a currency and a store of value in a digital society and that’s gonna take some time bro. For now it’s a risk market for some fun!",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0fy3": [
        {
            "Parent ID": "t1_eabonbn",
            "Comment ID": "eac0fy3",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 20:11:41",
            "Upvotes": 1,
            "Text": "Yes I'm talking about the Nasdaq index, which created a bubble in 2000, crashed, and then surpassed that bubble high o er a decade later. Same index. It's not complicated.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac0gv0": [
        {
            "Parent ID": "t1_eabop4f",
            "Comment ID": "eac0gv0",
            "Author": "liammul1980",
            "Date Created": "11-23-2018 20:12:06",
            "Upvotes": 1,
            "Text": "Index",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac2z1o": [
        {
            "Parent ID": "t1_eac2wr8",
            "Comment ID": "eac2z1o",
            "Author": "OliveTBeagle",
            "Date Created": "11-23-2018 20:54:57",
            "Upvotes": 1,
            "Text": "G'night sunshine.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaavel5": [
        {
            "Parent ID": "t1_eaav9gw",
            "Comment ID": "eaavel5",
            "Author": "IncrediCrashto3999",
            "Date Created": "11-23-2018 10:19:10",
            "Upvotes": 2,
            "Text": "There was only 1 hyping event, and the previous moonings were tiny and insignificant. Only known by the dork lobby.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac6xsy": [
        {
            "Parent ID": "t1_eac0fy3",
            "Comment ID": "eac6xsy",
            "Author": "LargeMarineCreature",
            "Date Created": "11-23-2018 22:03:22",
            "Upvotes": 1,
            "Text": "As I said, Apples and Apache Helicopters. The top 10 companies on the Nasdaq in 2000 were:\n\nMicrosoft, Cisco, Intel, Oracle, Sun Micro, MCI Worldcom, Dell, Yahoo, Qualcomm, Applied Materials. \n\nTaking into account inflation, only Microsoft would have seen positive growth since March 2000. Ignoring inflation you can include Oracle and that's it. The rest have either gone bust, been acquired because their share price tanked or are still a long way off their ATH.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eac4mf1": [
        {
            "Parent ID": "t1_eac2z1o",
            "Comment ID": "eac4mf1",
            "Author": "BCash_BeTrash",
            "Date Created": "11-23-2018 21:23:16",
            "Upvotes": 1,
            "Text": "OK Shorty.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaaywcc": [
        {
            "Parent ID": "t1_eaavel5",
            "Comment ID": "eaaywcc",
            "Author": "cipher-space",
            "Date Created": "11-23-2018 11:10:29",
            "Upvotes": 1,
            "Text": "Yeah? Well you put 10k in then or this past January and you lost the same. Well unless you shorted like most of us did ya?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eae27g3": [
        {
            "Parent ID": "t1_eac6xsy",
            "Comment ID": "eae27g3",
            "Author": "liammul1980",
            "Date Created": "11-24-2018 17:10:51",
            "Upvotes": 1,
            "Text": "It doesn't matter what companies make up the index and how they change, all that matters is that you own it.\nAnd if you owned it during that last bubble, and held it until now,you would have seen the  new all time highs.\nYou can have a housing bubble following and other housing bubble in the same country with different houses",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "eaevtxx": [
        {
            "Parent ID": "t1_eae27g3",
            "Comment ID": "eaevtxx",
            "Author": "LargeMarineCreature",
            "Date Created": "11-25-2018 00:38:09",
            "Upvotes": 1,
            "Text": "OK, if you invest in the NASDAQ all the time, please explain how you buy it? How would someone buy the NASDAQ index and hold it for 17 years?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}