{
    "ecpv9ks": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpv9ks",
            "Author": "BashCo",
            "Date Created": "12-28-2018 03:57:41",
            "Upvotes": 1,
            "Text": "###[If you use Electrum, in case you get a error message that tells you to update please ignore \\(ongoing phishing attack\\).](https://old.reddit.com/r/Bitcoin/comments/a9ygca/if_you_use_electrum_in_case_you_get_a_error/) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": true
        }
    ],
    "ecrccvk": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrccvk",
            "Author": "BitcoinAlways",
            "Date Created": "12-28-2018 16:34:18",
            "Upvotes": 8,
            "Text": "Can we have some proper bull action for a change!? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqi6dj": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqi6dj",
            "Author": "synapticwave",
            "Date Created": "12-28-2018 10:55:45",
            "Upvotes": 6,
            "Text": "How does someone earn fees from operating a lightning node? Does the node operator need to open multiple channels with balances, or is just one channel? Is just having the node online automatically earn those fees, or is any other set-up required to earn them?\n\nedit: also does the balance of an open channel impact the amount of fees you can earn?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrmdv1": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrmdv1",
            "Author": "The-Physicist",
            "Date Created": "12-28-2018 18:42:30",
            "Upvotes": 5,
            "Text": "🌈 Hopium Time 🚀 🌝 - S02E26\n\n&nbsp;\n\nMan, I'm glad I don't live in Venezuela.  Bitcoin to save the day!  \n\n&nbsp;\n  \n\"Less than 1% of the world’s population — [no more than 40 million people](https://www.statista.com/statistics/647374/worldwide-blockchain-wallet-users/) — have ever used Bitcoin.\"  \n\n&nbsp;\n\nJust imagine what the price would look like if only 5% of the world started to use bitcoin.  As usage of bitcoin grows we will all begin to truly free ourselves, not just in the third world, but in the first world too.  Fiat currency became obsolete as soon as bitcoin was invented.  The world just hasn't caught on yet to that reality. But it soon will. \n\n&nbsp;\n\n>According to Alejandro Machado, a cryptocurrency researcher at the [Open Money Initiative](https://www.openmoneyinitiative.org/), a wire transfer from the United States can now encounter a fee as high as 56% as it passes from dollars to bolivares in a process that can last several weeks.   \n>  \n>&nbsp;\n>  \n>To circumvent this bureaucracy, some Venezuelans have started to receive bitcoin from their relatives abroad. It’s now possible to send a text message to your family asking for bitcoin, and receive it minutes later for a tiny fee. Government censorship isn’t possible, as bitcoin isn’t routed through a bank or third party and instead arrives into your phone wallet in a peer-to-peer way. Then you can, moments later, sell your new bitcoin into fiat through a local [Craigslist-style exchange](https://localbitcoins.com/country/VE), or load it onto a flash drive (or even [memorize](https://bitzuma.com/posts/how-to-memorize-your-bitcoin-wallet-seed-in-three-days/) a recovery phrase) and escape Venezuela with complete control over your savings.   \n>  \n>&nbsp;  \n>  \n>Venezuela isn’t the only place where people can use Bitcoin as an escape valve. In Zimbabwe, Robert Mugabe printed endless amounts of cash and inflated the savings of his citizens into nothing, but his successors can’t print more bitcoin. In China, Xi Jinping can track all of your transactions on Alipay and WePay, but he cannot orchestrate mass surveillance on all Bitcoin payments. In Russia, Vladimir Putin can target an NGO and freeze its bank account, but he can’t freeze its Bitcoin wallet. \n\n&nbsp;\n\n[http://time.com/5486673/bitcoin-venezuela-authoritarian/](http://time.com/5486673/bitcoin-venezuela-authoritarian/)\n\n&nbsp;\n&nbsp;\n\n[\\- Hopium Time Archives -](https://www.reddit.com/r/Bitcoin/comments/8zqex8/hopium_time_and_my_bitcoin_bet/)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecprdmz": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecprdmz",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 02:27:07",
            "Upvotes": 7,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqgkit": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqgkit",
            "Author": "RulerZod",
            "Date Created": "12-28-2018 10:35:33",
            "Upvotes": 6,
            "Text": "So either we get pushed down to 2400 from the ema ribbon OR its a giant reverse head and shoulders and we go to 5400",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqgz61": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqgz61",
            "Author": "godlypiggy",
            "Date Created": "12-28-2018 10:40:34",
            "Upvotes": 5,
            "Text": " What’s go?? Pumping?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpsq60": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpsq60",
            "Author": "machine_elvesbitcoin",
            "Date Created": "12-28-2018 02:57:12",
            "Upvotes": 7,
            "Text": "Got some more, 2019 is going to be fun ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpqzhk": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpqzhk",
            "Author": "iphonexmas",
            "Date Created": "12-28-2018 02:18:35",
            "Upvotes": 12,
            "Text": "According to my TA charts, I predict that in 2019 the price will either go up or down. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqjcyr": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqjcyr",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-28-2018 11:10:15",
            "Upvotes": 9,
            "Text": "I just found out that *spending* BTC (on goods and services) has capital gains tax implications in the US.  How can anyone expect adoption [as a currency] to grow if users have to deal with capital gains taxes on every single transaction?  ",
            "Edited?": "12-28-2018 11:33:21",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr1blv": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecr1blv",
            "Author": "ihatemaps",
            "Date Created": "12-28-2018 14:37:39",
            "Upvotes": 6,
            "Text": "I was going to buy back in two hours ago but figured I'd wait until I got back from lunch. I'm also holding off since I assume this will be followed by a massive 10%+ dump. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpxcve": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpxcve",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 04:49:27",
            "Upvotes": 7,
            "Text": "So, what's happening with bakkt? Is that still due for an early 2019 working implementation? I keep hearing and reading different things about it. The continuing bear market doesn't have me phased at all and I'm continuing to accumulate on a weekly basis.\n\nIt's been funny following 4chan's /biz/ board during this bear market. Nothing but doom and gloom and then \"to the moon\" when there's the slightest hint of a percentage rise. Kind or reminds me of somewhere actually...\n\n&#x200B;\n\n2019 is going to be an interesting year. With some luck Bitcoin will actually become usable as a currency. I feel like Bitcoin might never make it though, and is simply in the same field of idealism that Linux has been in for a lifetime. \"Year of the Linux Desktop\" has been a theme for as long as I can remember, and I'd been involved in that seen for over ten years. Although I suppose \"Year of Linux\" did come in the end with Android and Chrome OS. Not how anyone originally envisioned or hoped for though.\n\nI have a feeling Bitcoin could be due for the same fate, and something like a \"Google Coin\" or \"Facebook Coin\" or Amazon, Apple, Microsoft \"Coin\" will reach a higher adoption than Bitcoin and warp the original vision for it. If Bitcoin scene has been any indicator, it is driven by greed more than by idealism.\n\n&#x200B;\n\nEither way, 2019 is going to be an interesting year. I still believe in the idealism behind it thanks to having read \"The Internet of Money\" by AA. But I don't know how likely it is that Bitcoin itself will be the success we want it to be. A blockchain based currency is inevitable, much the same way Cars replaced horses, the internet replaced the phone network, and electric lighting replaced gas lamps - But much like Edison won out over Nikola Tesla, Bitcoin could fail in a similarly spectacular fashion. It wouldn't surprise me one bit.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqgpui": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqgpui",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 10:37:25",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqgwux": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqgwux",
            "Author": "antikama",
            "Date Created": "12-28-2018 10:39:46",
            "Upvotes": 2,
            "Text": "that was fun",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqh42o": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqh42o",
            "Author": "ColonelEngel",
            "Date Created": "12-28-2018 10:42:18",
            "Upvotes": 2,
            "Text": "what was that?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqudpq": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqudpq",
            "Author": "samdg222",
            "Date Created": "12-28-2018 13:23:38",
            "Upvotes": 2,
            "Text": "Woooooooooooooooo, 2 tha  🌙",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq76bu": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecq76bu",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 08:34:42",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs74dg": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecs74dg",
            "Author": "xyloph123",
            "Date Created": "12-28-2018 23:46:39",
            "Upvotes": 1,
            "Text": "\\[First time poster so please direct me to a more appropriate thread if applicable, thanks!\\]\n\nI was hoping to get feedback on a crypto/bitcoin use case in the credit card referral space. Credit card referrals can offer significant value to the tune of $100 to upwards of $5000 a year. However, most people rarely accrue the full value of their own referral links. Two of the factors that prevent people from actively using referral links:\n\n1. A community to find referral links from?\n2. Incentive for using a referral link over a public link?\n\n1) is somewhat solved from the many travel communities and blogs available online. A compelling reason for 2 ) is if two parties can mutually agree to use each other's referral links. This does happen online today, however, it is adhoc and the parties can't **trust** each other to follow through on this.\n\nIf there was a way for the two parties to stake their personal money as a guarantee that they will indeed follow through on the referral usage, both parties stand to gain. More formally, say A and B match such that\n\n\\- A agrees to use B's referral link and vice-versa\n\n\\- both move x tokens to a common address\n\n\\- both follow through on their promise\n\n\\- both are satisfied with the other's action (A and B get their referral bonuses)\n\n\\- both get x back to their accounts\n\n\\[There are some edge cases here that I glossed over\\]\n\n&#x200B;\n\nIs this something that makes sense / the right use case for crypto / already being worked on? Where (not partial to any crypto / platform) would you suggest I look next if I wanted to prototype something like this?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecsejrb": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecsejrb",
            "Author": "CrypticallyDodge",
            "Date Created": "12-29-2018 01:58:40",
            "Upvotes": 1,
            "Text": "So enlightening going back to old reddit posts around ATL and ATH and reading people’s comments and predictions.\n\nOne thing to bear in mind (no pun intended) is that the people nay saying and pointing out logical reasons that the price “can’t” move in a certain direction are wrong time and time again. \n\nIt’s not that their arguments don’t make sense, it’s the following price movement that doesn’t without hindsight. \n\nJust remember this next time someone here is talking in absolutes about the future of BTC",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "egn6s58": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "egn6s58",
            "Author": "machine_elvesbitcoin",
            "Date Created": "02-16-2019 23:43:48",
            "Upvotes": 1,
            "Text": "She’s getting there. Patients master ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpsgza": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpsgza",
            "Author": "SuperPwnerGuy",
            "Date Created": "12-28-2018 02:51:38",
            "Upvotes": 3,
            "Text": "Buy, Don't just Hodl.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpt00s": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecpt00s",
            "Author": "Weecoinofficial",
            "Date Created": "12-28-2018 03:03:14",
            "Upvotes": 0,
            "Text": "Any possibility for other coins to surpass Bitcoin at price in the future? Why?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrzo4c": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrzo4c",
            "Author": "tommygunz007",
            "Date Created": "12-28-2018 21:54:45",
            "Upvotes": 1,
            "Text": "Not trying to shit post, but I still haven't heard a good reason for WHY, right now, instead of paying for things with my Citibank™ DoubleCash card, I should instead convert my fiat to bitcoin to buy the exact same thing. \n\nNow, when I say good reason, I am not talking about 'freeing our society from the clutches of evil banks or governments'. Instead, I am looking for a solid reason why the average unintelligent human being would actively setting up a bitcoin account to buy the same thing they are already buying? And no, that one guy who buys 3D printers from AliBaba who can't use paypal doesn't count. I am talking about the masses. There just doesn't seem to be a solid reason to buy things with bitcoin when you can buy the same things with fiat. (Again I am not talking about the white papers, long term benefits against inflation; I am talking about the average mom and pop in Milwaukee: what's in it for them?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrnnm7": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrnnm7",
            "Author": "bitfeng",
            "Date Created": "12-28-2018 18:59:26",
            "Upvotes": 1,
            "Text": "Hey guys! Some questions over here;\n\n\nWhat happens when we reach at those network transactions levels in the future  like MasterCard & Visa if Bitcoin is meant to be a payment tool?\n\nCurrently, it cannot be on the same level as those above, what's your opinions on this one?\n\nIs Bitcoin going to a be \"store of value\" \nOr just an alternative payment money?\n\nAnd the block confirmation time, if we are going to pay for a dish at an restaurant, you're like sitting there and waiting for confirmation for over a few minutes, that's not a good idea..\nYeah; I have heard about the LN, those channels which is needed to accept or receive bitcoins on LN... They are very complicated.... Or????\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqzw91": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecqzw91",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 14:23:21",
            "Upvotes": 0,
            "Text": "Yeah there’s no chance what’s been going on isn’t manipulation by big whales. Not touching this with a 10 foot pole for a while. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrhytf": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrhytf",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 17:45:03",
            "Upvotes": -1,
            "Text": "I still make bank. Do you?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr37ii": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecr37ii",
            "Author": "RulerZod",
            "Date Created": "12-28-2018 14:57:09",
            "Upvotes": -3,
            "Text": "We need to go down. Quit fighting it. We are being bled slow on purpose.  \n\nThe quicker we go down. The faster the bounce. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrdez4": [
        {
            "Parent ID": "t3_aa803q",
            "Comment ID": "ecrdez4",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 16:47:17",
            "Upvotes": -10,
            "Text": "Thank you for the pump. Now I can dump.\nYou stupid morons.\n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrcvry": [
        {
            "Parent ID": "t1_ecrccvk",
            "Comment ID": "ecrcvry",
            "Author": "gammabum",
            "Date Created": "12-28-2018 16:40:52",
            "Upvotes": 3,
            "Text": "East Coast is in; one last pump/short cycle before EOD, on the last Fri. of the year.  I'll be selling it back to them at $9k next week.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrnnrs": [
        {
            "Parent ID": "t1_ecrccvk",
            "Comment ID": "ecrnnrs",
            "Author": "The-Physicist",
            "Date Created": "12-28-2018 18:59:30",
            "Upvotes": 3,
            "Text": "Ask for it properly ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrsin4": [
        {
            "Parent ID": "t1_ecrccvk",
            "Comment ID": "ecrsin4",
            "Author": "4coiner",
            "Date Created": "12-28-2018 20:07:29",
            "Upvotes": 1,
            "Text": "we will see $4500 in the next 6 hrs or less",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqq0gt": [
        {
            "Parent ID": "t1_ecqi6dj",
            "Comment ID": "ecqq0gt",
            "Author": "click_again",
            "Date Created": "12-28-2018 12:29:50",
            "Upvotes": 5,
            "Text": "You earn fee(s) by routing payment(s) in LN. You can set the fee to be high or low but the main objective of running LN is not for earning fee. It's for you to create/receive payments while minimizing on-chain transaction fees and wait time.\nThe fees that you set to charge is independent to the available balance of your channel. Although it's quite unlikely to make profit by routing payments in LN, it is not entirely impossible. If you have free electricty and free internet, then there will be profit, although a razor thin one (roughly 1-2 sat per payment routed)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr0aj2": [
        {
            "Parent ID": "t1_ecqi6dj",
            "Comment ID": "ecr0aj2",
            "Author": "my2sats",
            "Date Created": "12-28-2018 14:27:15",
            "Upvotes": 3,
            "Text": "!lntip 42",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrvfyk": [
        {
            "Parent ID": "t1_ecrmdv1",
            "Comment ID": "ecrvfyk",
            "Author": "Chroko",
            "Date Created": "12-28-2018 20:50:56",
            "Upvotes": 1,
            "Text": "> Fiat currency became obsolete as soon as bitcoin was invented\n\nYour post had a lot of really good points, but then you go and say silly things like this that are a discredit to the entire Bitcoin community.\n\nIt's not possible for an economy to function using Bitcoin, just as the gold standard was completely infeasible. Fiat is absolutely 100% necessary to produce a functioning economy and society - but Bitcoin can live quite happily in perpetuity as a cherry on top (alongside gold and other stores of value / investment products.)\n\nIn B4 whining about corrupt banks: the problem society has is with corruption, not that central banks and fiat currency exist. Central banks and fiat currency are a vital part of a healthy economy that stops you from starving to death. Bitcoin alone can't save Venezuela, but it can help relieve the symptoms for some until it recovers.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpwx24": [
        {
            "Parent ID": "t1_ecprdmz",
            "Comment ID": "ecpwx24",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 04:38:34",
            "Upvotes": 4,
            "Text": "$600 a week if I include Alts. $300 per week into Bitcoin. $300 into Alts. I've essentially turned Cryptocurrency into my main saving account. Although it's annoying because I hardly buy anything with it. Most I spend on goods with Cryptocurrencies is maybe around $200 a year. So it's basically just a store of value for me at this stage. Wish I could buy groceries and fast food with it.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecprvnl": [
        {
            "Parent ID": "t1_ecprdmz",
            "Comment ID": "ecprvnl",
            "Author": "vickar12",
            "Date Created": "12-28-2018 02:38:30",
            "Upvotes": -1,
            "Text": "Zero. I went in november 2017. Took out everything I invested 2 months later. And I only have profits left.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqhpr3": [
        {
            "Parent ID": "t1_ecqgkit",
            "Comment ID": "ecqhpr3",
            "Author": "tarzanboyo",
            "Date Created": "12-28-2018 10:49:53",
            "Upvotes": -1,
            "Text": "I think so, its now back to what its been roughly at for the past week ish so that would make sense....hopefully it rises a bit more though to get some encouragement back for backers.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqin2x": [
        {
            "Parent ID": "t1_ecqgz61",
            "Comment ID": "ecqin2x",
            "Author": "bennidez",
            "Date Created": "12-28-2018 11:01:43",
            "Upvotes": 1,
            "Text": "most likely",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqzym1": [
        {
            "Parent ID": "t1_ecpsq60",
            "Comment ID": "ecqzym1",
            "Author": "lagwagon211",
            "Date Created": "12-28-2018 14:23:59",
            "Upvotes": 2,
            "Text": "Sold some, rebought yikes",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqqe45": [
        {
            "Parent ID": "t1_ecpqzhk",
            "Comment ID": "ecqqe45",
            "Author": "time_wasted504",
            "Date Created": "12-28-2018 12:34:43",
            "Upvotes": 2,
            "Text": "possibly sideways",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecps1y6": [
        {
            "Parent ID": "t1_ecpqzhk",
            "Comment ID": "ecps1y6",
            "Author": "FortuitousIdiom",
            "Date Created": "12-28-2018 02:42:22",
            "Upvotes": 5,
            "Text": " Says every TA ever. I've been watching quite a few TAs on YT lately to get a general feel for that community. Bitcoin-Fund-Manager is straight up the worst and a known fraud. CryptoKirby is probably a close second but is really good at marketing himself, uses some NLP, and convinces men that he's not losing money and can teach them to be just like him for the low, low price of 0.5 BTC per month. SunnyDecree isnt bad, but his...enthusiasm is sometimes too much for me.\n\nI kind of like Carl from The Moon, his is the only channel that has the bell clicked; he seems to be right more often than not but when he's wrong it's because he loves BTC and wants to see it go to the moon. He's probably the only YTer I've heard say, \"I was wrong.\" Relatively balanced and entertaining.\n\nThat said, I still think TA is some form of voodoo magic. 😋",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqqiji": [
        {
            "Parent ID": "t1_ecqjcyr",
            "Comment ID": "ecqqiji",
            "Author": "againstmethod",
            "Date Created": "12-28-2018 12:36:19",
            "Upvotes": 6,
            "Text": "No one expects that in reality.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqmicf": [
        {
            "Parent ID": "t1_ecqjcyr",
            "Comment ID": "ecqmicf",
            "Author": "CrapCloud",
            "Date Created": "12-28-2018 11:47:06",
            "Upvotes": 6,
            "Text": "It's a good thing Bitcoin is a global phenomenon and if the laws aren't favorable for Bitcoin users in the US they have the option to go elsewhere. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqm0f0": [
        {
            "Parent ID": "t1_ecqjcyr",
            "Comment ID": "ecqm0f0",
            "Author": "AlternativeGazelle",
            "Date Created": "12-28-2018 11:41:12",
            "Upvotes": 2,
            "Text": "Good point.  There was a bill introduced last week that proposed a $600 de minimis exemption, so if passed you could buy items for under $600 free of capital gains tax.  However you would still need to track your basis for times when you do have a taxable event.\n\nI don't know if there is any good software out there to help you track everything, but if not there's a good opportunity for developers.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr15c3": [
        {
            "Parent ID": "t1_ecqjcyr",
            "Comment ID": "ecr15c3",
            "Author": "skaska23",
            "Date Created": "12-28-2018 14:35:53",
            "Upvotes": 4,
            "Text": "If you use it as a currency and you will insist that btc is foreign currency, you will get away with that. Do you need to pay capital gains if you as an american buy a car for euros? No... ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqm09t": [
        {
            "Parent ID": "t1_ecqjcyr",
            "Comment ID": "ecqm09t",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 11:41:09",
            "Upvotes": 1,
            "Text": "https://cointelegraph.com/news/crypto-assets-to-be-regulated-differently-in-the-us-potential-impact-on-industry",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqf6h0": [
        {
            "Parent ID": "t1_ecpxcve",
            "Comment ID": "ecqf6h0",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 10:17:50",
            "Upvotes": 13,
            "Text": "This is not even in the same ballpark. Bitcoin is a hybrid entity as a currency, asset and store of value. It's decentralized and global. It's already the center of an entire crypto ecosystem. Any centralized Google coin or Amazon coin could never possibly replace bitcoin because it can't fulfill the same functionality and would be owned and controlled by a corporation. It's not in any way the same entity. Even entertaining this thinking would be impossible.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq7456": [
        {
            "Parent ID": "t1_ecpxcve",
            "Comment ID": "ecq7456",
            "Author": "aaj094",
            "Date Created": "12-28-2018 08:33:40",
            "Upvotes": 4,
            "Text": "How on earth is it even remotely possible that a coin launched by a centralised private firm displaces a coin which gained value in the first place due to being scarce (fixed supply) and most importantly immutable and decentralised? Without the latter qualities, it is ludicrous to think that some FB coin or Gcoin or Amazoncoin has any chance to displace bitcoin. Plus it is impossible for a coin launched by these entities to have these qualities. \n\nThe situation is simply not analogous to Facebook replacing myspace or similar other cases. Those were services being replaced by other services. Bitcoin is not just a service. It has value due to other unique qualities and not just for being a service.\n\nNow you tell me how a decentralised immutable new coin springs into existence and displaces Bitcoin? Who develops this new protocol (without being a fork of current bitcoin)? And how are these new coins issued to the public (if not a fork of Bitcoin). Remember that if this is a fork of Bitcoin then bitcoin remains valuable.",
            "Edited?": "12-28-2018 09:40:28",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq1opa": [
        {
            "Parent ID": "t1_ecpxcve",
            "Comment ID": "ecq1opa",
            "Author": "four_play",
            "Date Created": "12-28-2018 06:56:21",
            "Upvotes": 2,
            "Text": "Google coin to bitcoin could be like what google+ was to facebook",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq1kju": [
        {
            "Parent ID": "t1_ecpxcve",
            "Comment ID": "ecq1kju",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 06:53:42",
            "Upvotes": 2,
            "Text": "imagine siting on a high horse, laughing at everybody, being involved in \"Linux\" for 10 years and still calling it \"Linux\".\n\n> \"Facebook Coin\" or Amazon, Apple, Microsoft \"Coin\" will reach a higher adoption than Bitcoin and warp the original vision for it. \n\nnormally I don't care about rando's opinion, but the bullshit you are paddling is quite disrespectful to all the people contributing to the protocol. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqrer7": [
        {
            "Parent ID": "t1_ecpxcve",
            "Comment ID": "ecqrer7",
            "Author": "Reddband678",
            "Date Created": "12-28-2018 12:47:40",
            "Upvotes": 1,
            "Text": "Any big company could replace btc in just a fraction of a second with a new coin, especially now that the btc hype is gone and it doesn't bring much use except from pointless speculation. People are sheeps. They don't care about btc, they want to earn money. Problem is, big companies don't care about crypto cause it doesn't bring them anything.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqgzrq": [
        {
            "Parent ID": "t1_ecqgpui",
            "Comment ID": "ecqgzrq",
            "Author": "RulerZod",
            "Date Created": "12-28-2018 10:40:47",
            "Upvotes": 1,
            "Text": "Swift rejection by the bears at 3850 after a 200 price rally in seconds.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqim9a": [
        {
            "Parent ID": "t1_ecq76bu",
            "Comment ID": "ecqim9a",
            "Author": "Kanye_B_redpillin",
            "Date Created": "12-28-2018 11:01:25",
            "Upvotes": 2,
            "Text": "Looks like you fell asleep. Thanks. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpskqx": [
        {
            "Parent ID": "t1_ecpsgza",
            "Comment ID": "ecpskqx",
            "Author": "iphonexmas",
            "Date Created": "12-28-2018 02:53:56",
            "Upvotes": 2,
            "Text": "I buy biweekly regardless of price",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq9r79": [
        {
            "Parent ID": "t1_ecpt00s",
            "Comment ID": "ecq9r79",
            "Author": "1561KWP",
            "Date Created": "12-28-2018 09:11:43",
            "Upvotes": 3,
            "Text": "Btc is > than 50% of the total market.  So ALL +1,500 crypto's put together still aren't worth as much Btc.  (Look at the total value - not just the value of one coin).",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpu16v": [
        {
            "Parent ID": "t1_ecpt00s",
            "Comment ID": "ecpu16v",
            "Author": "deadleg22",
            "Date Created": "12-28-2018 03:26:40",
            "Upvotes": 6,
            "Text": "No, is there any reason to think so?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq1xu1": [
        {
            "Parent ID": "t1_ecpt00s",
            "Comment ID": "ecq1xu1",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 07:01:31",
            "Upvotes": -1,
            "Text": "absolutely. There already are more expensive coins than bitcoin and existed for quite some time. (the reason most people don't know shows how little that means).  \n\n\nnow check out Bitcoin's GitHub and learn a little on how is all of the development governed and managed. Can other coin do the same? absolutely, but not with the same people.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs1891": [
        {
            "Parent ID": "t1_ecrzo4c",
            "Comment ID": "ecs1891",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 22:18:25",
            "Upvotes": 3,
            "Text": ">the average mom and pop in Milwaukee\n\nCurrently, there's nothing in it for them in terms of instant gratification. Once you can clearly see what's in it for them, it will be far too late to take advantage of the potential opportunity of accumulating any amount of bitcoin. The whole point of holding on to any amount of bitcoin is that you hope it increases in value with future increased adoption of use or use as a store of value. Otherwise people would be spending it and not holding it.  \nOnce enough people own it, exchanging it as a currency will make far more sense.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs8kdv": [
        {
            "Parent ID": "t1_ecrzo4c",
            "Comment ID": "ecs8kdv",
            "Author": "Jyontaitaa",
            "Date Created": "12-29-2018 00:08:43",
            "Upvotes": 2,
            "Text": "Right now you are in the 1% globally and have access to everything you could possibly require. It’s the 99% that need bitcoin. One day that 99% will only accept bitcoin and then you will need it to transact with them.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs10tf": [
        {
            "Parent ID": "t1_ecrzo4c",
            "Comment ID": "ecs10tf",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 22:15:18",
            "Upvotes": 1,
            "Text": "[deleted]",
            "Edited?": "12-28-2018 22:21:36",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs1zw0": [
        {
            "Parent ID": "t1_ecrzo4c",
            "Comment ID": "ecs1zw0",
            "Author": "Hellwiss",
            "Date Created": "12-28-2018 22:29:58",
            "Upvotes": 1,
            "Text": "Great thing in my eyes is its trustlessness. You dont have to trust 3rd party (shop, internet service, uber? - I hope in future maybe) to give them your card info and be hoping they won't misuse it, or they can get hacked and again, it will be used in bad way. It happened to me once and now I really dont like to give this info to any shop. With btc, you dont have to be worry, worst case scenario is loosing that one payment, no info to take advantage of.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecscvec": [
        {
            "Parent ID": "t1_ecrzo4c",
            "Comment ID": "ecscvec",
            "Author": "gretteaj",
            "Date Created": "12-29-2018 01:23:06",
            "Upvotes": 1,
            "Text": "There isn't a good reason to make most purchases with bitcoin over your credit card. Right now. This is why a majority of bitcoin talk is still related to price instead of usability. It's obviously still a speculative investment. Oddly enough, I would like more purchasing options to be in bitcoin because most of my earnings come in fairly illegal ways through crypto. So it's actually more unsafe for me to cash through my exchange for purchases and have to possibly explain that to banks/governments. But I am aware I am a very small minority.\n\nRight now nobody is buying bitcoin so they can buy a sandwich with it. They are buying it as a hedge against inflation in the coming decades, as a hedge against a possible future of corrupt and tyrannical government, and as a belief that this system will eventually develop into a more accepted and practical use of transferring wealth across the globe without an intermediary. It is up to you to decided if any of these other reasons are valid for you to buy right now. But yes, if you don't do anything shady or illegal, there is no reason for you to use it. That's why almost nobody does.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrvxmg": [
        {
            "Parent ID": "t1_ecrnnm7",
            "Comment ID": "ecrvxmg",
            "Author": "xanmoth",
            "Date Created": "12-28-2018 20:58:11",
            "Upvotes": 3,
            "Text": "It's a payment tool.  It takes three days to send an ACH transfer.  Bitcoin is a lot faster and does the same thing for large amounts of money.  For small transactions it's what you said, a second layer like Lightning and Liquid.  We just need some killer apps to make it less complicated.\n\nI also had a bit of an interesting realization at the liquer store tonight related to this.  I go there on weekends and the guy knows me.  I always use Samsung Pay on my phone which he remembers so as soon as the machine says approved he says thanks.  I'm supposed to stand there while it prints the receipt and then sign it and then wait for my receipt.  What's to say we just see the Bitcoin transaction appear which take seconds like my Visa and he says thanks.\n\nIt's just an interesting use-case for an on-chain  transaction in the real world.  I also have a funded Eclair wallet on the same phone with a lightning channel open that is what I'd really like to use in that situation.  But like you said, too complicated at the moment.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecru9g5": [
        {
            "Parent ID": "t1_ecrnnm7",
            "Comment ID": "ecru9g5",
            "Author": "Chroko",
            "Date Created": "12-28-2018 20:33:09",
            "Upvotes": 2,
            "Text": "It's not possible for a modern economy to work entirely with Bitcoin, in the same way that gold was unsuitable to price a vast economy that generates value. It also can't can't ever replace bank accounts and credit cards. But it can be analogous to pre-paid debit cards and small stores of precious metals.\n\nSome of the barriers are that Bitcoin accounts can't be frozen, transactions can't be forcibly undone, payments can't be initiated by the recipient and keys can't be changed. These are unique advantages of Bitcoin, but it's incredibly useful to have those tools as a banking customers. You can freeze your account if your debit card is stolen; undo a transaction if a shady retailer scams you - and make recurring monthly automatic payments for your bills.\n\nBitcoin does some things well, a lot of things badly - and because nobody's really in charge, a lot of the problems are going unfixed. It needs a centralized brand / app that people can easily understand. Only 5000 people have installed the Lightning Network phone app, the \"hack a node together yourself\" approach feels a lot like early Linux adoption (where Linux basically stayed on the sidelines except in variants like Android.)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrju68": [
        {
            "Parent ID": "t1_ecqzw91",
            "Comment ID": "ecrju68",
            "Author": "55555",
            "Date Created": "12-28-2018 18:08:51",
            "Upvotes": 5,
            "Text": "Manipulation? You mean trading I guess. Traders make moves to try to influence the market. Thats like, their job. Manipulation would me working with the btc core devs to hatch a scheme to increase the 21 million limit at a set time in the future.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr0x2z": [
        {
            "Parent ID": "t1_ecqzw91",
            "Comment ID": "ecr0x2z",
            "Author": "OrganicDroid",
            "Date Created": "12-28-2018 14:33:36",
            "Upvotes": 2,
            "Text": "I was going to buy in last night, didn’t - and this thought is in the back of my mind... I may wait and see what it is at when I go to bed before buying in. Or regret it, I don’t know.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrix1r": [
        {
            "Parent ID": "t1_ecrhytf",
            "Comment ID": "ecrix1r",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 17:56:58",
            "Upvotes": 3,
            "Text": "I am the bank. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrniol": [
        {
            "Parent ID": "t1_ecrhytf",
            "Comment ID": "ecrniol",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 18:57:35",
            "Upvotes": 1,
            "Text": "Whatever helps you sleep at night. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrjafj": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrjafj",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 18:01:47",
            "Upvotes": 8,
            "Text": "yall been saying that since it was 20k LMAO\n\n\"We need to bleed fast to 17000 so we can bounce boys\"\n\"We gotta bleed to 10000 in order to bounce..\"\n\"5000 is the absolute bottom it wont go up once it hits that\" \n\nfuck off already",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrf71c": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrf71c",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 17:08:57",
            "Upvotes": 2,
            "Text": "Whose fighting it, and what are they fighting?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrcafp": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrcafp",
            "Author": "asderasder333",
            "Date Created": "12-28-2018 16:33:30",
            "Upvotes": 2,
            "Text": "everybody wishes for some magical price lowering and then pump. you cant have both.\n\nyou want to prices go down? then they stay down, and you start crying again you lil pussy.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrce9c": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrce9c",
            "Author": "The-Physicist",
            "Date Created": "12-28-2018 16:34:47",
            "Upvotes": 1,
            "Text": "I didn’t drop a huge wad of cash (to me anyway) to buy more last week to see it go down bro. \n\nI’d like to see us get back above cost of mining soooon. Having more miners mining is a good thing for bitcoin. ",
            "Edited?": "12-28-2018 16:37:55",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrqsdy": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrqsdy",
            "Author": "Aikec",
            "Date Created": "12-28-2018 19:42:39",
            "Upvotes": 1,
            "Text": "There needs to be infrastructure built, people need to know what bitcoin could be used for... We need to share the news to make more people know the true value of cryptocurrencies. I heard there will be a big Bitcoin shopping center in Europe soon (BTC city) - stuff like that",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrisv1": [
        {
            "Parent ID": "t1_ecr37ii",
            "Comment ID": "ecrisv1",
            "Author": "Ocean756",
            "Date Created": "12-28-2018 17:55:27",
            "Upvotes": 0,
            "Text": "No. 4500 and than go down.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrf0a2": [
        {
            "Parent ID": "t1_ecrdez4",
            "Comment ID": "ecrf0a2",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 17:06:38",
            "Upvotes": 5,
            "Text": "I highly doubt the amount you're dumping will make \"them\", whoever you're referring to, feel stupid.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrf2w0": [
        {
            "Parent ID": "t1_ecrdez4",
            "Comment ID": "ecrf2w0",
            "Author": "Davidbcbc",
            "Date Created": "12-28-2018 17:07:30",
            "Upvotes": 6,
            "Text": "Selling cheap eh? ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecreltz": [
        {
            "Parent ID": "t1_ecrdez4",
            "Comment ID": "ecreltz",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 17:01:42",
            "Upvotes": 4,
            "Text": "Go back to the porn subs.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecro33f": [
        {
            "Parent ID": "t1_ecrnnrs",
            "Comment ID": "ecro33f",
            "Author": "BitcoinAlways",
            "Date Created": "12-28-2018 19:05:17",
            "Upvotes": 6,
            "Text": " Can we have some proper bull action for a change please :) ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr0cgn": [
        {
            "Parent ID": "t1_ecr0aj2",
            "Comment ID": "ecr0cgn",
            "Author": "lntipbot",
            "Date Created": "12-28-2018 14:27:48",
            "Upvotes": 3,
            "Text": "Hi u/my2sats, thanks for tipping u/synapticwave **42** satoshis!\n***\n*[^(More info)](https://www.reddit.com/r/lntipbot/wiki/index) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrx0a7": [
        {
            "Parent ID": "t1_ecrvfyk",
            "Comment ID": "ecrx0a7",
            "Author": "The-Physicist",
            "Date Created": "12-28-2018 21:14:33",
            "Upvotes": 1,
            "Text": "I don’t see why it can’t eventually graduate beyond just being a store of value and replace fiat entirely.  It’s infinitely easier to transact in bitcoin than it ever was in gold. That’s why, in time, bitcoin can become a usable currency.  It has to stabilize first though. We will need to ride the rollercoaster many times more before that happens. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpxzq5": [
        {
            "Parent ID": "t1_ecpwx24",
            "Comment ID": "ecpxzq5",
            "Author": "chumpchange72",
            "Date Created": "12-28-2018 05:06:06",
            "Upvotes": 7,
            "Text": "You really shouldn't have something as volatile as cryptocurrency as you main savings. What's your plan if you fall ill and can't work for months at the same time as bitcoin has one of its -90% crashes?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq6erg": [
        {
            "Parent ID": "t1_ecpwx24",
            "Comment ID": "ecq6erg",
            "Author": "CoinedPrince",
            "Date Created": "12-28-2018 08:21:57",
            "Upvotes": 1,
            "Text": "Same.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecps16w": [
        {
            "Parent ID": "t1_ecprvnl",
            "Comment ID": "ecps16w",
            "Author": "iphonexmas",
            "Date Created": "12-28-2018 02:41:54",
            "Upvotes": 3,
            "Text": "^ Found the person who sold the top!! ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpy1cc": [
        {
            "Parent ID": "t1_ecps1y6",
            "Comment ID": "ecpy1cc",
            "Author": "BonanzaKreep",
            "Date Created": "12-28-2018 05:07:26",
            "Upvotes": 1,
            "Text": "That seems to be the case for a lot of those \"analysts\" (especially on Youtube), but there are some better examples among more experienced traders. Like Peter Brandt, who correctly predicted the size of the 2018 fall back in January based on the BTC price chart. Maybe the trick is to combine charts with common sense and personal experience, rather than just trying to dazzle followers. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq6i7l": [
        {
            "Parent ID": "t1_ecps1y6",
            "Comment ID": "ecq6i7l",
            "Author": "CoinedPrince",
            "Date Created": "12-28-2018 08:23:37",
            "Upvotes": 1,
            "Text": "Don't forget Tone Vays for TA.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrch53": [
        {
            "Parent ID": "t1_ecqmicf",
            "Comment ID": "ecrch53",
            "Author": "asderasder333",
            "Date Created": "12-28-2018 16:35:48",
            "Upvotes": 2,
            "Text": "acutally americans are more like prisoners, you cant just move to another country and start over. you are american, no matter where you are, you going to pay to us government.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqneic": [
        {
            "Parent ID": "t1_ecqmicf",
            "Comment ID": "ecqneic",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-28-2018 11:57:43",
            "Upvotes": 1,
            "Text": "US citizens don't really have that option, not legally anyway. \n \nAnd if you're HODLing for mewn do you really want to casually write off one of the largest markets in the world?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqpjga": [
        {
            "Parent ID": "t1_ecqm0f0",
            "Comment ID": "ecqpjga",
            "Author": "tbonecollion",
            "Date Created": "12-28-2018 12:23:55",
            "Upvotes": 3,
            "Text": "Cointracking.com is awesome. I used it to file my taxes last year.it tracks buys and sells gains and loses. It cost 170 a year for the unlimited version. Then you can print the information and take it to the tax man. But it save time.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr9qly": [
        {
            "Parent ID": "t1_ecr15c3",
            "Comment ID": "ecr9qly",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-28-2018 16:03:47",
            "Upvotes": 7,
            "Text": "You are quite wrong.  The US treats BTC as an asset and not a currency. You can “insist” all you want but that won’t help you when the tax man comes calling you.  Maybe you would be able to hide it and get away with it but I thought BTC was supposed to have a use for non-criminal actions.  If you buy a car for euros *and then sell it for a profit* there’s a good chance you will need pay a capital gains tax.  ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs46ol": [
        {
            "Parent ID": "t1_ecq7456",
            "Comment ID": "ecs46ol",
            "Author": "xtal_00",
            "Date Created": "12-28-2018 23:02:32",
            "Upvotes": 1,
            "Text": "Even Google can’t touch the unfarhomable hash power of the BTC blockchain. That’s what gives bitcoin the power. Don’t worry until that changes.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqa2tc": [
        {
            "Parent ID": "t1_ecq1opa",
            "Comment ID": "ecqa2tc",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 09:15:52",
            "Upvotes": 2,
            "Text": "Why do you think this? If Google launched a currency, and advertised it from their home page in a similar manner to Google Chrome it could and likely would reach hundreds of millions of people in the space of a week. If they launched it with all the great infrastructure in place for it to be a great currency, with many of the features and potential features being tested and theorized about cryptocurrency - what would prevent it from succeeding?\n\nI remember when IE and Firefox had the majority of the browser share and google Chrome didn't even exist. Today it has about 65% of the market. I don't doubt that a company with this kind of leverage could disrupt the market in such a way that Bitcoin could become potentially worthless. I'm genuinely interested in your opinion and why you think a \"Google Coin\" or something along those lines would be as spectacular a failure as Google+.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq9ho4": [
        {
            "Parent ID": "t1_ecq1opa",
            "Comment ID": "ecq9ho4",
            "Author": "1561KWP",
            "Date Created": "12-28-2018 09:08:22",
            "Upvotes": 1,
            "Text": "I still can't get a straight answer to which is better: FB or G+?  (probably subjective)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq7o7p": [
        {
            "Parent ID": "t1_ecq1kju",
            "Comment ID": "ecq7o7p",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 08:42:44",
            "Upvotes": 2,
            "Text": "\\>  the bullshit you are paddling is quite disrespectful to all the people contributing to the protocol. \n\nWhat bullshit? And how? It's just my opinion. You seem overly emotional about this. I'm not intending any disrespect and it only indicates some preconceived hostility on your part that you construed such an interpretation.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq6gcl": [
        {
            "Parent ID": "t1_ecpskqx",
            "Comment ID": "ecq6gcl",
            "Author": "cryptogrip",
            "Date Created": "12-28-2018 08:22:43",
            "Upvotes": 1,
            "Text": "Smart man. This is the best way hands down to recognize gains sooner.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecuhg3n": [
        {
            "Parent ID": "t1_ecs1891",
            "Comment ID": "ecuhg3n",
            "Author": "tommygunz007",
            "Date Created": "12-29-2018 21:59:44",
            "Upvotes": 1,
            "Text": "so, you are saying hold forever, and then you say spend forever?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs2erc": [
        {
            "Parent ID": "t1_ecs10tf",
            "Comment ID": "ecs2erc",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 22:35:54",
            "Upvotes": 2,
            "Text": "[deleted]",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecuhcjr": [
        {
            "Parent ID": "t1_ecscvec",
            "Comment ID": "ecuhcjr",
            "Author": "tommygunz007",
            "Date Created": "12-29-2018 21:58:24",
            "Upvotes": 1,
            "Text": "Your answer is the reason I come to the forum here. Someone who is actually honest that there is about 1% of the world who have a need for bitcoin, and the other 99% don't - yet. By the time we do have a need, the technology will change enough to where Bitcoin will be the MySpace of the day.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs0hdo": [
        {
            "Parent ID": "t1_ecrvxmg",
            "Comment ID": "ecs0hdo",
            "Author": "my2sats",
            "Date Created": "12-28-2018 22:07:07",
            "Upvotes": 1,
            "Text": "!lntip 42",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecsp2pt": [
        {
            "Parent ID": "t1_ecrvxmg",
            "Comment ID": "ecsp2pt",
            "Author": "bitfeng",
            "Date Created": "12-29-2018 05:46:41",
            "Upvotes": 1,
            "Text": "Thanks friend! Great reply! Bless you",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrqb41": [
        {
            "Parent ID": "t1_ecro33f",
            "Comment ID": "ecrqb41",
            "Author": "The-Physicist",
            "Date Created": "12-28-2018 19:35:48",
            "Upvotes": 4,
            "Text": "Was looking for a “comon’ ...”",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs32zm": [
        {
            "Parent ID": "t1_ecrx0a7",
            "Comment ID": "ecs32zm",
            "Author": "Chroko",
            "Date Created": "12-28-2018 22:45:48",
            "Upvotes": 1,
            "Text": "Bitcoin can't replace fiat because Bitcoin is finite and can't map to real-world wealth. You're missing out on the entire history of money by not understanding this.\n\nThe problem with gold was not ease of transactions, it was that gold was unevenly distributed around the world, was barely adequate for a feudal bargaining economy - and is a paradox: if gold was its own currency, how would miners price and sell gold when it is priced in... itself? If you were an old-timey gold miner, unless you were giving it away - you would need to sell it. So your wealth is going to be in something else, like camels or land. It's the same deal with Bitcoin.\n\nOr another example: imagine one village owns and uses all 21 million Bitcoin as currency. Some children of the village leave and start an identical village across the river but they use banana leaves as currency. Many years later (when populations have stabilized), both villages decide to start trading with each other and standardize on a currency. The bread sold in banana leaves is just as nutritious and valuable as the bread sold in Bitcoin, but what's the combined value of the new economy with two identical villages? It should be 42 million Bitcoin, but that's impossible.\n\nBitcoin enthusiasts like to angrily judge governments for printing money, but generating new money as society grows is the engine of wealth creation and is essential for a healthy economy.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpy5kd": [
        {
            "Parent ID": "t1_ecpxzq5",
            "Comment ID": "ecpy5kd",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 05:11:04",
            "Upvotes": 0,
            "Text": "If I get so ill that I can't work I'm screwed with or without my savings. But I suppose if such a scenario or similar happened I would have to get on social welfare for a start, sell my car, probably sell a few other belongings. I could get by for about six months that way.\n\nIf somehow I was still too sick to work after six months? Then I'm probably dying anyway and wouldn't worry about it. ;\\_;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq9hkv": [
        {
            "Parent ID": "t1_ecps16w",
            "Comment ID": "ecq9hkv",
            "Author": "vickar12",
            "Date Created": "12-28-2018 09:08:20",
            "Upvotes": 1,
            "Text": "I didn’t but at least I made a profit. I could have had 120K more",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqo0ul": [
        {
            "Parent ID": "t1_ecqneic",
            "Comment ID": "ecqo0ul",
            "Author": "CrapCloud",
            "Date Created": "12-28-2018 12:05:11",
            "Upvotes": 7,
            "Text": "Bitcoin can mewn without the US. Besides nation states that don't behave favorably towards Bitcoin will find themselves left in the dust and will have to scramble to catch up. The population with the most Bitcoin will win in the end. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr9wej": [
        {
            "Parent ID": "t1_ecqpjga",
            "Comment ID": "ecr9wej",
            "Author": "reddy10375",
            "Date Created": "12-28-2018 16:05:33",
            "Upvotes": 0,
            "Text": "Are there any limits ( in USA)  on Capital gains,  you could write off  IF you have HUGE Capital losses Accumulated from previous years.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqeudq": [
        {
            "Parent ID": "t1_ecqa2tc",
            "Comment ID": "ecqeudq",
            "Author": "aaj094",
            "Date Created": "12-28-2018 10:13:41",
            "Upvotes": 3,
            "Text": "Zero chance for any such Gcoin, FBcoin etc to displace Bitcoin. Read my response to your OP to see why I say this.\n\nSee also discussion on this on r/bitcoinmarkets\n\nhttps://www.reddit.com/r/BitcoinMarkets/comments/aa6r00/comment/ecq95rd",
            "Edited?": "12-28-2018 10:18:33",
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq7ykf": [
        {
            "Parent ID": "t1_ecq7o7p",
            "Comment ID": "ecq7ykf",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 08:47:31",
            "Upvotes": 1,
            "Text": ">2019 is going to be an interesting year. With some luck Bitcoin will actually become usable as a currency.\n\nwhat does this mean, what luck? How is Bitcoin not a usable currency?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecy4i9p": [
        {
            "Parent ID": "t1_ecuhg3n",
            "Comment ID": "ecy4i9p",
            "Author": "cryptogrip",
            "Date Created": "12-31-2018 10:12:21",
            "Upvotes": 1,
            "Text": "Forever is a bit lengthy lol.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs0hrn": [
        {
            "Parent ID": "t1_ecs0hdo",
            "Comment ID": "ecs0hrn",
            "Author": "lntipbot",
            "Date Created": "12-28-2018 22:07:17",
            "Upvotes": 1,
            "Text": "Hi u/my2sats, thanks for tipping u/xanmoth **42** satoshis!\n***\n*[^(More info)](https://www.reddit.com/r/lntipbot/wiki/index) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ectfsa3": [
        {
            "Parent ID": "t1_ecs32zm",
            "Comment ID": "ectfsa3",
            "Author": "The-Physicist",
            "Date Created": "12-29-2018 13:49:13",
            "Upvotes": 1,
            "Text": "> You're missing out on the entire history of money by not understanding this.\n\nThat’s very condescending. \n\n> If you were an old-timey gold miner, unless you were giving it away - you would need to sell it. So your wealth is going to be in something else, like camels or land. It's the same deal with Bitcoin.\n\nI don’t see that as a problem. I’d rather bitcoin be priced against real world items such as land and camels than a fiat built house of cards. \n\n\n> The bread sold in banana leaves is just as nutritious and valuable as the bread sold in Bitcoin, but what's the combined value of the new economy with two identical villages? It should be 42 million Bitcoin, but that's impossible.\n\nOne could argue that with the increase in supply of available bread from the POV of the bitcoin village, the residents of the bitcoin village could purchase the bread from the banana village for less bitcoin than would normally be required if buying from their own village.  Banana leaves are not finite as you can grow more bananas, so they are less valuable.  While this is a fun thought experiment I don’t think it applies to any real life scenario.  It assumes all the bitcoin wealth in the world would be concentrated in one group of people.  Obviously this would be a problem. It needs to be distributed among many people to foster a functional economy. \n",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecpyjin": [
        {
            "Parent ID": "t1_ecpy5kd",
            "Comment ID": "ecpyjin",
            "Author": "ihatemaps",
            "Date Created": "12-28-2018 05:22:47",
            "Upvotes": 9,
            "Text": "That's why you get short and long term disability. having crypto as your main saving is a terrible idea. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecraqev": [
        {
            "Parent ID": "t1_ecqo0ul",
            "Comment ID": "ecraqev",
            "Author": "BeowulfShaeffer",
            "Date Created": "12-28-2018 16:15:12",
            "Upvotes": 1,
            "Text": "And why will it?  I don’t see any use case for it right now that’s not either criminal or kind of crazy.  And I say this as someone who was really interested five years ago. Right now all I see happening in crypto is a huge zero-sum circle jerk of speculators selling to each other, scamming each other, or outright stealing from each other. \n  \nCan you point me to any legitimate commerce that’s actually being conducted using BTC as a primary currency? It’s been ten years, surely it’s thriving somewhere by now? Without legitimate commerce what’s going to drive adoption?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecrscah": [
        {
            "Parent ID": "t1_ecr9wej",
            "Comment ID": "ecrscah",
            "Author": "GreenStretch",
            "Date Created": "12-28-2018 20:04:53",
            "Upvotes": 1,
            "Text": "\"**Limit on Losses.** If a taxpayer’s capital losses are more than their capital gains, they can deduct the difference as a loss on their tax return. This loss is limited to $3,000 per year, or $1,500 if married and filing a separate return.  \n \n\n1. **Carryover Losses.** If a taxpayer’s total net capital loss is more than the limit they can deduct, they can carry it over to next year’s tax return.\"   [https://www.irs.gov/newsroom/capital-gains-and-losses-10-helpful-facts-to-know-0](https://www.irs.gov/newsroom/capital-gains-and-losses-10-helpful-facts-to-know-0)",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecs1n36": [
        {
            "Parent ID": "t1_ecr9wej",
            "Comment ID": "ecs1n36",
            "Author": "tbonecollion",
            "Date Created": "12-28-2018 22:24:44",
            "Upvotes": 1,
            "Text": "Im not sure last year as we all remember hit ath. So I made a profit so im not sure how loses went. But im sure I will find out this year. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq91ec": [
        {
            "Parent ID": "t1_ecq7ykf",
            "Comment ID": "ecq91ec",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 09:02:43",
            "Upvotes": 7,
            "Text": "Well, for starters I can't go to the local grocery store and purchase butter and bread with it. It's price is incredibly volatile, and hasn't been adopted by the public at large. It's not exactly \"easy to use\" for the layman either. For example my mother, father, siblings and coworkers - and probably their friends too - have very little idea about how to obtain Bitcoin, let alone use it.\n\nSo, generally speaking, it's far from being usable as a currency. If it was usable as a currency; I'd be paying my bills with it and using it to do the grocery shopping, fueling and servicing my car, and all myriad of other things I use money for.\n\nThis is what I mean by it not being usable as a currency. And I'm optimistic that services like Bakkt will lead to a wider adoption as well as services that make this more accessible.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqc0xp": [
        {
            "Parent ID": "t1_ecpyjin",
            "Comment ID": "ecqc0xp",
            "Author": "AlternativeGazelle",
            "Date Created": "12-28-2018 09:40:10",
            "Upvotes": 6,
            "Text": "Agreed.  \"If my luck goes bad I'll just go on welfare\"... I really hope this guy doesn't live in my country.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecr4ejh": [
        {
            "Parent ID": "t1_ecpyjin",
            "Comment ID": "ecr4ejh",
            "Author": "csbsju_guyyy",
            "Date Created": "12-28-2018 15:09:05",
            "Upvotes": 3,
            "Text": "Exactly. Invest only that which you're willing to lose forever. Don't use it as a damn piggy bank....at least in the current market",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq2ik6": [
        {
            "Parent ID": "t1_ecpyjin",
            "Comment ID": "ecq2ik6",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 07:12:35",
            "Upvotes": 1,
            "Text": ">   having crypto as your main saving is a terrible idea. \n\nhow do you know that? It might be the case for you, so please elaborate why is it a terrible idea for you.\n\n&#x200B;",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecq6feg": [
        {
            "Parent ID": "t1_ecpyjin",
            "Comment ID": "ecq6feg",
            "Author": "CoinedPrince",
            "Date Created": "12-28-2018 08:22:16",
            "Upvotes": -1,
            "Text": "Let OP live.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqa3ge": [
        {
            "Parent ID": "t1_ecq91ec",
            "Comment ID": "ecqa3ge",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 09:16:05",
            "Upvotes": 1,
            "Text": "> can't go to the local grocery store and purchase butter and bread with i t\n\nwhat you are describing is that it's not usable in commercial market. How often do you go to a grocery store that is not a chain store and therefore not a corporation? Its P2P money, it is much more usable in P2P context such as farmer's markets. \n\n>  It's not exactly \"easy to use\" for the layman either. \n\nI can guarantee you that there are users that don't speak english, barely know anything about computers or internet and are using it daily. How is that possible?  \n\n\nyou base your preception on your social context:\n\n> my mother, father, siblings and coworkers - and probably their friends too - have very little idea about how to obtain Bitcoin, let alone use it. \n\nand then: \n\n&#x200B;\n\n>So, generally speaking, it's far from being usable as a currency. \n\nPeople in your social buble do not know about bitcoin because there is no need for them to go and learn all of it.   \n\n\n> myriad of other things I use money for. \n\nif you can't see the struggle for your own priviledge, that is fine, but I attacked your argument for making generalizations about the population from the position of the priviledge. ",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqaohf": [
        {
            "Parent ID": "t1_ecqa3ge",
            "Comment ID": "ecqaohf",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 09:23:32",
            "Upvotes": 1,
            "Text": ">what you are describing is that it's not usable in commercial market.\n\nYes, I suppose I am.\n\n \\>  People in your social buble do not know about bitcoin because there is no need for them to go and learn all of it. \n\nIsn't that counter-intuitive to the idea about Bitcoin? There is every need for them to go an learn it. But it won't happen with Bitcoin in it's current state. Maybe in a few more years when it is usable as a currency in the commercial market.\n\n\\> Something about privilege \n\nRighto chap, cheerio.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqb03a": [
        {
            "Parent ID": "t1_ecqaohf",
            "Comment ID": "ecqb03a",
            "Author": "[deleted]",
            "Date Created": "12-28-2018 09:27:32",
            "Upvotes": 1,
            "Text": "> Maybe in a few more years when it is usable as a currency in the commercial market \n\nwho said the adoption is going to/need to happen in the US?",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ],
    "ecqbi7w": [
        {
            "Parent ID": "t1_ecqb03a",
            "Comment ID": "ecqbi7w",
            "Author": "Toolbox1227",
            "Date Created": "12-28-2018 09:33:48",
            "Upvotes": 3,
            "Text": "\\>  who said the adoption is going to/need to happen in the US? \n\nUhh, not me? In fact, apart from you asking that question the implication never even came up.",
            "Edited?": false,
            "Is Submitter?": false,
            "Stickied?": false
        }
    ]
}